{
    "kategori": "Kitab Sejarah",
    "hadits": [
        {
            "number": 2328,
            "arab": " حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ شُعْبَةَ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ عُمَارَةَ بْنِ حَدِيدٍ عَنْ صَخْرٍ الْغَامِدِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اللَّهُمَّ بَارِكْ لِأُمَّتِي فِي بُكُورِهَا وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا بَعَثَ سَرِيَّةً بَعَثَهَا مِنْ أَوَّلِ النَّهَارِ قَالَ فَكَانَ هَذَا الرَّجُلُ رَجُلًا تَاجِرًا فَكَانَ يَبْعَثُ غِلْمَانَهُ مِنْ أَوَّلِ النَّهَارِ فَكَثُرَ مَالُهُ",
            "id": "Telah menceritakan kepada kami [Sa'id bin 'Amir] dari [Syu'bah] dari [Ya'la bin 'Atha`] dari ['Umarah bin Hadid] dari [Shakhr Al Ghamidi] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ya Allah, berkahilah umatku dipagi harinya.\" Apabila Rasulullah shallallahu 'alaihi wasallam mengirim suatu pasukan, maka beliau mengirimnya diawal siang. Shakhr berkata; \"Seorang pedagang pernah mengutus budaknya (pergi) diawal siang, ternyata ia memperoleh harta yang melimpah."
        },
        {
            "number": 2329,
            "arab": " حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ أَخْبَرَنَا يُونُسُ عَنْ الزُّهْرِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبٍ عَنْ أَبِيهِ قَالَ لَقَلَّمَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْرُجُ إِذَا أَرَادَ سَفَرًا إِلَّا يَوْمَ الْخَمِيسِ",
            "id": "Telah menceritakan kepada kami [Utsman bin Umar] telah mengabarkan kepada kami [Yunus] dari [Az Zuhri] dari [Abdurrahman bin Ka'b] dari [Ayahnya], ia berkata; \"Sungguh jarang sekali Rasulullah shallallahu 'alaihi wasallam keluar bepergian kecuali pada hari Kamis.\""
        },
        {
            "number": 2330,
            "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ حَدَّثَنَا حَيْوَةُ وَابْنُ لَهِيعَةَ قَالَا حَدَّثَنَا شُرَحْبِيلُ بْنُ شَرِيكٍ أَنَّهُ سَمِعَ أَبَا عَبْدِ الرَّحْمَنِ الْحُبُلِيَّ يُحَدِّثُ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خَيْرُ الْأَصْحَابِ عِنْدَ اللَّهِ خَيْرُهُمْ لِصَاحِبِهِ وَخَيْرُ الْجِيرَانِ عِنْدَ اللَّهِ خَيْرُهُمْ لِجَارِهِ",
            "id": "Telah menceritakan kepada kami [Abdullah bin Yazid] telah menceritakan kepada kami [Haiwah] dan [Ibnu Lahi'ah] keduanya berkata; telah menceritakan kepada kami [Syurahbil bin Syarik] bahwa ia mendengar [Abu Abdurrahman Al Hubuli] menceritakan dari [Abdullah bin 'Amr bin Al 'Ash] dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Sebaik-baik sahabat di sisi Allah adalah yang paling baik kepada sahabatnya, dan sebaik-baik tetangga di sisi Allah adalah yang paling baik terhadap tetangganya.\" "
        },
        {
            "number": 2331,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ الصَّلْتِ حَدَّثَنَا حِبَّانُ بْنُ عَلِيٍّ عَنْ يُونُسَ وَعُقَيْلٍ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ الْأَصْحَابِ أَرْبَعَةٌ وَخَيْرُ الْجُيُوشِ أَرْبَعَةُ آلَافٍ وَخَيْرُ السَّرَايَا أَرْبَعُ مِائَةٍ وَمَا بَلَغَ اثْنَا عَشَرَ أَلْفًا فَصَبَرُوا وَصَدَقُوا فَغُلِبُوا مِنْ قِلَّةٍ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shalt] telah menceritakan kepada kami [Hibban bin Ali] dari [Yunus] serta ['Uqail] dari [Ibnu Syihab] dari ['Ubaidullah bin Abdullah] dari [Ibnu Abbas], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik sahabat adalah empat orang, dan sebaik-baik pasukan adalah empat ribu, dan sebaik-baik satuan pasukan adalah empat ratus dan tidaklah mereka mencapai dua belas ribu, lalu bersabar dan jujur maka mereka tidak akan terkalahkan.\""
        },
        {
            "number": 2332,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَمَّرَ رَجُلًا عَلَى سَرِيَّةٍ أَوْصَاهُ فِي خَاصَّةِ نَفْسِهِ بِتَقْوَى اللَّهِ وَبِمَنْ مَعَهُ مِنْ الْمُسْلِمِينَ خَيْرًا وَقَالَ اغْزُوا بِسْمِ اللَّهِ وَفِي سَبِيلِ اللَّهِ قَاتِلُوا مَنْ كَفَرَ بِاللَّهِ اغْزُوا وَلَا تَغْدِرُوا وَلَا تَغُلُّوا وَلَا تُمَثِّلُوا وَلَا تَقْتُلُوا وَلِيدًا",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Sufyan] dari ['Alqamah bin Martsad] dari [Sulaiman bin Buraidah] dari [ayahnya] ia berkata; Apabila Rasulullah shallallahu 'alaihi wasallam mengangkat seseorang sebagai pemimpin ekspedisi, beliau mewasiatkan kepadanya secara khusus agar bertakwa kepada Allah dan berbuat baik kepada orang-orang muslim yang bersamanya. Beliau bersabda: \"Berperanglah dengan nama Allah, dan di jalan Allah. Perangilah orang kafir kepada Allah, berperanglah kalian dan janganlah mundur, jangan mencuri rampasan perang, jangan mencincang dan jangan membunuh anak kecil.\""
        },
        {
            "number": 2333,
            "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ زِيَادٍ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَتَمَنَّوْا لِقَاءَ الْعَدُوِّ وَسَلُوا اللَّهَ الْعَافِيَةَ فَإِنْ لَقِيتُمُوهُمْ فَاثْبُتُوا وَأَكْثِرُوا ذِكْرَ اللَّهِ فَإِنْ أَجْلَبُوا وَضَجُّوا فَعَلَيْكُمْ بِالصَّمْتِ",
            "id": "Telah mengabarkan kepada kami [Abdullah bin Yazid] telah menceritakan kepada kami [Abdurrahman bin Yazid] dari [Abdullah bin Yazid] dari [Abdullah bin 'Amr] bahwa Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Janganlah kalian berangan-angan bertemu dengan musuh, dan mohonlah keselamatan kepada Allah, apabila kalian bertemu dengan musuh, maka teguhkanlah dan perbanyaklah berdzikir kepada Allah, apabila mereka berteriak dan membuat gaduh, maka kalian harus diam.\""
        },
        {
            "number": 2334,
            "arab": " أَخْبَرَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا حَمَّادٌ عَنْ ثَابِتٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ صُهَيْبٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْعُو أَيَّامَ حُنَيْنٍ اللَّهُمَّ بِكَ أُحَاوِلُ وَبِكَ أُصَاوِلُ وَبِكَ أُقَاتِلُ",
            "id": "Telah mengabarkan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Hammad] dari [Tsabit] dari [Abdurrahman bin Abu Laila] dari [Shuhaib] bahwa Rasulullah shallallahu 'alaihi wasallam berdoa pada saat perang Hunain: \"Ya Allah, dengan-Mu aku berusaha, dengan-Mu kami menyerbu, dan dengan-Mu aku menyerang.\""
        },
        {
            "number": 2335,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَمَّرَ رَجُلًا عَلَى سَرِيَّةٍ أَوْصَاهُ إِذَا لَقِيتَ عَدُوَّكَ مِنْ الْمُشْرِكِينَ فَادْعُهُمْ إِلَى إِحْدَى ثَلَاثِ خِلَالٍ أَوْ خِصَالٍ فَأَيَّتُهُمْ مَا أَجَابُوكَ إِلَيْهَا فَاقْبَلْ مِنْهُمْ وَكُفَّ عَنْهُمْ ثُمَّ ادْعُهُمْ إِلَى الْإِسْلَامِ فَإِنْ هُمْ أَجَابُوكَ فَاقْبَلْ مِنْهُمْ وَكُفَّ عَنْهُمْ ثُمَّ ادْعُهُمْ إِلَى التَّحَوُّلِ مِنْ دَارِهِمْ إِلَى دَارِ الْمُهَاجِرِينَ وَأَخْبِرْهُمْ إِنْ هُمْ فَعَلُوا أَنَّ لَهُمْ مَا لِلْمُهَاجِرِينَ وَأَنَّ عَلَيْهِمْ مَا عَلَى الْمُهَاجِرِينَ فَإِنْ هُمْ أَبَوْا فَأَخْبِرْهُمْ أَنَّهُمْ يَكُونُونَ كَأَعْرَابِ الْمُسْلِمِينَ يَجْرِي عَلَيْهِمْ حُكْمُ اللَّهِ الَّذِي يَجْرِي عَلَى الْمُؤْمِنِينَ وَلَيْسَ لَهُمْ فِي الْفَيْءِ وَالْغَنِيمَةِ نَصِيبٌ إِلَّا أَنْ يُجَاهِدُوا مَعَ الْمُسْلِمِينَ فَإِنْ هُمْ أَبَوْا أَنْ يَدْخُلُوا فِي الْإِسْلَامِ فَسَلْهُمْ إِعْطَاءَ الْجِزْيَةِ فَإِنْ فَعَلُوا فَاقْبَلْ مِنْهُمْ وَكُفَّ عَنْهُمْ فَإِنْ هُمْ أَبَوْا فَاسْتَعِنْ بِاللَّهِ وَقَاتِلْهُمْ وَإِنْ حَاصَرْتَ أَهْلَ حِصْنٍ فَإِنْ أَرَادُوكَ أَنْ تَجْعَلَ لَهُمْ ذِمَّةَ اللَّهِ وَذِمَّةَ نَبِيِّهِ فَلَا تَجْعَلْ لَهُمْ ذِمَّةَ اللَّهِ وَلَا ذِمَّةَ نَبِيِّهِ وَلَكِنْ اجْعَلْ لَهُمْ ذِمَّتَكَ وَذِمَّةَ أَبِيكَ وَذِمَّةَ أَصْحَابِكَ فَإِنَّكُمْ إِنْ تُخْفِرُوا بِذِمَّتِكُمْ وَذِمَّةِ آبَائِكُمْ أَهْوَنُ عَلَيْكُمْ مِنْ أَنْ تُخْفِرُوا ذِمَّةَ اللَّهِ وَذِمَّةَ رَسُولِهِ وَإِنْ حَاصَرْتَ حِصْنًا فَأَرَادُوكَ أَنْ يَنْزِلُوا عَلَى حُكْمِ اللَّهِ فَلَا تُنْزِلْهُمْ عَلَى حُكْمِ اللَّهِ وَلَكِنْ أَنْزِلْهُمْ عَلَى حُكْمِكَ فَإِنَّكَ لَا تَدْرِي أَتُصِيبُ حُكْمَ اللَّهِ فِيهِمْ أَمْ لَا ثُمَّ اقْضِ فِيهِمْ بِمَا شِئْتَ قَالَ عَلْقَمَةُ فَحَدَّثْتُ بِهِ مُقَاتِلَ بْنَ حَيَّانَ فَقَالَ حَدَّثَنِي مُسْلِمُ بْنُ هَيْصَمٍ عَنْ النُّعْمَانِ بْنِ مُقَرِّنٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Sufyan] dari ['Alqamah bin Martsad] dari [Sulaiman bin Buraidah] dari [Ayahnya] ia berkata; Apabila Rasulullah shallallahu 'alaihi wasallam mengangkat seseorang sebagai pemimpin ekspedisi, beliau akan berwasiat kepadanya: \"Apabila engkau berjumpa dengan musuh dari kaum musyrikin, maka ajaklah mereka kepada salah satu tiga perkara, yaitu; Siapapun diantara mereka yang memenuhi seruanmu untuk melakukannya maka terimalah mereka, dan tahanlah untuk tidak menyerang mereka, kemudian ajaklah mereka kepada Islam. Apabila mereka memenuhi seruanmu maka terimalah dan tahanlah untuk tidak menyerang mereka, kemudian ajaklah mereka agar berpindah dari negeri mereka menuju negeri hijrah, dan beritahukan kepada mereka, apabila mereka melakukan hal itu maka bagi mereka apa yang menjadi hak orang-orang muhajirin dan apa yang menjadi kewajiban mereka adalah yang menjadi kewajiban orang-orang muhajirin. Apabila mereka menolak maka beritahukan kepada mereka bahwa mereka seperti orang-orang badui muslim yang diberlakukan atas mereka hukum Allah sebagaimana yang berlaku terhadap orang-orang mukmin dan mereka tidak memiliki bagian fai` dan rampasan perang kecuali mereka berjihad bersama orang-orang muslim. Dan apabila mereka menolak untuk masuk Islam, maka mintalah mereka supaya membayar Jizyah, apabila mereka melakukan hal itu, maka terimalah mereka dan tahanlah untuk tidak menyerang mereka, apabila mereka menolak, maka mintalah pertolongan Allah dan perangilah mereka. Apabila engkau mengepung penghuni benteng, kemudian mereka ingin agar engkau memberikan kepada mereka perlindungan Allah dan perlindungan NabiNya, maka janganlah engkau memberikan kepada mereka perlindungan Allah dan perlindungan NabiNya, akan tetapi berikan kepada mereka perlindunganmu, perlindungan ayahmu dan perlindungan para sahabamu. Karena apabila engkau salah dalam memberikan perlindungan kalian serta bapak-bapak kalian, hal itu lebih ringan daripada kalian salah dalam memberikan perlindungan Allah dan RasulNya. Apabila engkau mengepung benteng dan mereka hendak memutuskan (perkara) dengan hukum Allah, maka janganlah engkau memutuskan (perkara) mereka dengan hukum Allah, akan tetapi putusilah mereka dengan hukummu. Karena engkau tidak mengetahui apakah engkau sesuai dengan hukum Allah mengenai mereka atau tidak. Kemudian berilah keputusan mengenai mereka sesuai kehendakmu.\" ['Alqamah] berkata; kemudian aku menceritakannya kepada [Muqatil bin Hayyan] lalu ia berkata; telah menceritkan kepadaku [Muslim bin Haisham] dari [An Nu'man bin Muqarrin] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas."
        },
        {
            "number": 2336,
            "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ سُفْيَانَ عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَ مَا قَاتَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَوْمًا حَتَّى دَعَاهُمْ قَالَ عَبْد اللَّهِ سُفْيَانُ لَمْ يَسْمَعْ مِنْ ابْنِ أَبِي نَجِيحٍ يَعْنِي هَذَا الْحَدِيثَ",
            "id": "Telah mengabarkan kepada kami ['Ubaidullah bin Musa] dari [Sufyan] dari [Ibnu Abu Najih] dari [Ayahnya] dari [Ibnu Abbas], ia berkata; Tidaklah Rasulullah shallallahu 'alaihi wasallam memerangi suatu kaum hingga beliau mengajak mereka (kepada Islam).\" Abdullah berkata; Sufyan tidak mendengar hadits ini dari Ibnu Najih.\""
        },
        {
            "number": 2337,
            "arab": " حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُغِيرُ عِنْدَ صَلَاةِ الْفَجْرِ وَكَانَ يَسْتَمِعُ فَإِنْ سَمِعَ أَذَانًا أَمْسَكَ وَإِنْ لَمْ يَسْمَعْ أَذَانًا أَغَارَ",
            "id": "Telah menceritakan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Hammad bin Salamah] dari [Tsabit] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam pernah menyerang dengan tiba-tiba ketika waktu Shubuh, dan beliau mendengarkan dengan cermat, apabila beliau mendengar adzan, maka beliau menahan diri, dan apabila tidak mendengar adzan, maka beliau menyerang.\""
        },
        {
            "number": 2338,
            "arab": " أَخْبَرَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا شُعْبَةُ عَنْ النُّعْمَانِ بْنِ سَالِمٍ قَالَ سَمِعْتُ أَوْسَ بْنَ أَبِي أَوْسٍ الثَّقَفِيَّ قَالَ أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي وَفْدِ ثَقِيفٍ قَالَ وَكُنْتُ فِي أَسْفَلِ الْقُبَّةِ لَيْسَ فِيهَا أَحَدٌ إِلَّا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَائِمٌ إِذْ أَتَاهُ رَجُلٌ فَسَارَّهُ فَقَالَ اذْهَبْ فَاقْتُلْهُ ثُمَّ قَالَ أَلَيْسَ يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ قَالَ شُعْبَةُ وَأَشُكُّ مُحَمَّدًا رَسُولُ اللَّهِ قَالَ بَلَى قَالَ إِنِّي أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لَا إِلَهَ إِلَّا اللَّهُ فَإِذَا قَالُوهَا حَرُمَتْ عَلَيَّ دِمَاؤُهُمْ وَأَمْوَالُهُمْ إِلَّا بِحَقِّهَا وَحِسَابُهُمْ عَلَى اللَّهِ قَالَ وَهُوَ الَّذِي قَتَلَ أَبَا مَسْعُودٍ قَالَ وَمَا مَاتَ حَتَّى قَتَلَ خَيْرَ إِنْسَانٍ بِالطَّائِفِ",
            "id": "Telah mengabarkan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami [Syu'bah] dari [An Nu'man bin Salim], ia berkata; aku mendengar [Aus bin Abu Aus Ats Tsaqafi] ia berkata; aku datang menemui Rasulullah shallallahu 'alaihi wasallam di antara delegasi Tsaqif, Aus melanjutkan; \"Ketika itu aku berada di bawah tenda, dan tidak ada seorangpun di dalam tebda tersebut kecuali Nabi shallallahu 'alaihi wasallam yang sedang tidur, tiba-tiba seorang laki-laki datang kepada beliau sambil berbisik, beliau bersabda: \"Pergilah dan bunuhlah dia.\" Kemudian beliau bersabda: \"Bukankah ia telah mengucapkan bahwa tidak ada sesembahan yang berhak disembah selain Allah?\" - [Syu'bah] berkata; dan saya ragu apakah beliau mengatakan: \"Dan aku adalah rasulullah?.\"- Orang tersebut berkata; \"Ya.\" Beliau bersabda: \"Sesungguhnya aku diperintahkan untuk memerangi manusia hingga mereka mengucapkan; tidak ada sesembahan yang berhak disembah selain Allah., apabila mereka mengucapkan hal itu, maka telah haram atasku darah dan harta mereka kecuali dengan haknya dan perhitungannya kembali kepada Allah.\" Aus bin Abu Aus Ats Tsaqafi berkata; \"Orang tersebut adalah yang membunuh Abu Mas'ud. Dan tidaklah ia mati sampai ia membunuh orang-orang terbaik di Tha`if."
        },
        {
            "number": 2339,
            "arab": " أَخْبَرَنَا يَعْلَى حَدَّثَنَا الْأَعْمَشُ عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَحِلُّ دَمُ رَجُلٍ يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ إِلَّا إِحْدَى ثَلَاثَةِ نَفَرٍ النَّفْسُ بِالنَّفْسِ وَالثَّيِّبُ الزَّانِي وَالتَّارِكُ لِدِينِهِ الْمُفَارِقُ لِلْجَمَاعَةِ",
            "id": "Telah mengabarkan kepada kami [Ya'la] telah menceritakan kepada kami [Al A'masy] dari [Abdullah bin Murrah] dari [Masruq] dari [Abdullah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal darah seseorang yang bersaksi bahwa tidak ada sesembahan yang berhak disembah selain Allah, kecuali salah satu dari tiga orang, yaitu; orang yang dibunuh karena membunuh jiwa, janda (duda) yang berzina, orang yang meninggalkan agamanya dan memisahkan diri dari jama'ah.\""
        },
        {
            "number": 2340,
            "arab": " حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا الْأَسْوَدُ بْنُ شَيْبَانَ عَنْ خَالِدِ بْنِ سُمَيْرٍ قَالَ قَدِمَ عَلَيْنَا عَبْدُ اللَّهِ بْنُ رَبَاحٍ الْأَنْصَارِيُّ وَكَانَتْ الْأَنْصَارُ تُفَقِّهُهُ قَالَ حَدَّثَنَا أَبُو قَتَادَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ جَيْشَ الْأُمَرَاءِ قَالَ فَانْطَلَقُوا فَلَبِثُوا مَا شَاءَ اللَّهُ ثُمَّ صَعِدَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمِنْبَرَ فَأَمَرَ فَنُودِيَ الصَّلَاةُ جَامِعَةٌ",
            "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Al Aswad bin Syaiban] dari [Khalid bin Sumair] ia berkata; [Abdullah bin Rabah Al Anshari] datang kepada kami, sementara orang-orang Anshar-lah yang memberikan pemahaman kepadanya, ia berkata; telah menceritakan kepada kami [Abu Qatadah] bahwa Rasulullah shallallahu 'alaihi wasallam pernah mengutus pasukan Umara` (pasukan pada saat perang mu'tah), Abdullah bin Rabah berkata; kemudian mereka pergi dan tinggal dalam waktu yang dikehendaki Allah, kemudian Rasulullah shallallahu 'alaihi wasallam naik mimbar, beliau memerintahkan agar dikumandangkan seruan untuk shalat berjama'ah, maka diserulah; \"Shalat berjama'ah!.\""
        },
        {
            "number": 2341,
            "arab": " أَخْبَرَنَا الْأَسْوَدُ بْنُ عَامِرٍ حَدَّثَنَا شَرِيكٌ عَنْ الْأَعْمَشِ عَنْ أَبِي عَمْرٍو الشَّيْبَانِيِّ عَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُسْتَشَارُ مُؤْتَمَنٌ",
            "id": "Telah mengabarkan kepada kami [Al Aswad bin 'Amir] telah menceritakan kepada kami [Syarik] dari [Al A'masy] dari [Abu 'Amr Asy Syaibani] dari [Abu Mas'ud Al Anshari] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Hendaknya orang yang dimintai nasehat adalah orang yang dapat dipercaya (amanah).\""
        },
        {
            "number": 2342,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يَزِيدَ الْحِزَامِيُّ حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ عَنْ كَعْبِ بْنِ مَالِكٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادَ غَزْوَةً وَرَّى بِغَيْرِهَا",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Yazid Al Hizami] telah menceritakan kepada kami [Ibnu Al Mubarak] dari [Ma'mar] dari [Az Zuhri] dari [Abdurrahman bin Ka'b bin Malik] dari [Ka'b Malik] ia berkata; \"Apabila Rasulullah shallallahu 'alaihi wasallam hendak berperang, maka beliau merahasiakannya.\""
        },
        {
            "number": 2343,
            "arab": " حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا وَكِيعٌ عَنْ أَبِي عُمَيْسٍ عَنْ إِيَاسِ بْنِ سَلَمَةَ بْنِ الْأَكْوَعِ عَنْ أَبِيهِ قَالَ بَارَزْتُ رَجُلًا فَقَتَلْتُهُ فَنَفَّلَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَلَبَهُ فَكَانَ شِعَارُنَا مَعَ خَالِدِ بْنِ الْوَلِيدِ أَمِتْ يَعْنِي اقْتُلْ",
            "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah menceritakan kepada kami [Waki'] dari [Abu 'Umais] dari [Iyas bin Salamah bin Al Akwa'] dari [Ayahnya] ia berkata; \"Aku pernah perang tanding melawan seseorang, kemudian aku membunuhnya, lalu Rasulullah shallallahu 'alaihi wasallam memberiku segala sesuatu yang melekat pada musuh tersebut, sedangkan motto kami bersama Khalid bin Al Walid adalah matikan; \"Yaitu bunuhlah!.\""
        },
        {
            "number": 2344,
            "arab": " حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ وَعَفَّانُ قَالَا حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ عَبْدِ اللَّهِ بْنِ يَسَارٍ أَبِي هَمَّامٍ عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْفِهْرِيِّ قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ حُنَيْنٍ فَكُنَّا فِي يَوْمٍ قَائِظٍ شَدِيدِ الْحَرِّ فَنَزَلْنَا تَحْتَ ظِلَالِ الشَّجَرِ فَذَكَرَ الْقِصَّةَ ثُمَّ أَخَذَ كَفًّا مِنْ تُرَابٍ قَالَ فَحَدَّثَنِي الَّذِي هُوَ أَقْرَبُ إِلَيْهِ مِنِّي أَنَّهُ ضَرَبَ بِهِ وُجُوهَهُمْ وَقَالَ شَاهَتْ الْوُجُوهُ فَهَزَمَ اللَّهُ الْمُشْرِكِينَ قَالَ يَعْلَى فَحَدَّثَنِي أَبْنَاؤُهُمْ أَنَّ أَبَاءَهُمْ قَالُوا فَمَا بَقِيَ مِنَّا أَحَدٌ إِلَّا امْتَلَأَتْ عَيْنَاهُ وَفَمُهُ تُرَابًا",
            "id": "Telah menceritakan kepada kami [Hajjaj bin Minhal] dan ['Affan] keduanya berkata; telah menceritakan kepada kami [Hammad bin Salamah] dari [Ya'la bin 'Atha`] dari [Abdullah bin Yasar Abu Hammam] dari [Abu Abdurrahman Al Fihri] ia berkata; kami bersama Rasulullah shallallahu 'alaihi wasallam dalam perang Hunain, ketika itu kami berada di hari yang sangat panas, kami pun singgah di bawah naungan pohon.\" Abdurrahman lalu menyebutkan kisah tersebut, \"…kemudian beliau mengambil segenggam tanah. Perawi berkata; telah menceritakan kepadaku orang yang lebih dekat denganku bahwa beliau menaburi wajah musuh dengan tanah tersebut sambil bersabda: \"Wajah-wajah yang buruk.\" Kemudian Allah mengalahkan orang-orang musyrik.\" Ya'la berkata; telah menceritakan kepadaku anak-anak mereka, bahwa bapak-bapak mereka berkata; \"Tidak ada seorangpun dari kami (waktu itu) melainkan mata dan mulut kami penuh dengan tanah.\""
        },
        {
            "number": 2345,
            "arab": " حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ حَدَّثَنَا يُونُسُ عَنْ الزُّهْرِيِّ عَنْ أَبِي إِدْرِيسَ عَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَ قَالَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ مَعَهُ فِي مَجْلِسٍ بَايِعُونِي عَلَى أَنْ لَا تُشْرِكُوا بِاللَّهِ شَيْئًا وَلَا تَسْرِقُوا وَلَا تَزْنُوا وَلَا تَقْتُلُوا أَوْلَادَكُمْ وَلَا تَأْتُوا بِبُهْتَانٍ تَفْتَرُونَهُ بَيْنَ أَيْدِيكُمْ وَأَرْجُلِكُمْ فَمَنْ وَفَى مِنْكُمْ فَأَجْرُهُ عَلَى اللَّهِ وَمَنْ أَصَابَ شَيْئًا مِنْ ذَلِكَ فَسَتَرَهُ اللَّهُ فَأَمْرُهُ إِلَى اللَّهِ إِنْ شَاءَ عَاقَبَهُ وَإِنْ شَاءَ عَفَا عَنْهُ وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا فَعُوقِبَ بِهِ فِي الدُّنْيَا فَهُوَ كَفَّارَةٌ لَهُ قَالَ فَبَايَعْنَاهُ عَلَى ذَلِكَ",
            "id": "Telah menceritakan kepada kami [Utsman bin Umar] telah menceritakan kepada kami [Yunus] dari [Az Zuhri] dari [Abu Idris] dari ['Ubadah bin Ash Shamit] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepada kami, keitka kami bersama beliau disuatu majelis: \"Berbai'atlah kepadaku untuk tidak mensekutukan Allah dengan sesuatupun, tidak mencuri, tidak berzina, tidak membunuh anak-anak kalian dan tidak mengadakan kebohongan yang kalian ada-adakan antara tangan dan kaki kalian. Barangsiapa memenuhinya, maka pahalanya di sisi Allah. Dan barangsiapa melakukan satu dari hal tersebut, kemudian Allah menutupinya, maka urusannya kembali kepada Allah, apabila Allah menghendaki, maka Dia akan menghukumnya dan apabila Allah menghendaki maka Dia akan memaafkannya. Dan barangsiapa melakukan satu dari hal tersebut kemudian dihukum di dunia, maka hal itu sebagai penghapus dosa baginya.\" 'Ubadah bin Ash Shamit berkata; kemudian kami berbai'at kepada beliau untuk hal itu.\""
        },
        {
            "number": 2346,
            "arab": " أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّهُ قَالَ كُنَّا يَوْمَ الْحُدَيْبِيَةِ أَلْفًا وَأَرْبَعَ مِائَةٍ فَبَايَعْنَاهُ وَعُمَرُ آخِذٌ بِيَدِهِ تَحْتَ الشَّجَرَةِ وَهِيَ سَمُرَةٌ وَقَالَ بَايَعْنَاهُ عَلَى أَنْ لَا نَفِرَّ وَلَمْ نُبَايِعْهُ عَلَى الْمَوْتِ",
            "id": "Telah mengabarkan kepada kami [Ahmad bin Abdullah] telah menceritakan kepada kami [Laits bin Sa'd] dari [Abu Az Zubair] dari [Jabir bin Abdullah] bahwa ia berkata; \"Pada saat perjanjian Hudaibiyah, kami berjumlah seribu empat ratus orang, kemudian kami berbai'at kepada beliau, sementara Umar menggandeng tangan beliau di bawah Pohon Samurah.\" Jabir berkata; \"Kami berbai'at kepada beliau untuk tidak lari dan tidak berbai'at untuk mati.\""
        },
        {
            "number": 2347,
            "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ حَدَّثَنَا شُعْبَةُ حَدَّثَنَا أَبُو إِسْحَقَ قَالَ سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ يَقُولُ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْقُلُ مَعَنَا التُّرَابَ يَوْمَ الْأَحْزَابِ وَقَدْ وَارَى التُّرَابُ بَيَاضَ إِبِطَيْهِ وَهُوَ يَقُولُ اللَّهُمَّ لَوْلَا أَنْتَ مَا اهْتَدَيْنَا وَلَا تَصَدَّقْنَا وَلَا صَلَّيْنَا فَأَنْزِلَنَّ سَكِينَةً عَلَيْنَا وَثَبِّتْ الْأَقْدَامَ إِنْ لَاقَيْنَا إِنَّ الْأُولَى قَدْ بَغَوْا عَلَيْنَا وَإِنْ أَرَادُوا فِتْنَةً أَبَيْنَا وَيَرْفَعُ بِهَا صَوْتَهُ",
            "id": "Telah mengabarkan kepada kami [Abu Al Walid] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami [Abu Ishaq] ia berkata; Aku mendengar [Al Bara` bin 'Azib] berkata; Kami bersama Rasulullah shallallahu 'alaihi wasallam pernah memindahkan tanah pada saat perang Ahzab, tanah tersebut telah menutupi kedua ketiak beliau yang putih, sementara beliau bersenandung: \"Ya Allah, seandainya bukan karenaMu, maka kami tidak akan mendapatkan petunjuk, tidak akan bersedekah dan tidak akan melakukan shalat, maka turunkanlah ketenangan kepada kami, serta kokohkan kaki-kaki kami apabila bertemu dengan musuh. Sesungguhnya orang-orang musyrik telah berlaku semena-mena kepada kami, apabila mereka menghendaki fitnah, maka kami menolaknya.\" Beliau menyenandungkan itu sambil mengeraskan suaranya."
        },
        {
            "number": 2348,
            "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ خَالِدِ بْنِ حَازِمٍ حَدَّثَنَا مَالِكٌ عَنْ الزُّهْرِيِّ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ مَكَّةَ عَامَ الْفَتْحِ وَعَلَى رَأْسِهِ مِغْفَرٌ فَلَمَّا نَزَعَهُ جَاءَهُ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ هَذَا ابْنُ خَطَلٍ مُتَعَلِّقٌ بِأَسْتَارِ الْكَعْبَةِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْتُلُوهُ",
            "id": "Telah menceritakan kepada kami [Abdullah bin Khalid bin Hazim] telah menceritakan kepada kami [Malik] dari [Az Zuhri] dari [Anas] bahwa pada waktu penaklukan kota Makkah, Nabi shallallahu 'alaihi wasallam memasuki kota Makkah sambil mengenakan penutup kepala diatas kepala beliau, ketika beliau membukannya, seorang laki-laki langsung menemuinya sambil berkata; \"Wahai Rasulullah, ini Ibnu Khathal sedang bergelayutan ditirai Ka'bah.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bunuhlah dia! \""
        },
        {
            "number": 2349,
            "arab": " أَخْبَرَنَا أَبُو النُّعْمَانِ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَ كَانَ قَبِيعَةُ سَيْفِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ فِضَّةٍ قَالَ عَبْد اللَّهِ هِشَامٌ الدَّسْتَوَائِيُّ خَالَفَهُ قَالَ قَتَادَةُ عَنْ سَعِيدِ بْنِ أَبِي الْحَسَنِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَزَعَمَ النَّاسُ أَنَّهُ هُوَ الْمَحْفُوظُ",
            "id": "Telah mengabarkan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Jarir bin Hazim] dari [Qatadah] dari [Anas], ia berkata; \"Sarung pedang Nabi shallallahu 'alaihi wasallam terbuat dari perak.\" Abdullah berkata; namun [Hisyam Ad Dastawa`i] menyelisihinya. [Qatadah] mengatakan dari [Sa'id bin Al Hasan] dari Nabi shallallahu 'alaihi wasallam...\" sementara orang-orang menyangka bahwa hadits tersebut adalah hadits mahfuzh.\""
        },
        {
            "number": 2350,
            "arab": " أَخْبَرَنَا الْمُعَلَّى بْنُ أَسَدٍ حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ عَنْ أَبِي طَلْحَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا ظَهَرَ عَلَى قَوْمٍ أَحَبَّ أَنْ يُقِيمَ بِعَرْصَتِهِمْ ثَلَاثًا",
            "id": "Telah mengabarkan kepada kami [Al Mu'alla bin Asad] telah menceritakan kepada kami [Mu'adz bin Mu'adz] telah menceritakan kepada kami [Sa'id bin Abu 'Arubah] dari [Qatadah] dari [Anas] dari [Abu Thalhah] bahwa apabila Nabi shallallahu 'alaihi wasallam menang terhadap suatu kaum, maka beliau senang tinggal di wilayah mereka selama tiga hari.\""
        },
        {
            "number": 2351,
            "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ حَرَّقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَخْلَ بَنِي النَّضِيرِ",
            "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami ['Uqbah bin Khalid] telah menceritakan kepada kami ['Ubaidullah] dari [Nafi'] dari [Ibnu Umar] ia berkata; Rasulullah shallallahu 'alaihi wasallam pernah membakar pohon kurma Bani Nadhir.\""
        },
        {
            "number": 2352,
            "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ بْنِ أَبَانَ حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ أَبِي إِسْحَقَ الدَّوْسِيِّ عَنْ أَبِي هُرَيْرَةَ الدَّوْسِيِّ قَالَ بَعَثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَرِيَّةٍ فَقَالَ إِنْ ظَفِرْتُمْ بِفُلَانٍ وَفُلَانٍ فَحَرِّقُوهُمَا بِالنَّارِ حَتَّى إِذَا كَانَ الْغَدُ بَعَثَ إِلَيْنَا فَقَالَ إِنِّي كُنْتُ أَمَرْتُكُمْ بِتَحْرِيقِ هَذَيْنِ الرَّجُلَيْنِ ثُمَّ رَأَيْتُ أَنَّهُ لَا يَنْبَغِي لِأَحَدٍ أَنْ يُعَذِّبَ بِالنَّارِ إِلَّا اللَّهُ فَإِنْ ظَفِرْتُمْ بِهِمَا فَاقْتُلُوهُمَا",
            "id": "Telah mengabarkan kepada kami [Abdullah bin Umar bin Aban] telah menceritakan kepada kami [Abdurrahim bin Sulaiman] dari [Muhammad bin Ishaq] dari [Yazid bin Abu Habib] dari [Bukair bin Abdullah bin Al Asyaj] dari [Abu Ishaq Ad Dausi] dari [Abu Hurairah Ad Dausi] ia berkata; Rasulullah shallallahu 'alaihi wasallam pernah mengutus kami dalam suatu ekspedisi, beliau bersabda: \"Apabila kalian menangkap Fulan dan Fulan, maka bakarlah mereka berdua dengan api.\" Keesokan harinya beliau mengutus kami dan bersabda: \"Sesungguhnya aku pernah memerintahkan kalian untuk membunuh dua orang ini, kemudian aku melihat bahwa hal itu tidak layak bagi seorangpun untuk menyiksa dengan api, kecuali Allah, oleh karena itu jika kalian menangkap mereka berdua, maka bunuhlah.\""
        },
        {
            "number": 2353,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ عَنْ عَلِيِّ بْنِ مُسْهِرٍ عَنْ عُبَيْدِ اللَّهِ هُوَ ابْنُ عُمَرَ بْنِ حَفْصِ بْنِ عَاصِمٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ وُجِدَ فِي بَعْضِ مَغَازِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ امْرَأَةٌ مَقْتُولَةٌ فَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ قَتْلِ النِّسَاءِ وَالصِّبْيَانِ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin 'Uyainah] dari [Ali bin Mushir] dari ['Ubaidullah yaitu Ibnu Umar bin Hafsh in 'Ashim] dari [Nafi'] dari [Ibnu Umar] ia berkata; \"Didapati seorang wanita yang terbunuh disebagian peperangan Rasulullah shallallahu 'alaihi wasallam. Setelah itu Rasulullah shallallahu 'alaihi wasallam melarang membunuh para wanita dan anak-anak.\""
        },
        {
            "number": 2354,
            "arab": " أَخْبَرَنَا عَاصِمُ بْنُ يُوسُفَ حَدَّثَنَا أَبُو إِسْحَقَ الْفَزَارِيُّ عَنْ يُونُسَ بْنِ عُبَيْدٍ عَنْ الْحَسَنِ عَنْ الْأَسْوَدِ بْنِ سَرِيعٍ قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزَاةٍ فَظَفِرَ بِالْمُشْرِكِينَ فَأَسْرَعَ النَّاسُ فِي الْقَتْلِ حَتَّى قَتَلُوا الذُّرِّيَّةَ فَبَلَغَ ذَلِكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَا بَالُ أَقْوَامٍ ذَهَبَ بِهُمْ الْقَتْلُ حَتَّى قَتَلُوا الذُّرِّيَّةَ أَلَا لَا تُقْتَلَنَّ ذُرِّيَّةٌ ثَلَاثًا",
            "id": "Telah mengabarkan kepada kami ['Ashim bin Yusuf] telah menceritakan kepada kami [Abu Ishaq Al Fazari] dari [Yunus bin 'Ubaid] dari [Al Hasan] dari [Al Aswad bin Sari'] ia berkata; \"Kami keluar bersama Rasulullah shallallahu 'alaihi wasallam dalam suatu pertempuran, kemudian kami berhasil menangkap orang-orang musyrik. orang-orangpun bersegera membunuh mereka hingga anak keturunan mereka. Ketika hal itu sampai kepada Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Bagaimana manusia berlaku semena-mena dalam membunuh, hingga mereka membunuh anak-anak, ketahuilah tidak boleh anak-anak dibunuh.\" Beliau mengucapkannya hingga tiga kali."
        },
        {
            "number": 2355,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ عَطِيَّةَ الْقُرَظِيِّ قَالَ عُرِضْنَا عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَئِذٍ فَمَنْ أَنْبَتَ الشَّعْرَ قُتِلَ وَمَنْ لَمْ يُنْبِتْ تُرِكَ فَكُنْتُ أَنَا مِمَّنْ لَمْ يُنْبِتْ الشَّعْرَ فَلَمْ يَقْتُلُونِي يَعْنِي يَوْمَ قُرَيْظَةَ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Sufyan] dari [Abdul Malik bin 'Umair] dari ['Athiyyah Al Qurazhi] ia berkata; \"Ketika kami pernah dihadapkan kepada Nabi shallallahu 'alaihi wasallam, maka orang-orang yang telah tumbuh rambut kemaluannya dibunuh, sementara orang-orang yang belum tumbuh dibiarkan, dan aku termasuk dari orang yang belum tumbuh rambut kemaluanku, hingga mereka tidak membunuhku, yaitu ketika perang Quraizhah.\""
        },
        {
            "number": 2356,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ عَنْ أَبِي وَائِلٍ عَنْ أَبِي مُوسَى عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فُكُّوا الْعَانِيَ وَأَطْعِمُوا الْجَائِعَ",
            "id": "Telah `mengabarkan kepada kami [Muhammad bin Yusuf] dari [Sufyan] dari [Manshur] dari [Abu Wa`il] dari [Abu Musa] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Bebaskanlah para tawanan, dan berilah makan orang yang lapar.\""
        },
        {
            "number": 2357,
            "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمُهَلَّبِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَادَى رَجُلًا بِرَجُلَيْنِ",
            "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Abu Qilabah] dari [Abu Al Muhallab] dari ['Imran bin Hushain] bahwa Rasulullah shallallahu 'alaihi wasallam pernah menebus satu orang dengan dua orang."
        },
        {
            "number": 2358,
            "arab": " أَخْبَرَنَا يَحْيَى بْنُ حَمَّادٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ سُلَيْمَانَ عَنْ مُجَاهِدٍ عَنْ عُبَيْدِ بْنِ عُمَيْرٍ عَنْ أَبِي ذَرٍّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أُعْطِيتُ خَمْسًا لَمْ يُعْطَهُنَّ نَبِيٌّ قَبْلِي بُعِثْتُ إِلَى الْأَحْمَرِ وَالْأَسْوَدِ وَجُعِلَتْ لِيَ الْأَرْضُ مَسْجِدًا وَطَهُورًا وَأُحِلَّتْ لِيَ الْغَنَائِمُ وَلَمْ تَحِلَّ لِأَحَدٍ قَبْلِي وَنُصِرْتُ بِالرُّعْبِ شَهْرًا يُرْعَبُ مِنِّي الْعَدُوُّ مَسِيرَةَ شَهْرٍ وَقِيلَ لِي سَلْ تُعْطَهْ فَاخْتَبَأْتُ دَعْوَتِي شَفَاعَةً لِأُمَّتِي وَهِيَ نَائِلَةٌ مِنْكُمْ إِنْ شَاءَ اللَّهُ تَعَالَى مَنْ لَمْ يُشْرِكْ بِاللَّهِ شَيْئًا",
            "id": "Telah mengabarkan kepada kami [Yahya bin Hammad] telah menceritakan kepada kami [Abu 'Awanah] dari [Sulaiman] dari [Mujahid] dari ['Ubaid bin 'Umair] dari [Abu Dzar] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Aku diberi lima hal yang tidak diberikan kepada seorang nabipun sebelumku. Aku diutus kepada manusia dan jin, dan dijadikan bagiku tanah sebagai masjid serta pensuci, dihalalkan rampasan perang yang tidak dihalalkan bagi seorangpun sebelumku, dan aku diberi kemenangan dengan rasa takut musuh sejauh perjalanan satu bulan. Dikatakan kepadaku; mintalah maka engkau akan diberi. Kemudian aku menyimpan permohonanku sebagai syafa'at bagi umatku, dan syafa'at tersebut akan didapatkan insya Allah Ta'ala bagi orang yang tidak mensekutukan Allah dengan sesuatupun.\""
        },
        {
            "number": 2359,
            "arab": " حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عَاصِمٍ عَنْ أَبِي وَائِلٍ قَالَ قَسَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَنَائِمَ حُنَيْنٍ بِالْجِعْرَانَةِ قَالَ عَبْد اللَّهِ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ فِي الْإِسْنَادِ",
            "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Zaid] dari ['Ashim] dari [Abu Wa'il] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam membagi-bagikan harta rampasan perang Hunain di Ja'ranah.\" Hammad berkata; (nama) Abdullah yang tercantum dalam sanad tersebut adalah Abdullah bin Mas'ud."
        },
        {
            "number": 2360,
            "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الرَّقِّيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو عَنْ زَيْدٍ عَنْ الْحَكَمِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ أَبِيهِ قَالَ شَهِدْتُ فَتْحَ خَيْبَرَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَانْهَزَمَ الْمُشْرِكُونَ فَوَقَعْنَا فِي رِحَالِهِمْ فَابْتَدَرَ النَّاسُ مَا وَجَدُوا مِنْ جَزُورٍ قَالَ فَلَمْ يَكُنْ ذَلِكَ بِأَسْرَعَ مِنْ أَنْ فَارَتْ الْقُدُورُ فَأَمَرَ بِهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأُكْفِئَتْ قَالَ ثُمَّ قَسَمَ بَيْنَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَعَلَ لِكُلِّ عَشْرَةٍ شَاةً قَالَ وَكَانَ بَنُو فُلَانٍ مَعَهُ تِسْعَةً وَكُنْتُ وَحْدِي فَالْتَفَتُّ إِلَيْهِمْ فَكُنَّا عَشْرَةً بَيْنَنَا شَاةٌ قَالَ عَبْد اللَّهِ بَلَغَنِي أَنَّ صَاحِبَكُمْ يَقُولُ عَنْ قَيْسِ بْنِ مُسْلِمٍ كَأَنَّهُ يَقُولُ إِنَّهُ لَمْ يَحْفَظْهُ أَخْبَرَنَا زَكَرِيَّا بْنُ عَدِيٍّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَمْرٍو عَنْ زَيْدٍ هُوَ ابْنُ أَبِي أُنَيْسَةَ عَنْ قَيْسِ بْنِ مُسْلِمٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ قَالَ فَأُلِّفْتُ إِلَيْهِمْ قَالَ أَبُو مُحَمَّد الصَّوَابُ عِنْدِي مَا قَالَ زَكَرِيَّا فِي الْإِسْنَادِ",
            "id": "Telah mengabarkan kepada kami [Abdullah bin Ja'far Ar Raqqi] telah menceritakan kepada kami ['Ubaidullah bin 'Amr] dari [Zaid] dari [Al Hakam dari [Abdurrahman bin Abu Laila] dari [ayahnya] ia berkata; \"Aku pernah ikut serta dalam penaklukan Khaibar bersama Rasulullah shallallahu 'alaihi wasallam. Ketika kaum Musyrikin mengalami kekalahan dan terpukul mundur, kami bermukim di tempat tinggal mereka, lantas orang-orang bersegera mengambil binatang ternak yang mereka dapatkan. Hal itu tidaklah lebih cepat daripada mendidihnya kuali yang diletakkan (diatas tungku api). Kemudian Rasulullah shallallahu 'alaihi wasallam memerintahkan agar kuali tersebut ditumpahkan. Setelah itu beliau membagi-bagikan (harta rampasan) diantara mereka, beliau membagi untuk sepuluh orang satu kambing.\" Abu Laila berkata; \"Bani Fulan baru berjumlah sembilan orang, sementara aku sendirian, maka aku ikut bergabung dengan mereka, hingga kami berjumlah sepuluh, lantas seekor kambing dibagi diantara kami.\" Abdullah berkata; telah sampai kepadaku bahwa sahabat kalian berkata dari Qais bin Muslim, seolah-olah ia berkata; sesungguhnya ia tidak menghafal hadits tersebut.\" Telah mengabarkan kepada kami [Zakariya bin 'Adi] dari ['Ubaidullah bin 'Amr] dari [Zaid yaitu Ibnu Abu Unaisah] dari [Qais bin Muslim] dari [Abdurrahman bin Abu Laila] dari [Ayahnya] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas. Perawi berkata; dan aku menjelaskan redaksi periwayatan jalur lain sebagai pembanding redaksi aslinya. Abu Muhammad berkata; yang benar menurutku adalah apa yang dikatakan Zakariya dalam sanadnya."
        },
        {
            "number": 2361,
            "arab": " أَخْبَرَنَا أَبُو النُّعْمَانِ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ حَدَّثَنِي قَيْسُ بْنُ سَعْدٍ عَنْ يَزِيدَ بْنِ هُرْمُزَ قَالَ كَتَبَ نَجْدَةُ بَنُ عَامِرٍ إِلَى ابْنِ عَبَّاسٍ يَسْأَلُهُ عَنْ أَشْيَاءَ فَكَتَبَ إِلَيْهِ إِنَّكَ سَأَلْتَ عَنْ سَهْمِ ذِي الْقُرْبَى الَّذِي ذَكَرَ اللَّهُ وَإِنَّا كُنَّا نَرَى أَنَّ قَرَابَةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هُمْ فَأَبَى ذَلِكَ عَلَيْنَا قَوْمُنَ",
            "id": "Telah mengabarkan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Jarir bin Hazim] telah menceritakan kepadaku [Qais bin Sa'd] dari [Yazid bin Hurmuz] ia berkata; Najdah bin 'Amir telah menulis surat kepada [Ibnu Abbas], ia bertanya mengenai beberapa hal, Ibnu Abbaspun membalas suratnya; \"Sesungguhnya engkau bertanya mengenai bagian kerabat yang telah Allah sebutkan, sesungguhnya kami melihat bahwa kerabat Rasulullah shallallahu 'alaihi wasallam termasuk dari mereka, namun kaum kami menolak hal itu.\""
        },
        {
            "number": 2362,
            "arab": " أَخْبَرَنَا إِسْحَقُ بْنُ عِيسَى حَدَّثَنَا مُحَمَّدُ بْنُ خَازِمٍ أَبُو مُعَاوِيَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْهَمَ يَوْمَ خَيْبَرَ لِلْفَارِسِ ثَلَاثَةَ أَسْهُمٍ وَلِلرَّاجِلِ سَهْمًا حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ نَحْوَهُ",
            "id": "Telah mengabarkan kepada kami [Ishaq bin Isa] telah menceritakan kepada kami [Muhammad bin Hazim Abu Mu'awiyah] dari ['Ubaidullah bin Umar] dari [Nafi'] dari [Ibnu Umar] bahwa pada waktu (penaklukan) Khaibar, Rasulullah shallallahu 'alaihi wasallam membagikan (harta rampasan) kepada para sahabatnya, untuk yang berkuda tiga bagian, dan untuk yang pejalan kaki satu bagian.\" Telah menceritakan kepada kami [Muhammad bin Yusuf] dari [Sufyan] dari ['Ubaidullah] dari [Nafi'] dari [Ibnu Umar] seperti hadits di atas."
        },
        {
            "number": 2363,
            "arab": " أَخْبَرَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ عَلِيِّ بْنِ زَيْدٍ عَنْ عَمَّارِ بْنِ أَبِي عَمَّارٍ عَنْ أَبِي هُرَيْرَةَ قَالَ مَا شَهِدْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَغْنَمًا إِلَّا قَسَمَ لِي إِلَّا يَوْمَ خَيْبَرَ فَإِنَّهَا كَانَتْ لِأَهْلِ الْحُدَيْبِيَةِ خَاصَّةً وَكَانَ أَبُو مُوسَى وَأَبُو هُرَيْرَةَ جَاءَا بَيْنَ الْحُدَيْبِيَةِ وَخَيْبَرَ",
            "id": "Telah mengabarkan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Hammad bin Salamah] dari [Ali bin Zaid] dari ['Ammar bin Abu 'Ammar] dari [Abu Hurairah], ia berkata; \"Tidaklah aku ikut serta bersama Rasulullah shallallahu 'alaihi wasallam waktu membagikan rampasan perang, malainkan beliau membagiku, kecuali pada saat perang Khaibar, sebab ia khusus untuk orang-oarng yang ikut dalam perjanjian Hudaibiyah.\" Sementara Abu Musa dan Abu Hurairah datang (masuk Islam -pent) antara Hudaibiyah dan Khaibar.\""
        },
        {
            "number": 2364,
            "arab": " أَخْبَرَنَا إِسْمَعِيلُ بْنُ خَلِيلٍ أَخْبَرَنَا حَفْصٌ حَدَّثَنَا مُحَمَّدُ بْنُ زَيْدٍ عَنْ عُمَيْرٍ مَوْلَى آبِي اللَّحْمِ قَالَ شَهِدْتُ خَيْبَرَ وَأَنَا عَبْدٌ مَمْلُوكٌ فَأَعْطَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ خُرْثِيِّ الْمَتَاعِ وَأَعْطَانِي سَيْفًا فَقَالَ تَقَلَّدْ بِهَذَا",
            "id": "Telah mengabarkan kepada kami [Isma'il bin Khalil] telah mengabarkan kepada kami [Hafsh] telah menceritakan kepada kami [Muhammad bin Zaid] dari ['Umair] mantan budak Abu Al Lahm, ia berkata; aku ikut dalam perang Khaibar, sementara aku adalah seorang budak, kemudian Rasulullah shallallahu 'alaihi wasallam memberiku perkakas rumah tangga dan beliau juga memberiku sebilah pedang, beliau bersabda: \"(Belajar) berperanglah dengan pedang ini.\""
        },
        {
            "number": 2365,
            "arab": " أَخْبَرَنَا أَحْمَدُ بْنُ حُمْيَدٍ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ بْنِ جَابِرٍ عَنْ الْقَاسِمِ وَمَكْحُولٍ عَنْ أَبِي أُمَامَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى أَنْ تُبَاعَ السِّهَامُ حَتَّى تُقْسَمَ",
            "id": "Telah mengabarkan kepada kami [Ahmad bin Humaid] telah menceritakan kepada kami [Abu Usamah] dari [Abdurrahman bin Yazid bin Jabir] dari [Al Qasim] dan [Makhul] dari [Abu Umamah] dari Nabi shallallahu 'alaihi wasallam bahwa beliau melarang menjual bagian (ghanimah) kecuali setelah dibagikan."
        },
        {
            "number": 2366,
            "arab": " أَخْبَرَنَا أَحْمَدُ بْنُ خَالِدٍ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ أَبِي مَرْزُوقٍ مَوْلًى لِتُجِيبَ قَالَ حَدَّثَنِي حَنَشٌ الصَّنْعَانِيُّ قَالَ غَزَوْنَا الْمَغْرِبَ وَعَلَيْنَا رُوَيْفِعُ بْنُ ثَابِتٍ الْأَنْصَارِيُّ فَافْتَتَحْنَا قَرْيَةً يُقَالُ لَهَا جَرْبَةُ فَقَامَ فِينَا رُوَيْفِعُ بْنُ ثَابِتٍ الْأَنْصَارِيُّ خَطِيبًا فَقَالَ إِنِّي لَا أَقُومُ فِيكُمْ إِلَّا مَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ فِينَا يَوْمَ خَيْبَرَ حِينَ افْتَتَحْنَاهَا فَقَالَ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلَا يَأْتِيَنَّ شَيْئًا مِنْ السَّبْيِ حَتَّى يَسْتَبْرِئَهَا",
            "id": "Telah mengabarkkan kepada kami [Ahmad bin Khalid] telah menceritakan kepada kami [Muhammad bin Ishaq] dari [Yazid bin Abu Habib] dari [Abu Marzuq] mantan budak Tujib, ia berkata; telah menceritakan kepada kami [Hanasy Ash Shan'ani] ia berkata; \"Kami pernah melakukan penyerangan di daerah Maghrib, dan pemimpin kami waktu itu adalah [Ruwaifi' bin Tsabit Al Anshari], setelah kami berhasil menaklukkan suatu perkampungan yang disebut Jarbah, Ruwaifi' berdiri di hadapan kami sambil berkhutbah. Ia berkata; \"Sesungguhnya aku berdiri dihadapan kalian tidak lain karena sesuatu yang telah aku dengar dari Rasulullah shallallahu 'alaihi wasallam. Beliau berdiri di hadapan kami ketika kami selesai menaklukkan Khaibar, beliau bersabda: \"Barangsiapa beriman kepada Allah dan hari Akhir, janganlah ia mendatangi tawanan wanita hingga ia mengalami haid.\""
        },
        {
            "number": 2367,
            "arab": " أَخْبَرَنَا أَسَدُ بْنُ مُوسَى حَدَّثَنَا شُعْبَةُ عَنْ يَزِيدَ بْنِ خُمَيْرٍ أَبِي عُمَرَ الشَّامِيِّ الْهَمْدَانِيِّ قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ أَبِيهِ عَنْ أَبِي الدَّرْدَاءِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى امْرَأَةً مُجِحَّةً يَعْنِي حُبْلَى عَلَى بَابِ فُسْطَاطٍ فَقَالَ لَعَلَّهُ قَدْ أَلَمَّ بِهَا قَالُوا نَعَمْ قَالَ لَقَدْ هَمَمْتُ أَنْ أَلْعَنَهُ لَعْنَةً تَدْخُلُ مَعَهُ قَبْرَهُ كَيْفَ يُوَرِّثُهُ وَهُوَ لَا يَحِلُّ لَهُ وَكَيْفَ يَسْتَخْدِمُهُ وَهُوَ لَا يَحِلُّ لَهُ",
            "id": "Telah mengabarkan kepada kami [Asad bin Musa] telah menceritakan kepada kami [Syu'bah] dari [Yazid bin Humair Abu Umar Asy Syami Al Hamdani], ia berkata; aku mendengar [Abdurrahman bin Jubair bin Nufair] dari [Ayahnya] dari [Abu Ad Darda`] bahwa Nabi shallallahu 'alaihi wasallam pernah melihat seorang wanita hamil berada di depan pintu tenda besar. Kemudian beliau bersabda: \"Kemungkinan (tuannya) telah menggauli wanita tersebut.\" Para sahabat berkata; \"Ya.\" Beliau bersabda: \"Sungguh aku ingin melaknat laki-laki itu dengan laknat yang masuk bersamanya dalam kuburnya, bagaimana mungkin ia menjadikan anak yang ada dalam kandungan tersebut sebagai pewarisnya, sementara hal itu tidak halal baginya, dan bagaimana ia mempergunakannya sebagai budak, sementara hal itu tidak halal baginya?\""
        },
        {
            "number": 2368,
            "arab": " أَخْبَرَنَا الْقَاسِمُ بْنُ كَثِيرٍ عَنْ اللَّيْثِ بْنِ سَعْدٍ قِرَاءَةً عَنْ عَبْدِ اللَّهِ بْنِ جُنَادَةَ عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِىِّ أَنَّ أَبَا أَيُّوبَ كَانَ فِي جَيْشٍ فَفُرِّقَ بَيْنَ الصِّبْيَانِ وَبَيْنَ أُمَّهَاتِهِمْ فَرَآهُمْ يَبْكُونَ فَجَعَلَ يَرُدُّ الصَّبِيَّ إِلَى أُمِّهِ وَيَقُولُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ فَرَّقَ بَيْنَ الْوَالِدَةِ وَوَلَدِهَا فَرَّقَ اللَّهُ بَيْنَهُ وَبَيْنَ الْأَحِبَّاءِ يَوْمَ الْقِيَامَةِ",
            "id": "Telah mengabarkan kepada kami [Al Qasim bin Katsir] dari [Al Laits bin Sa'd] dengan membacakan riwayat, dari [Abdullah bin Junadah] dari [Abu Abdurrahman Al Hubuli] bahwa [Abu Ayyub] berada dalam pasukan, ternyata diantara anak-anak dipisahkan dengan ibu mereka. Ketika Abu Ayyub melihat mereka menangis, ia langsung mengembalikan anak tersebut kepada ibunya sambil berkata; \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa memisahkan antara seorang ibu dan anaknya, maka Allah akan memisahkan antara dirinya dengan orang-orang yang dicintainya pada Hari Kiamat.\""
        },
        {
            "number": 2369,
            "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا أَبَانُ بْنُ عَبْدِ اللَّهِ الْبَجَلِيُّ عَنْ عُثْمَانَ بْنِ أَبِي حَازِمٍ عَنْ صَخْرِ بْنِ الْعَيْلَةِ قَالَ أَبُو مُحَمَّد وَمِنْهُمْ مَنْ يَقُولُ الْعِيلَةِ قَالَ أَخَذْتُ عَمَّةَ الْمُغِيرَةِ بْنِ شُعْبَةَ فَقَدِمْتُ بِهَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَمَّتَهُ فَقَالَ يَا صَخْرُ إِنَّ الْقَوْمَ إِذَا أَسْلَمُوا أَحْرَزُوا أَمْوَالَهُمْ وَدِمَاءَهُمْ فَادْفَعْهَا إِلَيْهِ وَكَانَ مَاءٌ لِبَنِي سُلَيْمٍ فَأَسْلَمُوا فَأَتَوْهُ فَسَأَلُوهُ ذَلِكَ فَدَعَانِي فَقَالَ يَا صَخْرُ إِنَّ الْقَوْمَ إِذَا أَسْلَمُوا أَحْرَزُوا أَمْوَالَهُمْ وَدِمَاءَهُمْ فَادْفَعْهُ إِلَيْهِمْ فَدَفَعْتُهُ",
            "id": "Telah mengabarkan kepada [Abu Nu'aim] telah menceritakan kepada kami [Aban bin Abdullah Al Bajali] dari [Utsman bin Abu Hazim] dari [Shakhr bin Al 'Ailah], -Abu Muhammad berkata; Diantara mereka (hali hadits) ada yang mengatakan; Al 'Ilah- Ia berkata; \"Aku membawa bibi Al Mughirah bin Syu'bah mengahdap Rasulullah shallallahu 'alaihi wasallam, setelah itu Nabi shallallahu 'alaihi wasallam bertanya kepada bibinya, lalu beliau bersabda: \"Wahai Shakhr, sesungguhnya apabila suatu kaum telah masuk Islam, maka harta dan darah mereka telah terjaga, oleh karena itu serahkanlah ia kepada Mughirah.\" Dahulu Bani Sulaim memiliki mata air, kemudian mereka masuk Islam dan memintanya kembali kepada beliau. Beliau pun bersabda: \"Wahai Shakhr, sesungguhnya jika suatu kaum telah masuk Islam, maka harta dan darah mereka telah terjaga, oleh karena itu serahkanlah (mata air tyersebut) kepada mereka.\""
        },
        {
            "number": 2370,
            "arab": " أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ نَافِعٍ عَنْ ابِنِ عُمَرَ قَالَ بَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَرِيَّةً فِيهَا ابْنُ عُمَرَ فَغَنِمُوا إِبِلًا كَثِيرَةً فَكَانَتْ سِهَامُهُمْ اثْنَيْ عَشَرَ بَعِيرًا أَوْ أَحَدَ عَشَرَ بَعِيرًا وَنُفِّلُوا بَعِيرًا بَعِيرًا",
            "id": "Telah mengabarkan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Nafi'] dari [Ibnu Umar], ia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah mengutus satuan pasukan, dalam pasukan tersebut terdapat Ibnu Umar, kemudian mereka memperoleh harta rampasan berupa beberapa ekor unta. Maka setiap pasukan memperoleh bagian dua belas unta atau sebelas unta, ditambah lagi satu unta, satu unta.\""
        },
        {
            "number": 2371,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ حَدَّثَنَا أَبُو إِسْحَقَ الْفَزَارِيُّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَيَّاشٍ عَنْ سُلَيْمَانَ بْنِ مُوسَى عَنْ أَبِي سَلَّامٍ عَنْ أَبِي أُمَامَةَ الْبَاهِلِيِّ عَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَغَارَ فِي أَرْضِ الْعَدُوِّ نَفَّلَ الرُّبُعَ وَإِذَا أَقْبَلَ رَاجِعًا وَكَلَّ النَّاسُ نَفَّلَ الثُّلُثَ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin 'Uyainah] telah menceritakan kepada kami [Abu Ishaq Al Fazari] dari [Abdurrahman bin 'Ayyasy] dari [Sulaiman bin Musa] dari [Abu Sallam] dari [Abu Umamah Al Bahili] dari ['Ubadah bin Ash Shamit] ia berkata; \"Apabila Rasulullah shallallahu 'alaihi wasallam menyerang di negeri musuh, maka beliau akan memberikan tambahan (ghanimah) seperempat bagian, apabila kembali, beliau memberikan tambahan (ghanimah) kepada setiap pasukan sepertiga bagian.\""
        },
        {
            "number": 2372,
            "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ عَنْ سُفْيَانَ عَنْ يَزِيدَ بْنِ يَزِيدَ بْنِ جَابِرٍ عَنْ مَكْحُولٍ عَنْ زِيَادِ بْنِ جَارِيَةَ عَنْ حَبِيبِ بْنِ مَسْلَمَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَفَّلَ الثُّلُثَ بَعْدَ الْخُمُسِ",
            "id": "Telah mengabarkan kepada kami [Abu 'Ashim] dari [Sufyan] dari [Yazid bin Jabir] dari [Makhul] dari [Ziyad bin Jariyah] dari [Habib bin Maslamah] bahwa Nabi shallallahu 'alaihi wasallam memberikan tambahan (ghanimah) sepertiga bagian (kepada setiap pasukan) setelah bagian seperlima dibagikan."
        },
        {
            "number": 2373,
            "arab": " أَخْبَرَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ حَدَّثَنَا إِسْحَقُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَتَلَ كَافِرًا فَلَهُ سَلَبُهُ فَقَتَلَ أَبُو طَلْحَةَ يَوْمَئِذٍ عِشْرِينَ وَأَخَذَ أَسْلَابَهُمْ",
            "id": "Telah mengabarkan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Hammad bin Salamah] telah menceritakan kepada kami [Ishaq bin Abdullah bin Abu Thalhah] dari [Anas bin Malik] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membunuh orang kafir, maka baginya (boleh mengambil) apa yang melekat pada orang tersebut.\" Pada saat itu Abu Thalhah sempat membunuh dua puluh orang, lalu ia mengambil barang yang melekat pada dua orang tersebut."
        },
        {
            "number": 2374,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ ابْنِ كَثِيرِ بْنِ أَفْلَحَ هُوَ عُمَرُ بْنُ كَثِيرٍ عَنْ أَبِي مُحَمَّدٍ مَوْلَى أَبِي قَتَادَةَ عَنْ أَبِي قَتَادَةَ قَالَ بَارَزْتُ رَجُلًا فَقَتَلْتُهُ فَنَفَّلَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَلَبَهُ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Sufyan bin 'Uyainah] dari [Yahya bin Sa'id] dari [Ibnu Katsir bin Aflah yaitu 'Umar bin Katsir] dari [Abu Muhammad] mantan budak Abu Qatadah, dari [Abu Qatadah] ia berkata; \"Aku pernah perang tanding dengan seorang laki-laki, lalu aku berhasil membunuhnya. Kemudian Rasulullah shallallahu 'alaihi wasallam memberikan barang yang melekat pada orang tersebut kepadaku.\""
        },
        {
            "number": 2375,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ حَدَّثَنَا أَبُو إِسْحَقَ الْفَزَارِيُّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَيَّاشٍ عَنْ سُلَيْمَانَ بْنِ مُوسَى عَنْ أَبِي سَلَّامٍ عَنْ أَبِي أُمَامَةَ الْبَاهِلِيِّ عَنْ عُبَادَةَ بْنِ الصَّامِتِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَكْرَهُ الْأَنْفَالَ وَيَقُولُ لِيَرُدَّ قَوِيُّ الْمُسْلِمِينَ عَلَى ضَعِيفِهِمْ",
            "id": "Telah menceritakan kepada kami [Muhammad bin 'Uyainah] telah menceritakan kepada kami [Abu Ishaq Al Fazari] dari [Abdurrahman bin 'Ayyasy] dari [Sulaiman bin Musa] dari [Abu Sallam] dari [Abu Umamah Al Bahili] dari ['Ubadah bin Ash Shamit] bahwa Nabi shallallahu 'alaihi wasallam tidak menyukai nafal dan beliau bersabda: \"Hendaknya orang yang kuat memberikan kepada orang yang lemah dari kaum Muslimin.\" "
        },
        {
            "number": 2376,
            "arab": " وَبِهَذَا الْإِسْنَادِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ أَدُّوا الْخِيَاطَ وَالْمَخِيطَ وَإِيَّاكُمْ وَالْغُلُولَ فَإِنَّهُ عَارٌ عَلَى أَهْلِهِ يَوْمَ الْقِيَامَةِ",
            "id": "Dan dengan sanad ini, bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Serahkanlah (walau hanya) benang dan jarum, dan berhati-hatilah kalian dengan ghulul, karena hal itu merupakan aib atas pelakunya pada Hari Kiamat.\" "
        },
        {
            "number": 2377,
            "arab": " أَخْبَرَنَا أَحْمَدُ بْنُ خَالِدٍ حَدَّثَنَا مُحَمَّدٌ هُوَ ابْنُ إِسْحَقَ عَنْ يَزِيدَ هُوَ ابْنُ أَبِي حَبِيبٍ عَنْ أَبِي مَرْزُوقٍ مَوْلًى لِتُجِيبَ قَالَ حَدَّثَنِي حَنَشٌ الصَّنْعَانِيُّ قَالَ غَزَوْنَا الْمَغْرِبَ وَعَلَيْنَا رُوَيْفِعُ بْنُ ثَابِتٍ الْأَنْصَارِيُّ فَافْتَتَحْنَا قَرْيَةً يُقَالُ لَهَا جَرْبَةُ فَقَامَ فِينَا رُوَيْفِعُ بْنُ ثَابِتٍ الْأَنْصَارِيُّ خَطِيبًا فَقَالَ إِنِّي لَا أَقُومُ فِيكُمْ إِلَّا مَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ فِينَا يَوْمَ خَيْبَرَ حِينَ افْتَتَحْنَاهَا مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلَا يَرْكَبَنَّ دَابَّةً مِنْ فَيْءِ الْمُسْلِمِينَ حَتَّى إِذَا أَجْحَفَهَا أَوْ قَالَ أَعْجَفَهَا قَالَ أَبُو مُحَمَّد أَنَا أَشُكُّ فِيهِ رَدَّهَا وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلَا يَلْبَسْ ثَوْبًا مِنْ فَيْءِ الْمُسْلِمِينَ حَتَّى إِذَا أَخْلَقَهُ رَدَّهُ فِيهِ",
            "id": "Telah mengabarkkan kepada kami [Ahmad bin Khalid] telah menceritakan kepada kami [Muhammad bin Ishaq] dari [Yazid bin Abu Habib] dari [Abu Marzuq] mantan budak Tujib, ia berkata; telah menceritakan kepada kami [Hanasy Ash Shan'ani], ia berkata; \"Kami pernah melakukan penyerangan di daerah Maghrib, ketika itu pemimpin kami adalah [Ruwaifi' bin Tsabit Al Anshari], kemudian kami berhasil menaklukkan suatu perkampungan yang bernama Jarbah, lalu Ruwaifi' bin Tsabit Al Anshari berdiri dihadapan kami sambil berkhutbah. Ia berkata; \"Sesungguhnya aku berdiri diantara kalian tidak lain karena sesuatu yang pernah aku dengar dari Rasulullah shallallahu 'alaihi wasallam. Ketika negeri Khaibar berhasil kami taklukkan, beliau berdiri dihadapan kami, beliau bersabda: \"Barangsiapa beriman kepada Allah dan hari Akhir, janganlah ia menunggangi kendaraan dari harta rampasan perang kaum Muslimin, setelah ia membuatnya tidak berdaya atau membuatnya lemah…-Abu Muhammad berkata; aku tidak ragu beliau mengatakan- lalu ia mengembalikannya ke dalam rampasan perang. Dan barangsiapa beriman keapda Allah dan hari Akhir, janganlah ia memakai pakaian dari harta rampasan perang kaum Muslimin, setelah pakaian itu usang, ia mengembalikannya ke dalam rampasan perang.\""
        },
        {
            "number": 2378,
            "arab": " حَدَّثَنَا أَبُو الْوَلِيدِ حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ حَدَّثَنِي أَبُو زُمَيْلٍ حَدَّثَنِي ابْنُ عَبَّاسٍ حَدَّثَنِي عُمَرُ بْنُ الْخَطَّابِ قَالَ قُتِلَ نَفَرٌ يَوْمَ خَيْبَرَ فَقَالُوا فُلَانٌ شَهِيدٌ حَتَّى ذَكَرُوا رَجُلًا فَقَالُوا فُلَانٌ شَهِيدٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَلَّا إِنِّي رَأَيْتُهُ فِي النَّارِ فِي عَبَاءَةٍ أَوْ فِي بُرْدَةٍ غَلَّهَا قَالَ لِي يَا ابْنَ الْخَطَّابِ قُمْ فَنَادِ فِي النَّاسِ أَنَّهُ لَا يَدْخُلُ الْجَنَّةَ إِلَّا الْمُؤْمِنُونَ فَقُمْتُ فَنَادَيْتُ فِي النَّاسِ",
            "id": "Telah menceritakan kepada kami [Abu Al Walid] telah menceritakan kepada kami ['Ikrimah bin 'Ammar] telah menceritakan kepadaku [Abu Zumail] telah menceritakan kepadaku [Ibnu Abbas] telah menceritakan kepadaku [Umar bin Al Khathab], ia berkata; \"Beberapa orang terbunuh pada saat terjadi perang Khaibar. Kemudian orang-orang mengatakan; \"Fulan syahid...\" hinggga ketika mereka sampai kepada seseorang, mereka berkata; \"Fulan telah syahid, \" mendengar itu, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak, sungguh aku telah melihatnya di Neraka sambil memakai 'mantel dan burdah yang ia curi dari rampasan perang.\" Beliau mengatakan kepadaku: \"Wahai Ibnu Al Khathab, berdiri dan umumkanlah kepada manusia, bahwa tidak masuk Surga kecuali orang-orang yang beriman.\" Kemudian aku mengumumkannya dihadapan orang-orang.\""
        },
        {
            "number": 2379,
            "arab": " حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ مُحَمَّدٍ عَنْ صَالِحِ بْنِ مُحَمَّدِ بْنِ زَائِدَةَ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ وَجَدْتُمُوهُ غَلَّ فَاضْرِبُوهُ وَأَحْرِقُوا مَتَاعَهُ",
            "id": "Telah menceritakan kepada kami [Sa'id bin Manshur] dari [Abdul 'Aziz bin Muhammad] dari [Shalih bin Muhammad bin Zaidah] dari [Salim bin Abdullah] dari [Ayahnya] dari [Kakeknya], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kalian mendapati seseorang melakukan ghulul dalam rampasan perang, maka bunuhlah dia dan bakarlah hartanya.\" "
        },
        {
            "number": 2380,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ الْمُكْتِبُ حَدَّثَنَا الْقَاسِمُ بْنُ مَالِكٍ حَدَّثَنِي كَثِيرُ بْنُ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ عَوْفٍ الْمُزَنِيُّ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَهْبَ وَلَا إِغْلَالَ وَلَا إِسْلَالَ { وَمَنْ يَغْلُلْ يَأْتِ بِمَا غَلَّ يَوْمَ الْقِيَامَةِ } قَالَ أَبُو مُحَمَّد الْإِسْلَالُ السَّرِقَةُ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Hatim Al Muktib] telah menceritakan kepada kami [Al Qasim bin Malik] telah menceritakan kepadaku [Katsir bin Abdullah bin 'Amr bin 'Auf Al Muzani] dari [Ayahnya] dari [kakeknya], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh merampas, tidak boleh ghulul dalam rampasan perang dan tidak boleh mencuri, barang siapa yang berkhianat dalam rampasan perang, maka ia akan datang pada Hari Kiamat membawa apa yang ia curi.\" Abu Muhammad berkata; \"(artinya) Al Islal adalah mencuri.\" "
        },
        {
            "number": 2381,
            "arab": " حَدَّثَنَا بِشْرُ بْنُ عُمَرَ الزَّهْرَانِيُّ حَدَّثَنَا عَبْدُ اللَّهِ هُوَ ابْنُ لَهِيعَةَ حَدَّثَنَا عَيَّاشُ بْنُ عَبَّاسٍ عَنْ شِيَيْمِ بْنِ بَيْتَانَ عَنْ جُنَادَةَ بْنِ أَبِي أُمَيَّةَ قَالَ لَوْلَا أَنِّي سَمِعْتُ ابْنَ أَرْطَاةَ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تُقْطَعُ الْأَيْدِي فِي الْغَزْوِ لَقَطَعْتُهَا",
            "id": "Telah menceritakan kepada kami [Bisyr bin Umar Az Zahrani] telah menceritakan kepadaku [Abdullah yaitu Ibnu Luhai'ah] telah menceritakan kepada kami [Ayyasy bin Abbas] dari [Syiyaim bin Baitan] dari [Junadah bin Abu Umayyah], ia berkata; \"Seandainya aku tidak mendengar [Ibnu Artha`ah] berkata; \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kamu memotong tangan dalam peperangan.\" Niscaya aku telah memotongnya.\""
        },
        {
            "number": 2382,
            "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ نَافِعٍ حَدَّثَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ عَنْ أَبِي حُمَيْدٍ السَّاعِدِيِّ أَنَّهُ أَخْبَرَهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَعْمَلَ عَامِلًا عَلَى الصَّدَقَةِ فَجَاءَهُ الْعَامِلُ حِينَ فَرَغَ مِنْ عَمَلِهِ فَقَالَ يَا رَسُولَ اللَّهِ هَذَا الَّذِي لَكُمْ وَهَذَا أُهْدِيَ لِي فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَهَلَّا قَعَدْتَ فِي بَيْتِ أَبِيكَ وَأَمِّكَ فَنَظَرْتَ أَيُهْدَى لَكَ أَمْ لَا ثُمَّ قَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَشِيَّةً بَعْدَ الصَّلَاةِ عَلَى الْمِنْبَرِ فَتَشَهَّدَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ أَمَّا بَعْدُ فَمَا بَالُ الْعَامِلِ نَسْتَعْمِلُهُ فَيَأْتِينَا فَيَقُولُ هَذَا مِنْ عَمَلِكُمْ وَهَذَا أُهْدِيَ لِي فَهَلَّا قَعَدَ فِي بَيْتِ أَبِيهِ وَأُمِّهِ فَيَنْظُرَ أَيُهْدَى لَهُ أَمْ لَا وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَا يَغُلُّ أَحَدٌ مِنْكُمْ مِنْهَا شَيْئًا إِلَّا جَاءَ بِهِ يَوْمَ الْقِيَامَةِ يَحْمِلُهُ عَلَى عُنُقِهِ إِنْ كَانَ بَعِيرًا جَاءَ بِهِ لَهُ رُغَاءٌ وَإِنْ كَانَتْ بَقَرَةً جَاءَ بِهَا لَهَا خُوَارٌ وَإِنْ كَانَتْ شَاةً جَاءَ بِهَا تَيْعِرُ فَقَدْ بَلَّغْتُ قَالَ أَبُو حُمَيْدٍ ثُمَّ رَفَعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَيْهِ حَتَّى إِنَّا لَنَنْظُرُ إِلَى عُفْرَةِ إِبِطَيْهِ قَالَ أَبُو حُمَيْدٍ وَقَدْ سَمِعَ ذَلِكَ مَعِي مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَيْدُ بْنُ ثَابِتٍ فَسَلُوهُ",
            "id": "Telah mengabarkan kepada kami [Al Hakam bin Nafi'] telah menceritakan kepada kami [Syu'aib] dari [Az Zuhri] telah mengabarkan kepadaku ['Urwah bin Az Zubair] dari [Abu Humaid As Sa'idi] bahwa ia telah mengabarkan kepadanya, bahwa Nabi shallallahu 'alaihi wasallam pernah mengangkat seorang sebagai amil zakat untuk mengambil harta sedekah, ketika amil zakat tersebut selesai mengambil harta sedekah, ia dating kepada beliau seraya berkata; \"Wahai Rasulullah, ini bagian anda dan ini dihadiahkan kepadaku.\" Lalu Nabi shallallahu 'alaihi wasallam bersabda: \"Tidakkah kamu duduk-duduk saja di rumah ayah dan ibumu, kemudian kamu lihat, apakah kamu akan diberi hadiah ataukah tidak?\" Ketika sore hari, yaitu setelah shalat (Ashar) Nabi shallallahu 'alaihi wasallam berdiri di atas mimbar, setelah mengucapkan syahadat dan memuji Allah dengan pujian milikNya, beliau bersabda: \"Bagaimana dengan seorang amil zakat yang kami pekerjakan, kemudian datang kepada kami sambil berkata; \"ini adalah bagian anda dan ini dihadiahkan kepadaku.\" Tidakkah ia duduk-duduk di rumah ayah dan ibunya saja, kemudian melihat apakah ia akan diberi hadiah ataukah tidak? Demi Dzat yang jiwa Muhammad ada di tanganNya, tidaklah seseorang diantara kalian mengambil sesuatupun yang bukan haknya, kecuali pada hari Kiamat ia akan datang dengan memikulnya dilehernya, apabila sesuatu itu adalah unta, maka ia datang memikulnya sambil melenguh, apabila sesuatu itu adalah sapi maka ia memikulnya sambil mengemoh, dan apabila sesuatu itu adalah kambing, maka ia datang memikulnya sambil mengembek, sungguh aku telah menyampaikannya.\" Abu Humaid berkata; \"Setelah itu Rasulullah shallallahu 'alaihi wasallam mengangkat kedua tangannya hingga kami melihat putih ketiaknya. Abu Humaid berkata; \"Dan sungguh Zaid bin Tsabit telah mendengar hal itu bersamaku dari Nabi shallallahu 'alaihi wasallam, (jika tidak percaya) tanyalah kepadanya."
        },
        {
            "number": 2383,
            "arab": " أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا عُمَارَةُ بْنُ زَاذَانَ عَنْ ثَابِتٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ مَلِكَ ذِي يَزَنٍ أَهْدَى إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حُلَّةً أَخَذَهَا بِثَلَاثَةٍ وَثَلَاثِينَ بَعِيرًا أَوْ ثَلَاثٍ وَثَلَاثِينَ نَاقَةً فَقَبِلَهَا",
            "id": "Telah mengabarkan kepada kami ['Amr bin 'Aun] telah mengabarkan kepada kami ['Umarah bin Zadan] dari [Tsabit] dari [Anas bin Malik] bahwa raja Dzi Yazan pernah menghadiahkan perhiasan kepada Nabi shallallahu 'alaihi wasallam dengan di sertai tiga puluh tiga unta jantan atau tiga puluh tiga unta betina, beliaupun menerimanya.\""
        },
        {
            "number": 2384,
            "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ عَنْ عَمْرِو بْنِ يَحْيَى عَنْ عَبَّاسِ بْنِ سَهْلٍ السَّاعِدِيِّ عَنْ أَبِي حُمَيْدٍ السَّاعِدِيِّ قَالَ بَعَثَ صَاحِبُ أَيْلَةَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكِتَابٍ وَأَهْدَى لَهُ بَغْلَةً بَيْضَاءَ فَكَتَبَ إِلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَهْدَى لَهُ بُرْدًا",
            "id": "Telah mengabarkan kepada kami [Abdullah bin Maslamah] telah menceritakan kepada kami [Sulaiman bin Bilal] dari ['Amr bin Yahya] dari [Abbas bin Sahl As Sa'idi] dari [Abu Humaid As Sa'idi] ia berkata; para raja Ailah mengirim utusan kepada Rasulullah shallallahu 'alaihi wasallam dengan membawa sepucuk surat dan menghadiahkan seekor bighal putih kepada beliau. Kemudian Rasulullah shallallahu 'alaihi wasallam menulis surat balasan kepadanya dan menghadiahkan pakaian bergaris-garis kepada raja tersebut."
        },
        {
            "number": 2385,
            "arab": " أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا وَكِيعٌ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ عَبْدِ اللَّهِ بْنِ نِيَارٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّا لَا نَسْتَعِينُ بِمُشْرِكٍ أَخْبَرَنَا إِسْحَقُ عَنْ رَوْحٍ عَنْ مَالِكٍ عَنْ فُضَيْلٍ هُوَ ابْنُ أَبِي عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ نِيَارٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَطْوَلُ مِنْهُ",
            "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] telah menceritakan kepada kami [Waki'] dari [Malik bin Anas] dari [Abdullah bin Niyar] dari ['Urwah] dari ['Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya kami tidak meminta bantuan terhadap orang-orang musyrik.\" Telah mengabarkan kepada kami [Ishaq] dari [Rauh] dari [Malik] dari [Fudhail yaitu Ibnu Abu Abdullah] dari [Abdullah bin Niyar] dari ['Urwah] dari ['Aisyah] yang lebih panjang dari hadits diatas."
        },
        {
            "number": 2386,
            "arab": " أَخْبَرَنَا عَفَّانُ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ حَدَّثَنَا إِبْرَاهِيمُ بْنُ مَيْمُونٍ رَجُلٌ مِنْ أَهْلِ الْكُوفَةِ حَدَّثَنِي سَعْدُ بْنُ سَمُرَةَ بْنِ جُنْدُبٍ عَنْ أَبِيهِ سَمُرَةَ عَنْ أَبِي عُبَيْدَةَ بْنِ الْجَرَّاحِ قَالَ كَانَ فِي آخِرِ مَا تَكَلَّمَ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَخْرِجُوا يَهُودَ الْحِجَازِ وَأَهْلَ نَجْرَانَ مِنْ جَزِيرَةِ الْعَرَبِ",
            "id": "Telah mengabarkan kepada kami ['Affan] telah menceritakan kepada kami [Yahya bin Sa'id Al Qaththan] telah menceritakan kepada kami [Ibraihim bin Maimun] seorang laki-laki dari penduduk Kufah, telah menceritakan kepadaku [Sa'd bin Samurah bin Jundub] dari ayahnya yaitu [Samurah] dari [Abu 'Ubaidah bin Al Jarrah] ia berkata; \"Diantara perkataan terakhir yang diucapkan Rasulullah shallallahu 'alaihi wasallam adalah, beliau bersabda: \"Keluarkanlah orang-orang Yahudi Hijaz dan penduduk Najran dari Jazirah Arab.\""
        },
        {
            "number": 2387,
            "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ عَنْ حَيْوَةَ بْنِ شُرَيْحٍ حَدَّثَنِي رَبِيعَةُ بْنُ يَزِيدَ حَدَّثَنِي أَبُو إِدْرِيسَ حَدَّثَنِي أَبُو ثَعْلَبَةَ قَالَ أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّا بِأَرْضِ أَهْلِ الْكِتَابِ فَنَأْكُلُ فِي آنِيَتِهِمْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ كُنْتَ بِأَرْضٍ كَمَا ذَكَرْتَ فَلَا تَأْكُلُوا فِي آنِيَتِهِمْ إِلَّا أَنْ لَا تَجِدُوا مِنْهَا بُدًّا فَإِنْ لَمْ تَجِدُوا مِنْهَا بُدًّا فَاغْسِلُوهَا ثُمَّ كُلُوا فِيهَا",
            "id": "Telah mengabarkan kepada kami [Abu 'Ashim] dari [Haiwah bin Syuraih] telah menceritakan kepadaku [Rabi'ah bin Yazid] telah menceritakan kepadaku [Abu Idris] telah menceritakan kepadaku [Abu Tsa'labah] ia berkata; aku datang menemui Rasulullah shallallahu 'alaihi wasallam sambil berkata; \"Wahai Rasulullah, sesungguhnya kami berada di negeri orang-orang ahli kitab, kami makan dengan bejana mereka.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila engkau berada di suatu negeri sebagaimana yang telah engkau sebutkan, maka janganlah engkau makan dengan bejana mereka, kecuali jika tidak ada tempat lain untuk kalian pergunakan. Jika kalian tidak mendapatkan tempat lain, maka cucilah bejana tersebut kemudian makanlan dengannya.\""
        },
        {
            "number": 2388,
            "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ حَدَّثَنَا سُلَيْمَانُ هُوَ ابْنُ الْمُغِيرَةِ عَنْ حُمَيْدٍ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ قَالَ دُلِّيَ جِرَابٌ مِنْ شَحْمٍ يَوْمَ خَيْبَرَ قَالَ فَأَتَيْتُهُ فَالْتَزَمْتُهُ قَالَ ثُمَّ قُلْتُ لَا أُعْطِي مِنْ هَذَا أَحَدًا الْيَوْمَ شَيْئًا فَالْتَفَتُّ فَإِذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَبْتَسِمُ إِلَيَّ قَالَ عَبْد اللَّهِ أَرْجُو أَنْ يَكُونَ حُمَيْدٌ سَمِعَ مِنْ عَبْدِ اللَّهِ",
            "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] telah menceritakan kepadaku [Sulaiman yaitu Ibnu Al Mughirah] dari [Humaid] dari [Abdullah bin Mughaffal] ia berkata; \"Ketika perang Khaibar, terdapat sekantong lemak yang menggantung (dalam wadah), lalu akupun mendatanginya serta menungguinya sambil mengatakan; \"Tidak akan aku berikan sedikitpun kepada orang lain.\" Ketika aku menoleh, ternyata Rasulullah shallallahu 'alaihi wasallam tersenyum kepadaku.\" Abdullah mengatakan; \"Aku berharap Humaid telah mendengar dari Abdullah."
        },
        {
            "number": 2389,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا ابْنُ عُيَيْنَةَ عَنْ عَمْرٍو عَنْ بَجَالَةَ قَالَ سَمِعْتُهُ يَقُولُ لَمْ يَكُنْ عُمَرُ أَخَذَ الْجِزْيَةَ مِنْ الْمَجُوسِ حَتَّى شَهِدَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَذَهَا مِنْ مَجُوسِ هَجَرَ",
            "id": "Telah mengabarkan kepada kepada [Muhammad bin Yusuf] telah menceritakan kepada kami [Ibnu 'Uyainah] dari ['Amr] dari [Bajalah] ia berkata; aku mendengarnya berkata; \"Umar tidak pernah mengambil Jizyah (pajak) dari orang-orang Majusi hingga [Abdurrahman bin 'Auf] bersaksi bahwa Rasulullah shallallahu 'alaihi wasallam mengambilnya dari orang-orang Majusi Hajar.\""
        },
        {
            "number": 2390,
            "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ حَدَّثَنَا مَالِكٌ عَنْ أَبِي النَّضْرِ أَنَّ أَبَا مُرَّةَ مَوْلَى عَقِيلِ بْنِ أَبِي طَالِبٍ أَخْبَرَهُ أَنَّهُ سَمِعَ أُمَّ هَانِئٍ بِنْتَ أَبِي طَالِبٍ تُحَدِّثُ أَنَّهَا ذَهَبَتْ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْفَتْحِ فَقَالَتْ يَا رَسُولَ اللَّهِ زَعَمَ ابْنُ أُمِّي أَنَّهُ قَاتِلٌ رَجُلًا أَجَرْتُهُ فُلَانُ بْنُ هُبَيْرَةَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ أَجَرْنَا مَنْ أَجَرْتِ يَا أُمَّ هَانِئٍ",
            "id": "Telah mengabarkan kepada kami ['Ubaidullah bin Abdul Majid] telah menceritakan kepadaku [Malik] dari [An Nadhr] bahwa [Abu Murrah] mantan budak 'Uqail bin Abu Thalib telah mengabarkan kepadanya, bahwa ia mendengar [Ummu Hani`] menceritakan bahwa dirinya pergi menemui Rasulullah shallallahu 'alaihi wasallam ketika tahun penaklukan kota Makkah, ia berkata; \"Wahai Rasulullah, saudaraku yaitu Fulan bin Hubairah mengaku bahwa ia akan membunuh seseorang yang telah aku lindungi.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku telah melindungi orang yang engkau lindungi wahai Ummu Hani`.\""
        },
        {
            "number": 2391,
            "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ عَاصِمٍ عَنْ أَبِي وَائِلٍ عَنْ ابْنِ مُعَيْزٍ السَّعْدِيِّ قَالَ خَرَجْتُ أُسْفِرُ فَرَسًا لِي مِنْ السَّحَرِ فَمَرَرْتُ عَلَى مَسْجِدٍ مِنْ مَسَاجِدِ بَنِي حَنِيفَةَ فَسَمِعْتُهُمْ يَشْهَدُونَ أَنَّ مُسَيْلَمَةَ رَسُولُ اللَّهِ فَرَجَعْتُ إِلَى عَبْدِ اللَّهِ بْنِ مَسْعُودٍ فَأَخْبَرْتُهُ فَبَعَثَ إِلَيْهِمْ الشُّرَطَ فَأَخَذُوهُمْ فَجِيءَ بِهِمْ إِلَيْهِ فَتَابَ الْقَوْمُ وَرَجَعُوا عَنْ قَوْلِهِمْ فَخَلَّى سَبِيلَهُمْ وَقَدَّمَ رَجُلًا مِنْهُمْ يُقَالُ لَهُ عَبْدُ اللَّهِ بْنُ نُوَاحَةَ فَضَرَبَ عُنُقَهُ فَقَالُوا لَهُ تَرَكْتَ الْقَوْمَ وَقَتَلْتَ هَذَا فَقَالَ إِنِّي كُنْتُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَالِسًا إِذْ دَخَلَ هَذَا وَرَجُلٌ وَافِدَيْنِ مِنْ عِنْدِ مُسَيْلَمَةَ فَقَالَ لَهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَشْهَدَانِ أَنِّي رَسُولُ اللَّهِ فَقَالَا لَهُ تَشْهَدُ أَنْتَ أَنَّ مُسَيْلَمَةَ رَسُولُ اللَّهِ فَقَالَ آمَنْتُ بِاللَّهِ وَرُسُلِهِ لَوْ كُنْتُ قَاتِلًا وَفْدًا لَقَتَلْتُكُمَا فَلِذَلِكَ قَتَلْتُهُ وَأَمَرَ بِمَسْجِدِهِمْ فَهُدِمَ",
            "id": "Telah mengabarkan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami [Abu Bakr bin 'Ayyasy] dari ['Ashim] dari [Abu Wa`il] dari [Ibnu Mu'aiz As Sa'di], ia berkata; Pada waktu sahur, aku keluar mencari kudaku, lalu aku melewati suatu masjid diantara masjid-masjid Bani Hanifah. Aku mendengar mereka bersaksi bahwa Musailamah adalah Rasulullah. Aku bergegas kembali menemui [Abdullah bin Mas'ud] dan mengabarkan kepadanya. Lalu ia mengirimkan beberapa polisi untuk menangkap mereka, Orang-orang itu lalu dihadapkan kepadanya, akhirnya mereka bertaubat dan mencabut perkataan mereka. Setelah Abdullah bin Mas'ud membebaskan mereka, ia mendatangi seseorang yang bernama Abdullah bin Nuwahah dan memenggal kepalanya. Orang-orang berkata kepadanya; \"(Kenapa) anda membiarkan orang-orang itu dan membunuh orang ini?\" Abdullah menjawab; \"Sungguh dahulu aku pernah duduk-duduk bersama Rasulullah shallallahu 'alaihi wasallam, tiba-tiba orang ini dan yang lain masuk sebagai kurir dari Musailamah, beliau lalu berkata kepada mereka berdua: \"Apakah kalian bersaksi bahwa aku adalah Rasulullah?\" Mereka berkata kepada beliau; \"Apakah engkau bersaksi bahwa Musailamah adalah Rasulullah?\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku beriman kepada Allah dan para rasulNya, seandainya aku boleh membunuh utusan, niscaya aku bunuh kalian berdua.\" Oleh karena itulah aku membunuhnya. Ibnu Mas'ud memerintahkan supaya masjid mereka juga dihancurkan."
        },
        {
            "number": 2392,
            "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ حَدَّثَنَا عُيَيْنَةُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ جَوْشَنٍ الْغَطَفَانِيُّ عَنْ أَبِيهِ عَنْ أَبِي بَكْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَتَلَ مُعَاهَدًا فِي غَيْرِ كُنْهِهِ حَرَّمَ اللَّهُ عَلَيْهِ الْجَنَّةَ",
            "id": "Telah mengabarkan kepada kami [Abdullah bin Yazid] telah menceritakan kepada kami ['Uyainah bin Abdurrahman bin Jausyan Al Ghathafani] dari [Ayahnya] dari [Abu Bakrah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membunuh orang kafir Mu'ahhad (yang memiliki perjanjian dengan orang muslim) sebelum waktunya, maka Allah mengharamkan Surga baginya.\""
        },
        {
            "number": 2393,
            "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمُهَلَّبِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ كَانَتْ الْعَضْبَاءُ لِرَجُلٍ مِنْ بَنِي عُقَيْلٍ فَأُسِرَ وَأُخِذَتْ الْعَضْبَاءُ فَمَرَّ عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي وَثَاقٍ فَقَالَ يَا مُحَمَّدُ عَلَى مَا تَأْخُذُونِي وَتَأْخُذُونَ سَابِقَةَ الْحَاجِّ وَقَدْ أَسْلَمْتُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ قُلْتَهَا وَأَنْتَ تَمْلِكُ أَمْرَكَ أَفْلَحْتَ كُلَّ الْفَلَاحِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَأْخُذُكَ بِجَرِيرَةِ حُلَفَائِكَ وَكَانَتْ ثَقِيفٌ قَدْ أَسَرُوا رَجُلَيْنِ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَجَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى حِمَارٍ عَلَيْهِ قَطِيفَةٌ فَقَالَ يَا مُحَمَّدُ إِنِّي جَائِعٌ فَأَطْعِمْنِي وَظَمْآنُ فَاسْقِنِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذِهِ حَاجَتُكَ ثُمَّ إِنَّ الرَّجُلَ فُدِيَ بِرَجُلَيْنِ فَحَبَسَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعَضْبَاءَ لِرَحْلِهِ وَكَانَتْ مِنْ سَوَابِقِ الْحَاجِّ ثُمَّ إِنَّ الْمُشْرِكِينَ أَغَارُوا عَلَى سَرْحِ الْمَدِينَةِ فَذَهَبُوا بِهِ فِيهَا الْعَضْبَاءُ وَأَسَرُوا امْرَأَةً مِنْ الْمُسْلِمِينَ وَكَانُوا إِذَا نَزَلُوا قَالَ أَبُو مُحَمَّد ثُمَّ ذَكَرَ كَلِمَةً إِبِلُهُمْ فِي أَفْنِيَتِهِمْ فَلَمَّا كَانَ ذَاتَ لَيْلَةٍ قَامَتْ الْمَرْأَةُ وَقَدْ نُوِّمُوا فَجَعَلَتْ لَا تَضَعُ يَدَيْهَا عَلَى بَعِيرٍ إِلَّا رَغَا حَتَّى أَتَتْ الْعَضْبَاءَ فَأَتَتْ عَلَى نَاقَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَلُولٍ مُجَرَّسَةٍ فَرَكِبَتْهَا ثُمَّ تَوَجَّهَتْ قِبَلَ الْمَدِينَةِ وَنَذَرَتْ لَئِنْ اللَّهُ نَجَّاهَا لَتَنْحَرَنَّهَا قَالَ فَلَمَّا قَدِمَتْ عُرِفَتْ النَّاقَةُ فَقِيلَ نَاقَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَوْا بِهَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَخْبَرَتْ الْمَرْأَةُ بِنَذْرِهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِئْسَمَا جَزَيْتِهَا أَوْ بِئْسَمَا جَزَتْهَا إِنْ اللَّهُ نَجَّاهَا لَتَنْحَرَنَّهَا لَا وَفَاءَ لِنَذْرٍ فِي مَعْصِيَةِ اللَّهِ وَلَا فِيمَا لَا يَمْلِكُ ابْنُ آدَمَ",
            "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Abu Qilabah] dari [Abu Al Muhallab] dari [Imran bin Hushain] ia berkata; Dahulu 'Adhba` (nama unta rasul) adalah milik seorang laki-laki Bani 'Uqail, kemudian ia ditawan, dan 'Adhba`pun diambil. Kemudian Rasulullah shallallahu 'alaihi wasallam melewatinya, sementara orang itu dalam keadaan terikat. Laki-laki itu berkata; \"Wahai Muhammad, kenapa engkau menawanku dan mengambil unta pacuanku yang larinya cepat? Sungguh aku telah masuk Islam.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika yang kamu katakan benar, dan kamu dapat mengendalikan urusanmuy, maka kamu akan mendapatkan keberuntungan.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kami menangkapmu karena kejahatan para sekutumu (yaitu Tsaqif).\" -Bani Tsaqif telah menawan dua sahabat Rasulullah shallallahu 'alaihi wasallam- Rasulullah shallallahu 'alaihi wasallam lalu datang sambil naik keledai dengan memakai mantel. Tawanan itu berkata; \"Wahai Muhammad, aku lapar, berilah aku makan, dan aku juga haus, berilah aku minum.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ini kebutuhanmu!.\" Lalu tawanan itu ditebus dengan dua orang sahabat, sementara Rasulullah shallallahu 'alaihi wasallam menahan Al 'Adhba` untuk kendaraan beliau. Unta tersebut termasuk diantara unta-unta yang gerak lajunya sangat cepat. Suatu ketika orang-orang musyrik menyerang Madinah dengan tiba-tiba, dan berhasil membawa beberapa ekor ternak, diantaranya pula terdapat Al Adhba`, mereka juga berhasil menawan seorang wanita, apabila mereka singgah…\" -Abu Muhammad berkata; kemudian (Imran bin Hushain) menyebutkan redaksi hadits; \"Mereka menderumkan unta-unta mereka di halaman persinggahan mereka. Pada suatu malam wanita yang tertawan berdiri ketika mereka terlelap tertidur. Setiap kali wanita itu meletakkan tangannya di atas unta, unta tersebut bersuara hingga ia sampai kepada Al 'Adhba`, lalu ia mendatangi unta Rasulullah shallallahu 'alaihi wasallam yang penurut dan berpengalaman, wanita itu langsung menungganginya menuju arah Madinah, ia bernadzar seandainya Allah menyelamatkannya, niscaya ia akan menyembelih unta tersebut. Imran berkata; \"Setibanya di Madinah, unta tersebut dikenali dan dikatakan; \"Itu adalah unta Rasulullah shallallahu 'alaihi wasallam.\" orang-orangpun menemui Nabi shallallahu 'alaihi wasallam dengan membawa untanya, wanita itu memberitahukan nadzarnya. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh buruk balasan yang engkau berikan.\" Atau \"Sungguh buruk balasan yang diberikan wanita itu, sesungguhnya Allah telah menyelamatkannya, justeru ia hendak menyembelihnya. Tidak boleh menunaikan nadzar dalam kemaksiatan kepada Allah, dan dalam perkara yang tidak dimiliki anak Adam.\""
        },
        {
            "number": 2394,
            "arab": " أَخْبَرَنَا بِشْرُ بْنُ ثَابِتٍ حَدَّثَنَا شُعْبَةُ عَنْ الْمُغِيرَةِ عَنْ الشَّعْبِيِّ عَنْ مُحَرَّرِ بْنِ أَبِي هُرَيْرَةَ عَنْ أَبِيهِ قَالَ كُنْتُ مَعَ عَلِيِّ بْنِ أَبِي طَالِبٍ لَمَّا بَعَثَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَادَى بِأَرْبَعٍ حَتَّى صَهَلَ صَوْتُهُ أَلَا لَا يَدْخُلُ الْجَنَّةَ إِلَّا نَفْسٌ مُسْلِمَةٌ وَلَا يَحُجَّنَّ بَعْدَ الْعَامِ مُشْرِكٌ وَلَا يَطُوفُ بِالْبَيْتِ عُرْيَانٌ وَمَنْ كَانَ بَيْنَهُ وَبَيْنَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَهْدٌ فَإِنَّ أَجَلَهُ إِلَى أَرْبَعَةِ أَشْهُرٍ فَإِذَا مَضَتْ الْأَرْبَعَةُ فَإِنَّ اللَّهَ بَرِيءٌ مِنْ الْمُشْرِكِينَ وَرَسُولُهُ",
            "id": "Telah mengabarkan kepada kami [Bisyr bin Tsabit] telah menceritakan kepada kami [Syu'bah] dari [Al Mughirah] dari [Asy Sya'bi] dari [Muharrar bin Abu Hurairah] dari [Ayahnya], ia berkata; aku pernah bersama Ali bin Abu Thalib ketika Rasulullah shallallahu 'alaihi wasallam mengutusnya. Kemudian ia mengumumkan empat perkara hingga suaranya menjadi serak, katanya; \"Ketahuilah, bahwa tidak akan masuk Surga kecuali jiwa mukmin, dan orang-orang musyrik tidak boleh berthawaf di Ka'bah dalam keadaan telanjang, barangsiapa antara dia dan Rasulullah shallallahu 'alaihi wasallam terdapat perjanjian, maka temponya hingga empat bulan, apabila telah berlalu empat bulan, sesungguhnya Allah dan rasulNYa berlepas diri dari orang-orang musyrik.\""
        },
        {
            "number": 2395,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ إِسْرَائِيلَ حَدَّثَنَا أَبُو إِسْحَقَ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَ اعْتَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ذِي الْقَعْدَةِ فَأَبَى أَهْلُ مَكَّةَ أَنْ يَدَعُوهُ أَنْ يَدْخُلَ مَكَّةَ حَتَّى قَاضَاهُمْ عَلَى أَنْ يُقِيمَ ثَلَاثَةَ أَيَّامٍ فَلَمَّا كَتَبُوا هَذَا مَا قَاضَى عَلَيْهِ مُحَمَّدٌ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالُوا لَا نُقِرُّ بِهَذَا لَوْ نَعْلَمُ أَنَّكَ رَسُولُ اللَّهِ مَا مَنَعْنَاكَ شَيْئًا وَلَكِنْ أَنْتَ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ فَقَالَ أَنَا رَسُولُ اللَّهِ وَأَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ فَقَالَ لِعَلِيٍّ امْحُ مُحَمَّدٌ رَسُولُ اللَّهِ فَقَالَ لَا وَاللَّهِ لَا أَمْحُوهُ أَبَدًا فَأَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْكِتَابَ وَلَيْسَ يُحْسِنُ يَكْتُبُ فَكَتَبَ مَكَانَ رَسُولِ اللَّهِ هَذَا مَا قَاضَى عَلَيْهِ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ أَنْ لَا يَدْخُلَ مَكَّةَ بِسِلَاحٍ إِلَّا السَّيْفَ فِي الْقِرَابِ وَأَنْ لَا يُخْرِجَ مِنْ أَهْلِهَا أَحَدًا أَرَادَ أَنْ يَتْبَعَهُ وَلَا يَمْنَعَ أَحَدًا مِنْ أَصْحَابِهِ أَرَادَ أَنْ يُقِيمَ بِهَا فَلَمَّا دَخَلَهَا وَمَضَى الْأَجَلُ أَتَوْا عَلِيًّا فَقَالُوا قُلْ لِصَاحِبِكَ فَلْيَخْرُجْ عَنَّا فَقَدْ مَضَى الْأَجَلُ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] dari [Isma'il] telah menceritakan kepada kami [Abu Ishaq] dari [Al Bara` bin 'Azib], ia berkata; Rasulullah shallallahu 'alaihi wasallam melakukan umrah pada bulan Dzul Qa'dah, namun penduduk Makkah enggan membiarkan beliau memasuki Makkah, hingga beliau membuat perjanjian dengan mereka untuk tinggal selama tiga hari. Tatkala mereka menulis; \"Ini adalah perjanjian yang dibuat Muhammad Rasulullah shallallahu 'alaihi wasallam shallallahu 'alaihi wasallam.\" Mengetahui hal itu, orang-orang musyrik berkata; \"Kami tidak mengakui hal ini, seandainya kami mengetahui bahwa engkau adalah utusan Allah, maka kami tidak akan menghalangimu sedikitpun, akan tetapi engkau adalah Muhammad bin Abdullah.\" Kemudian beliau bersabda: \"Aku adalah Rasulullah dan aku adalah Muhammad bin Abdullah.\" Kemudian beliau bersabda kepada Ali: \"Hapuslah Muhammad Rasulullah.\" Kemudian Ali berkata; \"Tidak, demi Allah aku tidak akan menghapusnya selamanya.\" Kemudian Rasulullah shallallahu 'alaihi wasallam mengambil tulisan tersebut, sementara beliau tidak pandai menulis, beliau menulis pada tempat Rasulullah, dengan kata; \"Ini adalah perjanjian yang dibuat Muhammad bin Abdullah, yaitu untuk tidak masuk Makkah dengan membawa senjata kecuali pedang dalang sarungnya, dan seorangpun dari penduduk Makkah tidak boleh keluar mengikutinya, dan tidak melarang seorangpun dari sahabatnya yang ingin tinggal di Makkah.\" Setelah beliau memasuki Makkah, dan telah jatuh tempo, orang-orang musyrik berkata kepada Ali; \"Katakan kepada sahabatmu, hendaknya ia keluar dari (wilayah) kami, sebab temponya telah berlalu.\""
        },
        {
            "number": 2396,
            "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو خَالِدٍ عَنْ الْحَجَّاجِ عَنْ الْحَكَمِ عَنْ مِقْسَمٍ عَنْ ابْنِ عَبَّاسٍ قَالَ خَرَجَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَبْدَانِ مِنْ الطَّائِفِ فَأَعْتَقَهُمَا أَحَدُهُمَا أَبُو بَكْرَةَ",
            "id": "Telah mengabarkan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami [Abu Khalid] dari [Al Hajjaj] dari [Al Hakam] dari [Miqsam] dari [Ibnu Abbas], ia berkata; \"Dua orang budak dari Tha`if keluar hendak menemui Nabi shallallahu 'alaihi wasallam, kemudian beliau membebaskan keduanya, salah satunya dari budak tersebut bernama Abu Bakrah."
        },
        {
            "number": 2397,
            "arab": " حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّهُ قَالَ رُمِيَ يَوْمَ الْأَحْزَابِ سَعْدُ بْنُ مُعَاذٍ فَقَطَعُوا أَبْجَلَهُ فَحَسَمَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالنَّارِ فَانْتَفَخَتْ يَدُهُ فَنَزَفَهُ فَحَسَمَهُ أُخْرَى فَانْتَفَخَتْ يَدُهُ فَلَمَّا رَأَى ذَلِكَ قَالَ اللَّهُمَّ لَا تُخْرِجْ نَفْسِي حَتَّى تُقِرَّ عَيْنِي مِنْ بَنِي قُرَيْظَةَ فَاسْتَمْسَكَ عِرْقُهُ فَمَا قَطَرَ قَطْرَةً حَتَّى نَزَلُوا عَلَى حُكْمِ سَعْدٍ فَأَرْسَلَ إِلَيْهِ فَحَكَمَ أَنْ تُقْتَلَ رِجَالُهُمْ وَتُسْتَحْيَى نِسَاؤُهُمْ وَذَرَارِيُّهُمْ يَسْتَعِينُ بِهِمْ الْمُسْلِمُونَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصَبْتَ حُكْمَ اللَّهِ فِيهِمْ وَكَانُوا أَرْبَعَ مِائَةٍ فَلَمَّا فُرِغَ مِنْ قَتْلِهِمْ انْفَتَقَ عِرْقُهُ فَمَاتَ",
            "id": "Telah menceritakan kepada kami [Ahmad bin Abdullah] telah menceritakan kepada kami [Laits bin Sa'd] dari [Abu Az Zubair] dari [Jabir bin Abdullah] bahwa ia berkata; Pada saat perang Khandaq, Sa'd bin Mu'adz terkena panah, kemudian mereka memotong urat nadinya, Rasulullah shallallahu 'alaihi wasallam lalu menghentikan darahnya dengan kay. Tenyata tangannya membengkak, maka beliau mengeluarkan darahnya dan menghentikannya dengan kay, namun tangannya tetap membengkak, setelah mengetahui hal itu, ia berkata; \"Ya Allah, janganlah engkau mengeluarkan nyawaku hingga mataku terasa sejuk karena kebinasaan Bani Quraizhah.\" Setelah itu uratnya terhenti, dan tidak ada tetesan darah yang keluar setetespun, hingga Bani Quraizhah mendapatkan keputusan dari hukum Sa'd. Suatu ketika beliau mengirim utusan kepadanya, lalu Sa'd memutuskan agar orang laki-laki mereka dibunuh dan para wanita serta keturunan mereka dibiarkan hidup sebagai pembantu kaum Muslimin. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Engkau telah meutusi dengan hukum Allah terhadap mereka.\" Waktu itu mereka berjumlahh empat ratus orang, seusai membunuh mereka, uratnya pecah hingga ia meninggal dunia.\""
        },
        {
            "number": 2398,
            "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي اللَّيْثُ حَدَّثَنِي عُقَيْلٌ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ عَبْدَ اللَّهِ بْنَ عَدِيِّ بْنِ حَمْرَاءَ الزُّهْرِيَّ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَلَى رَاحِلَتِهِ وَاقِفًا بِالْحَزْوَرَةِ يَقُولُ وَاللَّهِ إِنَّكِ لَخَيْرُ أَرْضِ اللَّهِ وَأَحَبُّ أَرْضِ اللَّهِ إِلَى اللَّهِ وَلَوْلَا أَنِّي أُخْرِجْتُ مِنْكِ مَا خَرَجْتُ",
            "id": "Telah mengabarkan kepada kami [Abdullah bin Shalih] telah menceritakan kepadaku [Al Laits] telah menceritakan kepadaku ['Uqail] dari [Ibnu Syihab] telah mengabarkan kepadaku [Abu Salamah bin Abdurrahman] bahwa [Abdullah bin 'Adi bin Hamra` Az Zuhri] berkata; \"Aku melihat Rasulullah shallallahu 'alaihi wasallam berada di atas kendaraannya sambil berdiri di Hazwarah, beliau bersabda: \"Demi Allah, sesungguhnya engkau adalah tanah Allah yang terbaik dan yang paling Allah cintai. Seandainya aku tidak dikeluarkan darimu, niscaya aku tidak akan keluar.\""
        },
        {
            "number": 2399,
            "arab": " حَدَّثَنَا سَعِيدُ بْنُ الرَّبِيعِ أَخْبَرَنَا شُعْبَةُ عَنْ سُلَيْمَانَ عَنْ مُجَاهِدٍ قَالَ قَالَتْ عَائِشَةُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَسُبُّوا الْأَمْوَاتَ فَإِنَّهُمْ قَدْ أَفْضَوْا إِلَى مَا قَدَّمُوا",
            "id": "Telah menceritakan kepada kami [Sa'id bin Ar Rabi'] telah mengabarkan kepada kami [Syu'bah] dari [Sulaiman] dari [Mujahid], ia berkata; ['Aisyah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian mencaci orang yang telah meninggal, sesungguhnya mereka telah sampai kepada apa yang telah mereka lakukan (pembalasan amal).\""
        },
        {
            "number": 2400,
            "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ إِسْرَائِيلَ عَنْ مَنْصُورٍ عَنْ مُجَاهِدٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَ لَمَّا كَانَ يَوْمُ فَتْحِ مَكَّةَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا هِجْرَةَ بَعْدَ الْفَتْحِ وَلَكِنْ جِهَادٌ وَنِيَّةٌ",
            "id": "Telah mengabarkan kepada kami ['Ubaidullah bin Musa] dari [Isra`il] dari [Manshur] dari [Mujahid] dari [Thawus] dari [Ibnu Abbas], ia berkata; Pada saat penaklukan kota Makkah, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada hijrah setelah penaklukan kota Makkah, yang ada hanyalah jihad dan niat.\""
        },
        {
            "number": 2401,
            "arab": " حَدَّثَنَا الْحَكَمُ بْنُ نَافِعٍ عَنْ حَرِيزِ بْنِ عُثْمَانَ عَنْ ابْنِ أَبِي عَوْفٍ وَهُوَ عَبْدُ الرَّحْمَنِ عَنْ أَبِي هِنْدٍ الْبَجَلِيِّ وَكَانَ مِنْ السَّلَفِ قَالَ تَذَاكَرُوا الْهِجْرَةَ عِنْدَ مُعَاوِيَةَ وَهُوَ عَلَى سَرِيرِهِ فَقَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تَنْقَطِعُ الْهِجْرَةُ حَتَّى تَنْقَطِعَ التَّوْبَةُ ثَلَاثًا وَلَا تَنْقَطِعُ التَّوْبَةُ حَتَّى تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا",
            "id": "Telah menceritakan kepada kami [Al Hakam bin Nafi'] dari [Hariz bin Utsman] dari [Ibnu Abu 'Auf yaitu Abdurrahman] dari [Abu Hindun Al Bajali] -dan dia termasuk dari ulama salaf- Ia berkata; \"Orang-orang saling menyebutkan mengenai hijrah di hadapan [Mu'awiyah], ketika itu Mu'awiyah tengah berada di atas dipannya. Kemudian ia berkata; \"Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Hijrah tidak terputus hingga terputusnya taubat. -Beliau mengucapkannya hingga tiga kali- dan taubat tidak akan terputus hingga matahari terbit dari baratnya.\""
        },
        {
            "number": 2402,
            "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا مُحَمَّدُ بْنُ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْلَا الْهِجْرَةُ لَكُنْتُ امْرَأً مِنْ الْأَنْصَارِ",
            "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Muhammad bin 'Amr] dari [Abu Salamah] dari [Abu Hurairah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seandainya tidak ada hijrah, niscaya aku termnasuk dari orang Anshar.\""
        },
        {
            "number": 2403,
            "arab": " أَخْبَرَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سَعِيدِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا مِنْ أَمِيرِ عَشَرَةٍ إِلَّا يُؤْتَى بِهِ يَوْمَ الْقِيَامَةِ مَغْلُولَةٌ يَدَاهُ إِلَى عُنُقِهِ أَطْلَقَهُ الْحَقُّ أَوْ أَوْبَقَهُ",
            "id": "Telah mengabarkan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Hammad bin Salamah] dari [Yahya bin Sa'id] dari [Sa'id bin Yasar] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak ada seorang pemimpinpun yang memimpin sepuluh orang, kecuali ia akan didatangkan pada hari kiamat dalam keadaan tangannya terbelenggu ke lehernya, tidak ada yang bisa melepasnya kecuali keadilan atau dia akan celaka karena kezhaliman.\""
        },
        {
            "number": 2404,
            "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ حَدَّثَنَا شُعْبَةُ أَخْبَرَنِي عَمْرٌو قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ الْحَارِثِ يُحَدِّثُ عَنْ أَبِي كَثِيرٍ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَمْرٍو يُحَدِّثُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِيَّاكُمْ وَالظُّلْمَ فَإِنَّ الظُّلْمَ ظُلُمَاتٌ يَوْمَ الْقِيَامَةِ",
            "id": "Telah mengabarkan kepada kami [Abu Al Walid] telah menceritakan kepada kami [Syu'bah], telah mengabarkan kepadaku ['Amr], ia berkata; Aku mendengar [Abdullah bin Al Harits] menceritakan dari [Abu Katsir], ia berkata; aku mendengar [Abdullah bin 'Amr] menceritakan dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jauhilah kezhaliman, sesungguhnya kezhaliman adalah kegelapan pada hari Kiamat.\""
        },
        {
            "number": 2405,
            "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ نَافِعٍ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ أَنَّ أَبَا هُرَيْرَةَ قَالَ إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ يُؤَيِّدُ هَذَا الدِّينَ بِالرَّجُلِ الْفَاجِرِ",
            "id": "Telah mengabarkan kepada kami [Al Hakam bin Nafi'] telah mengabarkan kepad kami [Syu'aib] dari [Az Zuhri], telah mengabarkan kepadaku [Sa'id bin Al Musayyab] bahwa [Abu Hurairah] berkata; sesungguhnya Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah menguatkan agama ini dengan laki-laki fajir.\""
        },
        {
            "number": 2406,
            "arab": " أَخْبَرَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا صَفْوَانُ حَدَّثَنِي أَزْهَرُ بْنُ عَبْدِ اللَّهِ الْحَرَازِيُّ عَنْ أَبِي عَامِرٍ هُوَ عَبْدُ اللَّهِ بْنُ لُحَيٍّ الْهَوْزَنِيِّ عَنْ مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ فِينَا فَقَالَ أَلَا إِنَّ مَنْ كَانَ قَبْلَكُمْ مِنْ أَهْلِ الْكِتَابِ افْتَرَقُوا عَلَى ثِنْتَيْنِ وَسَبْعِينَ مِلَّةً وَإِنَّ هَذِهِ الْأُمَّةَ سَتَفْتَرِقُ عَلَى ثَلَاثٍ وَسَبْعِينَ اثْنَتَانِ وَسَبْعُونَ فِي النَّارِ وَوَاحِدَةٌ فِي الْجَنَّةِ قَالَ عَبْد اللَّهِ الْحَرَازُ قَبِيلَةٌ مِنْ أَهْلِ الْيَمَنِ",
            "id": "Telah mengabarkan kepada kami [Abu Al Mughirah] telah menceritakan kepada kami [Shafwan] telah menceritakan kepadaku [Azhar bin Abdullah Al Harazi] dari [Abu Amir yaitu Abdullah bin Luhai Al Hauzani] dari [Mu'awiyah bin Abu Sufyan] bahwa Rasulullah shallallahu 'alaihi wasallam berdiri diantara kami seraya bersabda: \"Ketahuilah, bahwa orang-orang sebelum kalian dari kalangan ahli kitab terpecah menjadi tujuh dua agama, sedangkan umat ini akan terpecah menjadi tujuh puluh tiga golongan. Tujuh puluh dua di Neraka dan satu di Surga.\" Abdullah bekata; \"Al Haraz adalah suatu kabilah dari penduduk Yaman.\""
        },
        {
            "number": 2407,
            "arab": " حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ الْجَعْدِ أَبِي عُثْمَانَ حَدَّثَنَا أَبُو رَجَاءٍ الْعُطَارِدِيُّ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يَرْوِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ رَأَى مِنْ أَمِيرِهِ شَيْئًا يَكْرَهُهُ فَلْيَصْبِرْ فَإِنَّهُ لَيْسَ مِنْ أَحَدٍ يُفَارِقُ الْجَمَاعَةَ شِبْرًا فَيَمُوتُ إِلَّا مَاتَ مِيتَةً جَاهِلِيَّةً",
            "id": "Telah menceritakan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Hammad bin Zaid] dari [Al Ja'd Abu Utsman] telah menceritakan kepada kami [Abu Raja` Al 'Utharidi], ia berkata; aku mendengar [Ibnu Abbas] meriwayatkan dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa melihat pada diri pemimpinnya sesuatu yang tidak ia sukai, hendaknya ia bersabar, sesungguhnya tidak seorangpun yang memisahkan diri dari Jam'ah walau sejengkal, kemudian mati, maka matinya seperti mati jahiliyah.\""
        },
        {
            "number": 2408,
            "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ حَدَّثَنَا إِيَاسُ بْنُ سَلَمَةَ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ سَلَّ عَلَيْنَا السِّلَاحَ فَلَيْسَ مِنَّا",
            "id": "Telah mengabarkan kepada kami [Abu Al Walid] telah menceritakan kepada kami [Ikrimah bin 'Ammar] telah menceritakan kepada kami [Iyas bin Salamah] dari [Ayahnya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa menodongkan sejata kepada kami, maka bukan termasuk golongan kami.\""
        },
        {
            "number": 2409,
            "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ نَافِعٍ عَنْ شُعَيْبِ بْنِ أَبِي حَمْزَةَ عَنْ الزُّهْرِيِّ قَالَ كَانَ مُحَمَّدُ بْنُ جُبَيْرِ بْنِ مُطْعِمٍ يُحَدِّثُ عَنْ مُعَاوِيَةَ أَنَّهُ قَالَ وَهُوَ عِنْدَهُ فِي وَفْدٍ مِنْ قُرَيْشٍ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ هَذَا الْأَمْرَ فِي قُرَيْشٍ لَا يُعَادِيهِمْ أَحَدٌ إِلَّا كَبَّهُ اللَّهُ عَلَى وَجْهِهِ مَا أَقَامُوا الدِّينَ",
            "id": "Telah mengabarkan kepada kami [Al Hakam bin Nafi'] dari [Syu'aib bin Abu Hamzah] dari [Az Zuhri], ia berkata; [Muhammad bin Jubair bin Muth'im] menceritakan dari [Mu'awiyah] bahwa ia berkata; -sedangkan dirinya berada di antara para delegasi orang-orang Quraisy- \"Sesungguhnya aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya perkara kekhilafahan ini ada pada orang-orang Quraisy, tidak ada seorangpun yang menentang mereka kecuali Allah akan menghinakannya selama mereka menegakkan agama ini.\""
        },
        {
            "number": 2410,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُرَيْشٌ وَالْأَنْصَارُ وَمُزَيْنَةُ وَجُهَيْنَةُ وَأَسْلَمُ وَغِفَارٌ وَأَشْجَعُ لَيْسَ لَهُمْ مَوْلًى دُونَ اللَّهِ وَرَسُولِهِ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Sufyan] dari [Sa'd bin Ibrahim] dari [Abdurrahman bin Hurmuz Al A'raj] dari [Abu Hurairah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Quraisy, Anshar, Muzainah, Juhainah, Aslam, Ghifar, serta Asyja', mereka tidak memiliki penolong selain Allah dan rasul-Nya.\""
        },
        {
            "number": 2411,
            "arab": " حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ عَلِيِّ بْنِ زَيْدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَرَأَيْتُمْ إِنْ كَانَ أَسْلَمُ وَغِفَارٌ خَيْرًا مِنْ الْحَلِيفَيْنِ أَسَدٍ وَغَطَفَانَ أَتُرَوْنَهُمْ خَسِرُوا قَالُوا نَعَمْ قَالَ فَإِنَّهُمْ خَيْرٌ مِنْهُمْ قَالَ أَفَرَأَيْتُمْ إِنْ كَانَتْ مُزَيْنَةُ وَجُهَيْنَةُ خَيْرًا مِنْ تَمِيمٍ وَعَامِرِ بْنِ صَعْصَعَةَ وَمَدَّ بِهَا صَوْتَهُ أَتُرَوْنَهُمْ خَسِرُوا قَالُوا نَعَمْ قَالَ فَإِنَّهُمْ خَيْرٌ مِنْهُمْ",
            "id": "Telah menceritakan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Hammad bin Salamah] dari [Ali bin Zaid] dari [Abdurrahman bin Abu Bakrah] dari [Ayahnya] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Bagaimana pendapat kalian apabila Aslam, dan Ghifar lebih baik daripada kedua sekutunya yaitu Asad dan Ghathafan, apakah kalian melihat mereka akan merugi?\" Para sahabat menjawab; \"Ya.\" Beliau bersabda: \"Sesungguhnya mereka (Aslam dan Ghifar) lebih baik daripada mereka (Asad dan Ghathafan).\" Beliau bersabda lagi: \"Bagaimana pendapat kalian apabila Muzainah dan Juhainah lebih baik daripada Tamim dan 'Amir bin Sha'sha'ah -beliau memanjangkan suaranya- apakah kalian melihat mereka akan merugi?\" Para sahabat menjawab; \"Ya.\" Beliau bersabda; \"Sesungguhnya mereka (Bani Muzainah dan Juhainah) lebih baik daripada mereka (Tamim dan 'Amr bin Sha'sha'ah).\""
        },
        {
            "number": 2412,
            "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ حَدَّثَنَا سُلَيْمَانُ هُوَ ابْنُ الْمُغِيرَةِ عَنْ حُمَيْدِ بْنِ هِلَالٍ عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ عَنْ أَبِي ذَرٍّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غِفَارٌ غَفَرَ اللَّهُ لَهَا وَأَسْلَمُ سَالَمَهَا اللَّهُ",
            "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] telah menceritakan kepada kami [Sulaiman yaitu Ibnu Al Mughirah] dari [Humaid bin Hilal] dari [Abdullah bin Ash Shamit] dari [Abu Dzar], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ghifar, semoga Allah mengampuni mereka dan Aslam, semoga Allah menyelamatkan mereka.\""
        },
        {
            "number": 2413,
            "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ حَدَّثَنَا عَبْدُ الْعَزِيزِ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ غِفَارٌ غَفَرَ اللَّهُ لَهَا وَأَسْلَمُ سَالَمَهَا اللَّهُ وَعُصَيَّةُ عَصَتْ اللَّهَ وَرَسُولَهُ",
            "id": "Telah mengabarkan kepada kami [Al Hakam bin Al Mubarak] telah menceritakan kepada kami [Abdul Aziz] dari [Musa bin 'Uqbah] dari [Abdullah bin Dinar] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ghifar, semoga Allah mengampuni mereka dan Aslam, semoga Allah menyelamatkan mereka dan 'Ushayyah telah berdurhaka kepada Allah dan rasulNya.\""
        },
        {
            "number": 2414,
            "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا شَرِيكٌ عَنْ سِمَاكٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قِيلَ لِشَرِيكٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَعَمْ لَا حِلْفَ فِي الْإِسْلَامِ وَفِي الْجَاهِلِيَّةِ لَمْ يَزِدْهُ الْإِسْلَامُ إِلَّا شِدَّةً وَجِدَّةً",
            "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Syarik] dari [Simak] dari [Ikrimah] dari [Ibnu Abbas], Syarik ditanya; \"Apakah dari Nabi shallallahu 'alaihi wasallam?\" Ia menjawab; \"Ya. Tidak ada perjanjian dalam Islam, dan Jahiliyah, melainkan tidak menambah Islam kecuali menjadi semakin kuat dan erat.\""
        },
        {
            "number": 2415,
            "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا شُعْبَةُ قَالَ قُلْتُ لِمُعَاوِيَةَ بْنِ قُرَّةَ أَكَانَ أَنَسٌ يَذْكُرُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِلنُّعْمَانِ بْنِ مُقَرِّنٍ ابْنُ أُخْتِ الْقَوْمِ مِنْهُمْ قَالَ نَعَمْ",
            "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Syu'bah], ia berkata; aku berkata kepada [Mu'awiyah bin Qurrah]; \"Apakah [Anas] menyebutkan bahwa Nabi shallallahu 'alaihi wasallam bersabda kepada An Nu'man bin Muqarrin: \"Anak saudara wanita suatu kaum adalah bagian dari mereka.?\" Ia berkata; \"Ya.\""
        },
        {
            "number": 2416,
            "arab": " حَدَّثَنَا سَعِيدُ بْنُ الْمُغِيرَةِ حَدَّثَنَا عِيسَى بْنُ يُونُسَ عَنْ كَثِيرِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَوْلَى الْقَوْمِ مِنْهُمْ وَحَلِيفُ الْقَوْمِ مِنْهُمْ وَابْنُ أُخْتِ الْقَوْمِ مِنْهُمْ",
            "id": "Telah menceritakan kepada kami [Sa'id bin Al Mughirah] telah menceritakan kepada kami [Isa bin Yunus] dari [Katsir bin Abdullah] dari [Ayahnya] dari [Kakeknya], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mantan budak suatu kaum adalah bagian dari mereka, sekutu suatu kaum adalah bagian dari mereka, dan anak seorang saudara wanita suatu kaum adalah bagian dari mereka.\""
        },
        {
            "number": 2417,
            "arab": " حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ الدَّسْتَوَائِيُّ حَدَّثَنَا قَتَادَةُ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ غَنْمٍ عَنْ عَمْرِو بْنِ خَارِجَةَ قَالَ كُنْتُ تَحْتَ نَاقَةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَمِعْتُهُ يَقُولُ مَنْ ادَّعَى إِلَى غَيْرِ أَبِيهِ أَوْ انْتَمَى إِلَى غَيْرِ مَوَالِيهِ رَغْبَةً عَنْهُمْ فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ لَا يُقْبَلُ مِنْهُ صَرْفٌ وَلَا عَدْلٌ",
            "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Hisyam Ad Dastawa`i] telah menceritakan kepada kami [Qatadah] dari [Syahr bin Hausyab] dari [Abdurrahman bin Ghanm] dari ['Amr bin Kharijah], ia berkata; aku pernah berada di bawah unta Nabi shallallahu 'alaihi wasallam dan mendengar beliau bersabda: \"Barangsiapa mengaku memiliki nasab selain (nasab) bapaknya atau menisbatkan kepada selain tuannya karena kebencian kepada mereka, maka baginya laknat Allah dan para Malaikat serta seluruh manusia, tidak diterima taubat serta ibadahnya.\""
        },
        {
            "number": 2418,
            "arab": " أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ شُعْبَةَ عَنْ عَاصِمٍ عَنْ أَبِي عُثْمَانَ عَنْ سَعْدٍ وَأَبِي بَكْرَةَ أَنَّهُمَا حَدَّثَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ ادَّعَى إِلَى غَيْرِ أَبِيهِ وَهُوَ يَعْلَمُ أَنَّهُ غَيْرُ أَبِيهِ فَالْجَنَّةُ عَلَيْهِ حَرَامٌ",
            "id": "Telah mengabarkan kepada kami [Sa'id bin 'Amir] dari [Syu'bah] dari ['Ashim] dari [Abu Utsman] dari [Sa'd] serta [Abu Bakrah] bahwa keduanya menceritakan, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mengaku memiliki nasab kepada selain ayahnya, padahal ia mengetahui bahwa ia bukanlah ayahnya, maka haram baginya Surga.\""
        }
    ]
}