{
    "kategori": "Kitab Mimpi",
    "hadits": [
        {
            "number": 2043,
            "arab": " أَخْبَرَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبَانُ حَدَّثَنَا يَحْيَى عَنْ أَبِي سَلَمَةَ عَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَ قُلْتُ يَا نَبِيَّ اللَّهِ قَوْلُ اللَّهِ { لَهُمْ الْبُشْرَى فِي الْحَيَاةِ الدُّنْيَا } فَقَالَ سَأَلْتَنِي عَنْ شَيْءٍ مَا سَأَلَنِي عَنْهُ أَحَدٌ قَبْلَكَ أَوْ أَحَدٌ مِنْ أُمَّتِي قَالَ هِيَ الرُّؤْيَا الصَّالِحَةُ يَرَاهَا الْمُسْلِمُ أَوْ تُرَى لَهُ",
            "id": "Telah mengabarkan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Aban] telah menceritakan kepada kami [Yahya] dari [Abu Salamah] dari ['Ubadah bin Ash Shamit] ia berkata; aku berkata; \"Wahai Nabiyullah, apakah maksud firman Allah Bagi mereka berita gembira dikehidupan dunia.\" Beliau menjawab: \"Engkau telah menanyakan sesuatu yang belum pernah ditayakan seorangpun sebelummu, atau seorangpun dari umatku.\" Beliau bersabda: \"Itu adalah mimpi baik yang dimimpikan oleh seorang muslim atau diperlihatkan kepadanya.\""
        },
        {
            "number": 2044,
            "arab": " أَخْبَرَنَا الْأَسْوَدُ بْنُ عَامِرٍ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَنَسٍ عَنْ عُبَادَةَ بْنِ الصَّامِتِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنْ النُّبُوَّةِ",
            "id": "Telah mengabarkan kepada kami [Al Aswad bin 'Amir] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Anas] dari ['Ubadah bin Ash Shamit] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Mimpi seorang mukmin merupakan satu bagian dari empat puluh enam bagian kenabian.\""
        },
        {
            "number": 2045,
            "arab": " حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ عَنْ أَبِيهِ عَنْ سِبَاعِ بْنِ ثَابِتٍ عَنْ أُمِّ كُرْزٍ الْكَعْبِيَّةِ قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ ذَهَبَتْ النُّبُوَّةُ وَبَقِيَتْ الْمُبَشِّرَاتُ",
            "id": "Telah menceritakan kepada kami [Harun bin Abdullah] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari ['Ubaidullah bin Abu Yazid] dari [Ayahnya] dari [Siba' bin Tsabit] dari [Ummu Kurz Al Ka'biyyah] ia berkata; aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kenabian telah pergi dan yang tersisa adalah kabar gembira.\""
        },
        {
            "number": 2046,
            "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي الْأَحْوَصِ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ رَآنِي فِي الْمَنَامِ فَقَدْ رَآنِي فَإِنَّ الشَّيْطَانَ لَا يَتَمَثَّلُ مِثْلِي",
            "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Abu Ishaq] dari [Abu Al Ahwash] dari [Abdullah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa melihatku dalam mimpi, sungguh ia telah melihatku, karena sesungguhnya Syetan tidak dapat menyerupaiku.\""
        },
        {
            "number": 2047,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُصَفَّى حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ عَنْ الزُّبَيْدِيِّ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي قَتَادَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ رَآنِي فِي الْمَنَامِ فَقَدْ رَأَى الْحَقَّ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mushaffa] telah menceritakan kepada kami [Muhammad bin Harb] dari [Az Zubaidi] dari [Az Zuhri] dari [Abu Salamah] dari [Abu Qatadah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa melihatku dalam mimpi, maka ia telah melihat kebenaran.\""
        },
        {
            "number": 2048,
            "arab": " أَخْبَرَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرُّؤْيَا الصَّالِحَةُ مِنْ اللَّهِ وَالْحُلْمُ مِنْ الشَّيْطَانِ فَإِذَا حَلَمَ أَحَدُكُمْ حُلْمًا يَخَافُهُ فَلْيَبْصُقْ عَنْ شِمَالِهِ ثَلَاثَ مَرَّاتٍ وَلْيَتَعَوَّذْ بِاللَّهِ مِنْ الشَّيْطَانِ فَإِنَّهَا لَا تَضُرُّهُ",
            "id": "Telah mengabarkan kepada kami [Abu Al Mughirah] telah menceritakan kepada kami [Al Auza'i] dari [Yahya] dari [Abdullah bin Abu Qatadah] dari [Ayahnya] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mimpi baik datangnya dari Allah sedangkan mimpi buruk datangnya dari Syetan. Apabila salah seorang dari kalian mimpi buruk yang ia khawatirkan, hendaknya ia meludah ke sebelah kiri sebanyak tiga kali, dan berlindung kepada Allah dari Syetan, sebab hal itu tidak akan membahayakan dirinya.\""
        },
        {
            "number": 2049,
            "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ قَالَ سَمِعْتُ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ يَقُولُ إِنْ كُنْتُ لَأَرَى الرُّؤْيَا تُمْرِضُنِي فَذَكَرْتُ ذَلِكَ لِأَبِي قَتَادَةَ قَالَ وَأَنَا إِنْ كُنْتُ لَأَرَى الرُّؤْيَا تُمْرِضُنِي حَتَّى سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الرُّؤْيَا الصَّالِحَةُ مِنْ اللَّهِ فَإِذَا رَأَى أَحَدُكُمْ مَا يُحِبُّ فَلْيَحْمَدْ اللَّهَ وَلَا يُحَدِّثْ بِهَا إِلَّا مَنْ يُحِبُّ وَإِذَا رَأَى مَا يَكْرَهُ فَلْيَتْفُلْ عَنْ يَسَارِهِ ثَلَاثًا وَلْيَتَعَوَّذْ بِاللَّهِ مِنْ شَرِّهَا وَلَا يُحَدِّثْ بِهَا أَحَدًا فَإِنَّهَا لَنْ تَضُرَّهُ",
            "id": "Telah mengabarkan kepada kami [Abu Al Walid] telah menceritakan kepada kami [Syu'bah] dari [Abd Rabbih bin Sa'id] ia berkata; aku mendengar [Abu Salamah bin Abdurrahman] berkata; Sungguh aku pernah bermimpi sesuatu yang membuatku sakit, kemudian aku ceritakan kepada [Abu Qatadah]. Abu Qatadah berkata; \"Sungguh aku juga pernah bermimpi yang mmebuatkau sakit, hingga aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mimpi baik datangnya dari Allah, maka apabila salah seorang dari kalian bermimpi sesuatu yang ia senangi hendaknya ia memuji Allah, dan tidak menceritakannya kecuali kepada orang yang ia senangi. Apabila ia bermimpi sesuatu yang tidak ia senangi, hendaknya ia meludah ke sebelah kirinya sebanyak tiga kali dan berlindung kepada Allah dari keburukannya, serta tidak menceritakannya kepada seorangpun, maka hal itu tidak akan membahayakan dirinya.\""
        },
        {
            "number": 2050,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ كَثِيرٍ عَنْ مَخْلَدِ بْنِ حُسَيْنٍ عَنْ هِشَامٍ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرُّؤْيَا ثَلَاثٌ فَالرُّؤْيَا الْحَسَنَةُ بُشْرَى مِنْ اللَّهِ وَالرُّؤْيَا تَحْزِينٌ مِنْ الشَّيْطَانِ وَالرُّؤْيَا مِمَّا يُحَدِّثُ بِهِ الْإِنْسَانُ نَفْسَهُ فَإِذَا رَأَى أَحَدُكُمْ مَا يَكْرَهُهُ فَلَا يُحَدِّثْ بِهِ وَلْيَقُمْ وَلْيُصَلِّ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Katsir] dari [Makhlad bin Husain] dari [Hisyam] dari [Ibnu Sirin] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mimpi ada tiga, yaitu; mimpi baik yang merupakan kabar gembira dari Allah, dan mimpi menyedihkan yang datangnya dari Syetan, serta mimpi yang terjadi karena ilusi seseorang. Apabila salah seorang dari kalian bermimpi sesuatu yang tidak ia sukai, hendaknya ia tidak menceritakannya dan hendaknya ia berdiri lalu mengerjakan shalat.\""
        },
        {
            "number": 2051,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ كَثِيرٍ عَنْ مَخْلَدِ بْنِ حُسَيْنٍ عَنْ هِشَامٍ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اقْتَرَبَ الزَّمَانُ لَمْ تَكَدْ رُؤْيَا الْمُؤْمِنِ تَكْذِبُ وَأَصْدَقُهُمْ رُؤْيَا أَصْدَقُهُمْ حَدِيثًا",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Katsir] dari [Makhlad bin Husain] dari [Hisyam] dari [Ibnu Sirin] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila zaman telah mendekati (hari Kiamat), nyaris mimpi seorang mukmin tidak (disertai) dengan kebohongan, maka orang yang paling benar mimpinya adalah orang yang paling jujur pembicaraannya.\""
        },
        {
            "number": 2052,
            "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا إِسْرَائِيلُ عَنْ عَبْدِ الْأَعْلَى عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَنْ عَلِيٍّ يَرْفَعُ الْحَدِيثَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَذَبَ فِي حُلْمِهِ كُلِّفَ عَقْدَ شَعِيرَتَيْنِ يَوْمَ الْقِيَامَةِ",
            "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Isra`il] dari [Abdul A'la] dari [Abu Abdurrahman] dari [Ali] -yang dirafa'kan sampai kepada Nabi shallallahu 'alaihi wasallam- dia berkata: \"Barangsiapa berbohong dengan mimpinya, maka pada hari Kiamat akan dibebankan kepadanya untuk menghitung biji gandum.\""
        },
        {
            "number": 2053,
            "arab": " أَخْبَرَنَا مَرْوَانُ بْنُ مُحَمَّدٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ دَرَّاجٍ أَبِي السَّمْحِ عَنْ أَبِي الْهَيْثَمِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصْدَقُ الرُّؤْيَا بِالْأَسْحَارِ",
            "id": "Telah mengabarkan kepada kami [Marwan bin Muhammad] telah menceritakan kepada kami [Abdullah bin Wahb] dari ['Amr bin Al Harits] dari [Darraj Abu As Samh] dari [Al Haitsam] dari [Abu Sa'id Al Khudri], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mimpi yang paling benar adalah pada waktu sahur.\""
        },
        {
            "number": 2054,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقُولُ لَا تَقُصُّوا الرُّؤْيَا إِلَّا عَلَى عَالِمٍ أَوْ نَاصِحٍ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Ibnu Sirin] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Janganlah kalian menceritakan mimpi kecuali kepada orang yang berilmui atau orang yang dapat memberikan nasehat.\""
        },
        {
            "number": 2055,
            "arab": " أَخْبَرَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا شُعْبَةُ عَنْ يَعْلَى بْنِ عَطَاءٍ قَالَ سَمِعْتُ وَكِيعَ بْنَ عُدُسٍ يُحَدِّثُ عَنْ عَمِّهِ أَبِي رَزِينٍ الْعُقَيْلِيِّ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الرُّؤْيَا هِيَ عَلَى رِجْلِ طَائِرٍ مَا لَمْ يُحَدَّثْ بِهَا فَإِذَا حُدِّثَ بِهَا وَقَعَتْ",
            "id": "Telah mengabarkan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami [Syu'bah] dari [Ya'la bin 'Atha`] ia berkata; aku mendengar [Waki' bin 'Udus] menceritakan dari pamannya yaitu [Abu Razin Al 'Uqaili] bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mimpi tidak tetap keputusannya selama belum diceritakan, apabila telah diceritakan maka akan terjadi.\""
        },
        {
            "number": 2056,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُبَارَكِ حَدَّثَنِي الْوَلِيدُ حَدَّثَنِي ابْنُ جَابِرٍ عَنْ خَالِدِ بْنِ اللَّجْلَاجِ وَسَأَلَهُ مَكْحُولٌ أَنْ يُحَدِّثَهُ قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ عَائِشٍ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ رَأَيْتُ رَبِّي فِي أَحْسَنِ صُورَةٍ قَالَ فِيمَ يَخْتَصِمُ الْمَلَأُ الْأَعْلَى فَقُلْتُ أَنْتَ أَعْلَمُ يَا رَبِّ قَالَ فَوَضَعَ كَفَّهُ بَيْنَ كَتِفَيَّ فَوَجَدْتُ بَرْدَهَا بَيْنَ ثَدْيَيَّ فَعَلِمْتُ مَا فِي السَّمَوَاتِ وَالْأَرْضِ وَتَلَا { وَكَذَلِكَ نُرِي إِبْرَاهِيمَ مَلَكُوتَ السَّمَوَاتِ وَالْأَرْضِ وَلِيَكُونَ مِنْ الْمُوقِنِينَ }",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mubarak] telah menceritakan kepadaku [Al Walid bin Jabir] dari [Khalid bin Al Lajlaj] dan Makhul telah memintanya agar menceritakan kepadanya, ia berkata; \"Aku mendengar [Abdurrahman bin 'Aisy] berkata; aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku bermimpi melihat Tuhanku dalam bentuk yang sebaik-baiknya. Dia berfirman: \"Dalam masalah apakah para Malaikat berselisih?\" Lalu aku katakan: \"Engkau lebih mengetahui wahai Tuhanku.\" Beliau bersabda: \"Kemudian Dia meletakkan telapak tanganNya diantara kedua pundakku sehingga aku merasakan dingin tanganNya diantara kedua dadaku. Lalu aku mengetahui apa yang ada di langit dan bumi.\" Lalu beliau membaca ayat Dan demikianlah Kami perlihatkan kepada Ibrahim tanda-tanda keagungan (Kami yang terdapat) di langit dan bumi dan (Kami memperlihatkannya) agar dia termasuk orang yang yakin.\" QS Al An'am; 75."
        },
        {
            "number": 2057,
            "arab": " أَخْبَرَنَا نُعَيْمُ بْنُ حَمَّادٍ عَنْ عَبْدِ الْحَمِيدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ قُطْبَةَ عَنْ يُوسُفَ عَنْ ابْنِ سِيرِينَ قَالَ مَنْ رَأَى رَبَّهُ فِي الْمَنَامِ دَخَلَ الْجَنَّةَ",
            "id": "Telah mengabarkan kepada kami [Nu'aim bin Hammad] dari [Abdul Hamid bin Abdurrahman] dari [Quthbah] dari [Yusuf] dari [Ibnu Sirin] ia berkata; \"Barangsiapa bermimpi (bertemu) Rabbnya ketika tidur, maka ia akan masuk Surga.\""
        },
        {
            "number": 2058,
            "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنَا إِبْرَاهِيمُ هُوَ ابْنُ سَعْدٍ عَنْ صَالِحِ بْنِ كَيْسَانَ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بَيْنَا إِذَا أَنَا نَائِمٌ رَأَيْتُ النَّاسَ يُعْرَضُونَ عَلَيَّ وَعَلَيْهِمْ قُمُصٌ مِنْهَا مَا يَبْلُغُ الثُّدِيَّ وَمِنْهَا مَا يَبْلُغُ دُونَ ذَلِكَ وَعُرِضَ عَلَيَّ عُمَرُ بْنُ الْخَطَّابِ وَعَلَيْهِ قَمِيصٌ يَجُرُّهُ فَقَالَ مَنْ حَوْلَهُ فَمَاذَا تَأَوَّلْتَ ذَلِكَ يَا رَسُولَ اللَّهِ قَالَ الدِّينَ",
            "id": "Telah mengabarkan kepada kami [Abdullah bin Shalih] telah menceritakan kepada kami [Ibrahim yaitu Ibnu Sa'd] dari [Shalih bin Kaisan] dari [Ibnu Syihab] dari [Abu Umamah bin Sahl bin Hunaif] dari [Abu Sa'id Al Khudri] bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketika aku sedang tidur, aku melihat orang-orang diperlihakan kepadaku, mereka memakai jubah, diantaranya ada yang sampai ke dadanya, dan diantaranya ada yang sampai kurang dari itu, dan tidak lama kemudian ditampakkan kepadaku Umar bin Al Khathab sambil mengenakan jubah yang ia seret.\" Para sahabat yang ada disekitar beliau bertanya; \"Wahai Rasulullah, menurut anda bagaimana tafsir mimpi itu? Beliau menjawab: \"Itu tentang masalah Agama.\""
        },
        {
            "number": 2059,
            "arab": " أَخْبَرَنَا أَبُو عَلِيٍّ الْحَنَفِيُّ حَدَّثَنَا عَبْدُ اللَّهِ هُوَ ابْنُ عُمَرَ عَنْ نَافِعٍ أَنَّ ابْنَ عُمَرَ قَالَ كُنْتُ فِي عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا لِي مَبِيتٌ إِلَّا فِي مَسْجِدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَصْبَحَ يَأْتُونَهُ فَيَقُصُّونَ عَلَيْهِ الرُّؤْيَا قَالَ فَقُلْتُ مَا لِي لَا أَرَى شَيْئًا فَرَأَيْتُ كَأَنَّ النَّاسَ يُحْشَرُونَ فَيُرْمَى بِهِمْ عَلَى أَرْجُلِهِمْ فِي رَكِيٍّ فَأُخِذْتُ فَلَمَّا دَنَا إِلَى الْبِئْرِ قَالَ رَجُلٌ خُذُوا بِهِ ذَاتَ الْيَمِينِ فَلَمَّا اسْتَيْقَظْتُ هَمَّتْنِي رُؤْيَايَ وَأَشْفَقْتُ مِنْهَا فَسَأَلْتُ حَفْصَةَ عَنْهَا فَقَالَتْ نِعْمَ مَا رَأَيْتَ فَقُلْتُ لَهَا سَلِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَتْهُ فَقَالَ نِعْمَ الرَّجُلُ عَبْدُ اللَّهِ لَوْ كَانَ يُصَلِّي مِنْ اللَّيْلِ حَدَّثَنَا مُوسَى بْنُ خَالِدٍ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ الْفَزَارِيِّ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ بِهَذَا الْحَدِيثِ قَالَ ابْنُ عُمَرَ وَكُنْتُ إِذَا نِمْتُ لَمْ أَقُمْ حَتَّى أُصْبِحَ قَالَ نَافِعٌ وَكَانَ ابْنُ عُمَرَ يُصَلِّي اللَّيْلَ",
            "id": "Telah mengabarkan kepada kami [Abu Ali Al Hanafi] telah menceritakan kepada kami [Abdullah yaitu Ibnu Umar] dari [Nafi'] bahwa [Ibnu Umar] berkata; Pada zaman Nabi shallallahu 'alaihi wasallam, aku tidak memiliki tempat bermalam kecuali di Masjid Nabi shallallahu 'alaihi wasallam. Pada pagi harinya Nabi shallallahu 'alaihi wasallam biasa didatangi orang-orang yang menceritakan berbagai mimpi kepada beliau. Lalu aku katakan; \"Kenapa aku tidak bermimpi sesuatu?\", Setelah itu aku bermimpi, seakan-akan manusia dikumpulkan, kemudian mereka dilemparkan dengan kaki terjungkir di sebuah sumur, kemudian aku ditangkap, tatkala hamper sampai kesebuah sumur, seorang laki-laki berkata; \"Tologn selamatkanlah ia ke sebelah kanan.\" setelah aku bangun, mimpiku itu membuatku resah dan khawatir. Kemudian kulaporkan mimpiku kepada Hafshah. Hafshah berkata; \"Alangkah indah mimpimu.\" Aku berkata kepadanya; \"Tolong tanyakan mimpiku kepada Nabi shallallahu 'alaihi wasallam.\" Setelah itu Hafshah bertanya kepada beliau, dan beliau bersabda: \"Sebaik-baik lelaki adalah Abdullah, seandainya ia sering melakukan shalat malam.\" Telah menceritakan kepada kami [Musa bin Khalid] dari [Ibrahim bin Muhammad Al Fazari] dari ['Ubaidullah dari [Nafi'] dari [Ibnu Umar] dengan hadits ini. Ibnu Umar mengatakan; \"Dan apabila aku tidur, aku tidak bengun hingga pagi hari.\" Nafi' berkata; \"Dan Ibnu Umar sering melakukan shalat malam.\""
        },
        {
            "number": 2060,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ الصَّلْتِ حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ عَنْ حَمْزَةَ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ ابْنِ عُمَرَ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بَيْنَا أَنَا نَائِمٌ إِذْ أُتِيتُ بِقَدَحٍ مِنْ لَبَنٍ فَشَرِبْتُ مِنْهُ حَتَّى إِنِّي لَأَرَى الرِّيَّ فِي ظُفْرِي أَوْ قَالَ فِي أَظْفَارِي ثُمَّ نَاوَلْتُ فَضْلَهُ عُمَرَ فَقَالُوا يَا رَسُولَ اللَّهِ مَا أَوَّلْتَهُ قَالَ الْعِلْمَ",
            "id": "Telah mengabarkan kepada kami [Muhammad Ash Shalt] telah menceritakan kepada kami [Ibnu Mubarak] dari [Yunus] dari [Az Zuhri] dari [Hamzah bin Abdullah bin Umar] dari [Ibnu Umar], ia berkata; aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Ketika aku tidur, tiba-tiba aku diberi segelas susu, kemudian aku meminum sebagian darinya hingga aku merasa puas sampai ke dalam kukuku -atau beliau berkata- dalam kuku-kukuku, kemudian aku berikan sisanya kepada Umar.\" Para sahabat bertanya; \"Wahai Rasulullah, apa yang anda tafsirkan?\" Beliau bersabda: \"Ilmu.\""
        },
        {
            "number": 2061,
            "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ أَخْبَرَنَا الْوَلِيدُ حَدَّثَنَا ابْنُ جَابِرٍ حَدَّثَنِي مُحَمَّدُ بْنُ قَيْسٍ حَدَّثَنِي بَعْضُ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اللَّبَنُ الْفِطْرَةُ وَالسَّفِينَةُ نَجَاةٌ وَالْجَمَلُ حُزْنٌ وَالْخُضْرَةُ الْجَنَّةُ وَالْمَرْأَةُ خَيْرٌ",
            "id": "Telah mengabarkan kepadaku [Al Hakam bin Al Mubarak] telah mengabarkan kepada kami [Al Walid] telah menceritakan kepada kami [Ibnu Jabir] telah menceritakan kepadaku [Muhammad bin Qais] telah menceritakan kepadaku [sebagian para sahabat] Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Susu adalah fitrah, perahu adalah keberhasilan, unta adalah kesedihan dan warna hijau adalah surga serta wanita adalah kebaikan.\""
        },
        {
            "number": 2062,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ كَثِيرٍ حَدَّثَنَا سُلَيْمَانُ هُوَ ابْنُ كَثِيرٍ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ مِمَّا يَقُولُ لِأَصْحَابِهِ مَنْ رَأَى مِنْكُمْ رُؤْيَا فَلْيَقُصَّهَا عَلَيَّ فَأَعْبُرَهَا لَهُ قَالَ فَجَاءَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ رَأَيْتُ ظُلَّةً بَيْنَ السَّمَاءِ وَالْأَرْضِ تَنْطِفُ عَسَلًا وَسَمْنًا وَرَأَيْتُ أُنَاسًا يَتَكَفَّفُونَ مِنْهَا فَمُسْتَكْثِرٌ وَمُسْتَقِلٌّ وَرَأَيْتُ سَبَبًا وَاصِلًا مِنْ السَّمَاءِ إِلَى الْأَرْضِ فَأَخَذْتَ بِهِ فَعَلَوْتَ فَأَعْلَاكَ اللَّهُ ثُمَّ أَخَذَ بِهِ الَّذِي بَعْدَكَ فَعَلَا فَأَعْلَاهُ اللَّهُ ثُمَّ أَخَذَهُ الَّذِي بَعْدَهُ فَعَلَا فَأَعْلَاهُ اللَّهُ ثُمَّ أَخَذَهُ الَّذِي بَعْدَهُ فَقُطِعَ بِهِ ثُمَّ وُصِلَ فَاتَّصَلَ فَقَالَ أَبُو بَكْرٍ يَا رَسُولَ اللَّهِ ائْذَنْ لِي فَأَعْبُرَهَا فَقَالَ اعْبُرْهَا وَكَانَ أَعْبَرَ النَّاسِ لِلرُّؤْيَا بَعْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَمَّا الظُّلَّةُ فَالْإِسْلَامُ وَأَمَّا الْعَسَلُ وَالسَّمْنُ فَالْقُرْآنُ حَلَاوَةُ الْعَسَلِ وَلِينُ السَّمْنِ وَأَمَّا الَّذِينَ يَتَكَفَّفُونَ مِنْهُ فَمُسْتَكْثِرٌ وَمُسْتَقِلٌّ فَهُمْ حَمَلَةُ الْقُرْآنِ فَقَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصَبْتَ وَأَخْطَأْتَ فَقَالَ فَمَا الَّذِي أَصَبْتُ وَمَا الَّذِي أَخْطَأْتُ فَأَبَى أَنْ يُخْبِرَهُ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Katsir] telah menceritakan kepada kami [Sulaiman yaitu Ibnu Katsir] dari [Az Zuhri] dari ['Ubaidullah bin Abdullah] dari [Ibnu Abbas] bahwa diantara yang disampaikan Rasulullah shallallahu 'alaihi wasallam kepada para sahabatnya adalah: \"Barangsiapa diantara kalian bermimpi, hendaknya ia menceritakannya kepadaku, hingga aku menafsirkan untuk dirinya.\" Kemudian seorang laki-laki datang dan berkata; \"Wahai Rasulullah, aku bermimpi melihat awan diantara langit dan bumi, awan tersebut meneteskan madu dan mentega. Dan aku melihat beberapa orang mengambil dengan telapak tangannya. Diantara mereka ada yang mengambil banyak dan ada yang mengambil sedikit. Dan aku melihat dari langit sampai ke bumi, kemudian engkau mengambilnya lalu engkau naik ke atas, dan Allah meninggikanmu, setelah itu orang setelahmu mengambilnya, lalu ia naik dan Allah pun meninggikannya, kemudian diambil orang setelahnya lalu ia naik dan Allah meninggikannya, kemudian diambil orang setelahnya lalu diputus, kemudian disambung sehingga tersambung.\" Abu Bakr berkata; \"Wahai Rasulullah, izinkan saya menafsirkannya.\" Beliau bersabda: \"Tafsirkan mimpi terssebut.\" -Abu Bakar adalah sosok yang pandai menafsirkan mimpi setelah Rasulullah shallallahu 'alaihi wasallam- ia berkata; \"Adapun awan tersebut adalah Islam, madu dan mentega adalah Al Qur'an, semanis madu dan selembut mentega. Sedangkan orang-orang yang mengambil dengan telapak tangannya kemudian ada yang mengambil banyak dan ada yang mengambil sedikit, mereka adalah para pembawa Al Qur'an.\" Setelah itu Rasulullah shallallahu 'alaihi wasallam bersabda; \"Engkau benar dan engkau salah.\" Lalu Abu Bakar berkata; \"Apa yang aku tafsirkan dengan benar dan apa yang aku tafsirkan dengan salah?\" Namun Rasulullah shallallahu 'alaihi wasallam enggan memberitahukannya."
        },
        {
            "number": 2063,
            "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مِهْرَانَ حَدَّثَنَا مِسْكِينٌ الْحَرَّانِيُّ عَنْ جَعْفَرِ بْنِ بُرْقَانَ عَنْ يَزِيدَ بْنِ الْأَصَمِّ عَنْ الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ فَقَالَ رَأَيْتُ فِي الْمَنَامِ كَأَنَّ شَمْسًا أَوْ قَمَرًا شَكَّ أَبُو جَعْفَرٍ فِي الْأَرْضِ تُرْفَعُ إِلَى السَّمَاءِ بِأَشْطَانٍ شِدَادٍ فَذَكَرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ ذَاكَ ابْنُ أَخِيكَ يَعْنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَفْسَهُ",
            "id": "Telah mengabarkan kepada kami Muhammad bin Mahran telah menceritakan kepada kami Miskin Al Harrani dari Ja'far bin Burqan dari Yazid bin Al 'Asham dari Al 'Abbas bin Abdul Muththalib, dia berkata; \"Aku bermimpi katika tidur, seolah-olah matahari atau rembulan -Abu Ja'far ragu dalam redaksi haditsnya- berada di Bumi diangkat ke langit dengan tali yang kuat.\" Setelah itu ia memberitahukan hal itu kepada Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Itu adalah anak saudaramu.\" Maksudnya adalah Rasulullah shallallahu 'alaihi wasallam sendiri."
        },
        {
            "number": 2064,
            "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ بَرِيدَ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رَأَيْتُ فِي رُؤْيَايَ هَذِهِ أَنِّي هَزَزْتُ سَيْفًا فَانْقَطَعَ صَدْرُهُ فَإِذَا هُوَ مَا أُصِيبَ مِنْ الْمُؤْمِنِينَ يَوْمَ أُحُدٍ ثُمَّ هَزَزْتُهُ أُخْرَى فَعَادَ كَأَحْسَنِ مَا كَانَ فَإِذَا هُوَ مَا جَاءَ اللَّهُ بِهِ مِنْ الْفَتْحِ وَاجْتِمَاعِ الْمُؤْمِنِينَ وَرَأَيْتُ فِيهَا أَيْضًا بَقَرًا وَاللَّهِ خَيْرٌ فَإِذَا هُوَ النَّفَرُ مِنْ الْمُؤْمِنِينَ يَوْمَ أُحُدٍ وَإِذَا الْخَيْرُ مَا جَاءَ اللَّهُ بِهِ مِنْ الْخَيْرِ وَثَوَابِ الصِّدْقِ الَّذِي آتَانَا بَعْدَ يَوْمِ بَدْرٍ",
            "id": "Telah mengabarkan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami [Abu Usamah] dari [Barid] dari [Abu Burdah] dari [Abu Musa] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Aku melihat dalam mimpiku ini, bahwa aku mengayun-ayunkan pedang, hingga patah pada bagian pangkalnya, yang ternyata itu merupakan isyarat tentang apa yang menimpa Kaum Mu'minin pada perang Uhud, lalu aku mengayun-ayunkan kembali pedang tersebut hingga pedang itu kembali menjadi utuh seperti sedia kala, ternyata itu berarti apa yang Allah akan datangkan berupa kemenangan dan bersatunya Kaum Mu'minin dan aku melihat pula dalam mimpiku seekor sapi, yang demi Allah sangat bagus bentuknya, ternyata itu berarti Kaum Mu'minin pada perang Uhud yang akan mendapatkan kebaikan seperti yang Allah datangkan dari kebaikan dan pahala, sebagai janji yang benar yang telah Allah berikan kepada kita pada perang Badar.\""
        },
        {
            "number": 2065,
            "arab": " أَخْبَرَنَا الْحَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رَأَيْتُ كَأَنِّي فِي دِرْعٍ حَصِينَةٍ وَرَأَيْتُ بَقَرًا يُنْحَرُ فَأَوَّلْتُ أَنَّ الدِّرْعَ الْمَدِينَةُ وَأَنَّ الْبَقَرَ نَفَرٌ وَاللَّهِ خَيْرٌ وَلَوْ أَقَمْنَا بِالْمَدِينَةِ فَإِذَا دَخَلُوا عَلَيْنَا قَاتَلْنَاهُمْ فَقَالُوا وَاللَّهِ مَا دُخِلَتْ عَلَيْنَا فِي الْجَاهِلِيَّةِ أَفَتُدْخَلُ عَلَيْنَا فِي الْإِسْلَامِ قَالَ فَشَأْنَكُمْ إِذًا وَقَالَتْ الْأَنْصَارُ لِبَعْضٍ رَدَدْنَا عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأْيَهُ فَجَاءُوا فَقَالُوا يَا رَسُولَ اللَّهِ شَأْنُكَ فَقَالَ الْآنَ إِنَّهُ لَيْسَ لِنَبِيٍّ إِذَا لَبِسَ لَأْمَتَهُ أَنْ يَضَعَهُ حَتَّى يُقَاتِلَ",
            "id": "Telah mengabarkan kepada kami [Al Hajjaj bin Minhal] telah menceritakan kepada kami [Hammad bin Salamah] telah menceritakan kepada kami [Abu Az Zubair] dari [Jabir] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku bermimpi seakan saya memakai baju besi yang kuat dan aku juga bermimpi melihat seekor sapi yang disembelih, aku artikan baju besi yang kuat adalah Madinah, sedang makna sapi, demi Allah itu adalah sebuah kebaikan, jika saja kita bermukim di Madinah, lalu mereka (menyerang) kita disana, niscaya kita akan memerangi mereka.\" Para sahabat berkata; \"Wahai Rasulullah, demi Allah kami belum pernah diserang di kota Madinah semasa Jahiliyyah, bagaimana bisa kita diserang pada masa Islam?\" Beliau bersabda: \"Terserah kalian, kalau begitu.\" Lalu orang-orang Anshar berkata; \"Kami telah menolak pendapat Nabi shallallahu'alaihi wasallam', \" Akhirnya mereka datang dan berkata; \"Wahai Rasulullah, kalau begitu terserah anda.\" Beliau bersabda: \"Tidak layak bagi seorang Nabi jika telah memakai baju besi, lalu melepasnya kembali sampai ia berperang.\""
        },
        {
            "number": 2066,
            "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرَّقَاشِيُّ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقُولُ أَكْرَهُ الْغُلَّ وَأُحِبُّ الْقَيْدَ الْقَيْدُ ثَبَاتٌ فِي الدِّينِ",
            "id": "Telah mengabarkan kepada kami Muhammad bin Abdullah Ar Raqasyi telah menceritakan kepada kami Yazid bin Zurai' telah menceritakan kepada kami Sa'id dari Qatadah dari Muhammad bin Sirin dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Aku tidak menyukai belenggu dan menyukai dengan ikatan, sebab ikatan adalah ketetapan dalam agama.\""
        },
        {
            "number": 2067,
            "arab": " أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْهَاشِمِيُّ حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ رَأَيْتُ فِي الْمَنَامِ امْرَأَةً سَوْدَاءَ ثَائِرَةَ الشَّعْرِ تَفِلَةً أُخْرِجَتْ مِنْ الْمَدِينَةِ فَأُسْكِنَتْ مَهْيَعَةَ فَأَوَّلْتُهَا وَبَاءَ الْمَدِينَةِ يَنْقُلُهَا اللَّهُ إِلَى مَهْيَعَةَ",
            "id": "Telah mengabarkan kepadaku [Sulaiman bin Daud Al Hasyimi] telah menceritakan kepada kami [Ibnu Abu Az Zinad] dari [Musa bin 'Uqbah] dari [Salim bin Abdullah] dari [Ayahnya] ia berkata; aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku bermimpi melihat seorang wanita hitam yang berambut acak-acakan tanpa memakai minyak wangi, ia dikeluarkan dari Madinah dan ditempatkan di Mahya'ah (yaitu Juhfah). Maka aku menafsirkannya suatu penyakit yang ada di Madinah, lalu Allah pindahkan ke Mahya'ah.\""
        },
        {
            "number": 2068,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا يَحْيَى بْنُ عَبْدِ الرَّحْمَنِ حَدَّثَنَا عَبِيدَةُ بْنُ الْأَسْوَدِ عَنْ مُجَالِدٍ عَنْ عَامِرٍ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ يَوْمًا مِنْ الْأَيَّامِ إِنِّي رَأَيْتُ فِي الْمَنَامِ أَنَّ رَجُلًا أَتَانِي بِكُتْلَةٍ مِنْ تَمْرٍ فَأَكَلْتُهَا فَوَجَدْتُ فِيهَا نَوَاةً فَآذَتْنِي حِينَ مَضَغْتُهَا ثُمَّ أَعْطَانِي كُتْلَةً أُخْرَى فَقُلْتُ إِنَّ الَّذِي أَعْطَيْتَنِي وَجَدْتُ فِيهَا نَوَاةً آذَتْنِي فَأَكَلْتُهَا فَقَالَ أَبُو بَكْرٍ نَامَتْ عَيْنُكَ يَا رَسُولَ اللَّهِ هَذِهِ السَّرِيَّةُ الَّتِي بَعَثْتَ بِهَا غَنِمُوا مَرَّتَيْنِ كِلْتَاهُمَا وَجَدُوا رَجُلًا يَنْشُدُ ذِمَّتَكَ فَقُلْتُ لِمُجَالِدٍ مَا يَنْشُدُ ذِمَّتَكَ قَالَ يَقُولُ لَا إِلَهَ إِلَّا اللَّهُ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Al 'Ala`] telah menceritakan kepada kami [Yahya bin Abdurrahman] telah menceritakan kepada kami ['Ubaidah bin Al Aswad] dari [Mujalid] dari ['Amir] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam, bahwa suatu hari beliau bersabda: \"Aku bermimpi bahwa seorang laki-laki datang kepadaku dengan membawa sepotong kurma, kemudian aku memakannya lalu mendapatkan biji, laki-laki itu menggangguku ketika aku mengunyahnya. Kemudian ia memberiku sepotong yang lain, lalu aku katakan; \"Sesungguhnya yang engkau berikan kepadaku, telah aku dapatkan padanya biji yang menggangguku, lalu aku memakannya.\" Abu Bakr berkata; \"Semoga anda mendapatkan kelapangan dan kesejahteraan wahai Rasulullah, ini adalah pasukan yang engkau kirim memperoleh rampasan perang dua kali, keduanya mereka dapati seorang laki-laki yang meminta perlindunganmu.\" Kemudian aku katakan kepada Mujahid; \"Apakah maksud meminta perlindunganmu?\" Ia berkata; \"Mengucapkan LAA ILAAHA ILLALLAAH (tidak ada ilah yang berhak disembah selain Allah).\""
        },
        {
            "number": 2069,
            "arab": " أَخْبَرَنَا عُبَيْدُ بْنُ يَعِيشَ حَدَّثَنَا يُونُسُ هُوَ ابْنُ بُكَيْرٍ أَخْبَرَنَا ابْنُ إِسْحَقَ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ كَانَتْ امْرَأَةٌ مِنْ أَهْلِ الْمَدِينَةِ لَهَا زَوْجٌ تَاجِرٌ يَخْتَلِفُ فَكَانَتْ تَرَى رُؤْيَا كُلَّمَا غَابَ عَنْهَا زَوْجُهَا وَقَلَّمَا يَغِيبُ إِلَّا تَرَكَهَا حَامِلًا فَتَأْتِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَقُولُ إِنَّ زَوْجِي خَرَجَ تَاجِرًا فَتَرَكَنِي حَامِلًا فَرَأَيْتُ فِيمَا يَرَى النَّائِمُ أَنَّ سَارِيَةَ بَيْتِي انْكَسَرَتْ وَأَنِّي وَلَدْتُ غُلَامًا أَعْوَرَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرٌ يَرْجِعُ زَوْجُكِ عَلَيْكِ إِنْ شَاءَ اللَّهُ تَعَالَى صَالِحًا وَتَلِدِينَ غُلَامًا بَرًّا فَكَانَتْ تَرَاهَا مَرَّتَيْنِ أَوْ ثَلَاثًا كُلُّ ذَلِكَ تَأْتِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَقُولُ ذَلِكَ لَهَا فَيَرْجِعُ زَوْجُهَا وَتَلِدُ غُلَامًا فَجَاءَتْ يَوْمًا كَمَا كَانَتْ تَأْتِيهِ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَائِبٌ وَقَدْ رَأَتْ تِلْكَ الرُّؤْيَا فَقُلْتُ لَهَا عَمَّ تَسْأَلِينَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أَمَةَ اللَّهِ فَقَالَتْ رُؤْيَا كُنْتُ أُرَاهَا فَآتِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَسْأَلُهُ عَنْهَا فَيَقُولُ خَيْرًا فَيَكُونُ كَمَا قَالَ فَقُلْتُ فَأَخْبِرِينِي مَا هِيَ قَالَتْ حَتَّى يَأْتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَعْرِضَهَا عَلَيْهِ كَمَا كُنْتُ أَعْرِضُ فَوَاللَّهِ مَا تَرَكْتُهَا حَتَّى أَخْبَرَتْنِي فَقُلْتُ وَاللَّهِ لَئِنْ صَدَقَتْ رُؤْيَاكِ لَيَمُوتَنَّ زَوْجُكِ وَتَلِدِينَ غُلَامًا فَاجِرًا فَقَعَدَتْ تَبْكِي وَقَالَتْ مَا لِي حِينَ عَرَضْتُ عَلَيْكِ رُؤْيَايَ فَدَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ تَبْكِي فَقَالَ لَهَا مَا لَهَا يَا عَائِشَةُ فَأَخْبَرْتُهُ الْخَبَرَ وَمَا تَأَوَّلْتُ لَهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَهْ يَا عَائِشَةُ إِذَا عَبَرْتُمْ لِلْمُسْلِمِ الرُّؤْيَا فَاعْبُرُوهَا عَلَى الْخَيْرِ فَإِنَّ الرُّؤْيَا تَكُونُ عَلَى مَا يَعْبُرُهَا صَاحِبُهَا فَمَاتَ وَاللَّهِ زَوْجُهَا وَلَا أُرَاهَا إِلَّا وَلَدَتْ غُلَامًا فَاجِرًا",
            "id": "Telah mengabarkan kepada kami ['Ubaid bin Ya'isy], telah menceritakan kepada kami [Yunus yaitu Ibnu Bukair], telah mengabarkan kepada kami [Ibnu Ishaq] dari [Muhammad bin 'Amr bin 'Atha`] dari [Sulaiman bin Yasar] dari ['Aisyah] isteri Nabi shallallahu 'alaihi wasallam, ia berkata; \"Seorang wanita dari penduduk Madinah memiliki suami seorang pedagang. Wanita itu juga pernah bermimpi. Setiap kali suaminya pergi, suaminya tidak pernah meninggalkannya kecuali dalam keadaan hamil. Kemudian wanita itu datang kepada Rasulullah shallallahu 'alaihi wasallam dan berkata; \"Sesungguhnya suamiku keluar berdagang dan meninggalkanku dalam keadaan hamil, kemudian aku bermimpi seperti orang tidur yang bermimpi, bahwa tiang rumahku patah dan saya melahirkan anak yang buta.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Itu adalah kebaikan, suamimu akan kembali kepadamu dengan izin Allah ta'ala dalam keadaan baik, dan engkau akan melahirkan anak yang berbakti.\" Wanita tersebut bermimpi hingga dua atau tiga kali, setiap ia bermimpi, ia langsung datang menemui Rasulullah shallallahu 'alaihi wasallam, beliau pun mengatakan hal yang sama kepada wanita itu. Setelah itu suaminya kembali dan wanita itu melahirkan anak laki-laki, Suatu hari wanita itu datang sebagaimana dahulu ia datang, sementara Rasulullah shallallahu 'alaihi wasallam tidak berada di tempat. Sementara dirinya telah mengalami mimpi itu, kemudian aku katakan kepadanya; \"Apa yang pernah engkau tanyakan kepada Rasulullah shallallahu 'alaihi wasallam wahai hamba Allah?\" Wanita itu menjawab; \"Mimpi yang diperlihatkan kepadaku, kemudian aku datang kepada Rasulullah shallallahu 'alaihi wasallam dan bertanya kepada beliau mengenai mimpi tersebut, beliau bersabda: \"Baik.\" Ternyata mimpi itu telah terjadi seperti yang telah beliau ucapkan.\" Aku bertanya; \"Beritahukan kepadaku apa mimpi itu?\" Wanita itu menjawab; \"Nanti setelah Rasulullah shallallahu 'alaihi wasallam datang, hingga aku dapat menyampaikannya kepada beliau sebagaimana dahulu pernah aku sampaikan.\" Demi Allah aku masih tetap menungguinya hingga ia memberitahukan kepadaku. Lalu aku katakan; \"Demi Allah, seandainya mimpimu itu benar niscaya suamimu akan meninggal dan engkau melahirkan anak yang durhaka.\" Lalu wanita tersebut duduk sambil menangis, dan berkata; \"Kenapa aku mendapatkan hal ini ketika menyampaikan mimpiku kepadamu?\" Kemudian Rasulullah shallallahu 'alaihi wasallam masuk, sementara wanita itu masih saja menangis. Beliau bertanya: \"Ada apa dengannya wahai Aisyah?\" Aku memberitahukan berita tersebut kepada beliau, dan apa yang aku tafsirkan kepadanya. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tahanlah perkataan itu wahai Aisyah! Apabila engkau menafsirkan (mimpi) seorang muslim untuk muslim lainnya, maka tafsirkanlah dengan kebaikan, karena sesungguhnya mimpi akan terjadi sesuai yang ditafsirkan orang yang menafsirkannya.\" Demi Allah, setelah itu suaminya meninggal dan tidaklah diperlihatkan kepadaku kecuali ia melahirkan anak yang durhaka.\""
        }
    ]
}