{
    "kategori": "Kitab Faro'idl",
    "hadits": [
        {
            "number": 2726,
            "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا عَاصِمٌ عَنْ مُوَرِّقٍ الْعِجْلِيِّ قَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِ تَعَلَّمُوا الْفَرَائِضَ وَاللَّحْنَ وَالسُّنَنَ كَمَا تَعَلَّمُونَ الْقُرْآنَ",
            "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami ['Ashim] dari [Muwarriq Al 'Ijli] ia berkata; [Umar bin Khaththab] berkata; Pelajarilah faraidl, bahasa Arab dan sunnah sebagaimana kalian mempelajari Al Qur`an."
        },
        {
            "number": 2727,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ قَالَ قَالَ عُمَرُ تَعَلَّمُوا الْفَرَائِضَ فَإِنَّهَا مِنْ دِينِكُمْ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Al A'masy] dari [Ibrahim] ia berkata; [Umar] berkata; Pelajarilah faraidl, karena faraidl itu bagian dari agama kalian."
        },
        {
            "number": 2728,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا يُوسُفُ الْمَاجِشُونُ قَالَ قَالَ ابْنُ شِهَابٍ لَوْ هَلَكَ عُثْمَانُ وَزَيْدٌ فِي بَعْضِ الزَّمَانِ لَهَلَكَ عِلْمُ الْفَرَائِضِ لَقَدْ أَتَى عَلَى النَّاسِ زَمَانٌ وَمَا يَعْلَمُهَا غَيْرُهُمَا",
            "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Yusuf Al Majisyun] ia berkata; [Ibnu Syihab] berkata; Seandainya Utsman dan Zaid meninggal di suatu masa, niscaya hilanglah ilmu faraidl. Sungguh telah datang masa di mana tidak ada yang mengetahuinya selain mereka berdua."
        },
        {
            "number": 2729,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا الْمَسْعُودِيُّ عَنْ الْقَاسِمِ قَالَ قَالَ عَبْدُ اللَّهِ تَعَلَّمُوا الْقُرْآنَ وَالْفَرَائِضَ فَإِنَّهُ يُوشِكُ أَنْ يَفْتَقِرَ الرَّجُلُ إِلَى عِلْمٍ كَانَ يَعْلَمُهُ أَوْ يَبْقَى فِي قَوْمٍ لَا يَعْلَمُونَ",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Al Mas'udi] dari [Al Qasim] ia berkata; [Abdullah] berkata; Pelajarilah Al Qur`an dan ilmu faraidl, karena seseorang akan membutuhkan ilmu yang telah ia pelajari, atau ia berada di suatu kaum yang tidak mengetahui."
        },
        {
            "number": 2730,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا زِيَادُ بْنُ أَبِي مُسْلِمٍ عَنْ أَبِي الْخَلِيلِ قَالَ قَالَ أَبُو مُوسَى مَنْ عَلِمَ الْقُرْآنَ وَلَمْ يَعْلَمْ الْفَرَائِضَ فَإِنَّ مَثَلَهُ مَثَلُ الْبُرْنُسِ لَا وَجْهَ لَهُ أَوْ لَيْسَ لَهُ وَجْهٌ",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Ziyad bin Abu Muslim] dari [Abu Al Khalil] ia berkata; [Abu Musa] berkata; Barangsiapa mempelajari Al Qur`an namun tidak mengetahui ilmu faraidl, maka perumpamaannya seperti burnus yang tidak ada wajah padanya atau tidak memiliki wajah. "
        },
        {
            "number": 2731,
            "arab": " حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَبُو شِهَابٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ قَالَ قُلْتُ لِعَلْقَمَةَ مَا أَدْرِي مَا أَسْأَلُكَ عَنْهُ قَالَ أَمِتْ جِيرَانَكَ",
            "id": "Telah menceritakan kepada kami [Ahmad bin Abdullah] telah menceritakan kepada kami [Abu Syihab] dari [Al A'masy] dari [Ibrahim] ia berkata; Aku bertanya kepada ['Alqamah]; Aku tidak tahu apa yang harus aku tanyakan kepadamu? Ia mengatakan; Anggap tetanggamu telah meninggal dunia."
        },
        {
            "number": 2732,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا مُحَمَّدُ بْنُ طَلْحَةَ عَنْ الْقَاسِمِ بْنِ الْوَلِيدِ الْهَمْدَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ تَعَلَّمُوا الْفَرَائِضَ وَالطَّلَاقَ وَالْحَجَّ فَإِنَّهُ مِنْ دِينِكُمْ",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Muhammad bin Thalhah] dari [Al Qasim bin Al Walid Al Hamdani] dari [Abdullah bin Mas'ud] ia berkata; Pelajarilah (tentang masalah) faraidl, thalaq dan haji, sebab masalah-masalah tersebut adalah bagian dari agama kalian."
        },
        {
            "number": 2733,
            "arab": " حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ كَثِيرٍ عَنْ الْحَسَنِ قَالَ كَانُوا يُرَغِّبُونَ فِي تَعْلِيمِ الْقُرْآنِ وَالْفَرَائِضِ وَالْمَنَاسِكِ",
            "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Zaid] dari [Katsir] dari [Al Hasan] ia berkata; Mereka sangat menganjurkan untuk mempelajari Al Qur`an, faraidl dan manasik haji."
        },
        {
            "number": 2734,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي عُبَيْدَةَ عَنْ عَبْدِ اللَّهِ قَالَ مَنْ قَرَأَ الْقُرْآنَ فَلْيَتَعَلَّمْ الْفَرَائِضَ فَإِنْ لَقِيَهُ أَعْرَابِيٌّ قَالَ يَا مُهَاجِرُ أَتَقْرَأُ الْقُرْآنَ فَإِنْ قَالَ نَعَمْ قَالَ تَفْرِضُ فَإِنْ قَالَ نَعَمْ فَهُوَ زِيَادَةٌ وَخَيْرٌ وَإِنْ قَالَ لَا قَالَ فَمَا فَضْلُكَ عَلَيَّ يَا مُهَاجِرُ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Sufyan] dari [Abu Ishaq] dari [Abu Ubaidah] dari [Abdullah] ia berkata; Barangsiapa membaca Al Qur`an, hendaklah ia mempelajari faraidl. Karena, jika ia bertemu dengan seorang Arab desa (badui), ia akan bertanya; Wahai muhajir (pendatang), apakah engkau membaca Al Qur`an? Jika ia menjawab; Ya, ia akan bertanya; Engkau mengerti faraidl? Jika ia menjawab; Ya, maka itu merupakan kelebihan dan kebaikan. Jika ia menjawab; Tidak, ia akan berkata; Engkau tidak lebih utama dariku, wahai muhajir (pendatang)."
        },
        {
            "number": 2735,
            "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ عَنْ الْأَعْمَشِ عَنْ مُسْلِمٍ قَالَ سَأَلْنَا مَسْرُوقًا كَانَتْ عَائِشَةُ تُحْسِنُ الْفَرَائِضَ قَالَ وَالَّذِي لَا إِلَهَ غَيْرُهُ لَقَدْ رَأَيْتُ الْأَكَابِرَ مِنْ أَصْحَابِ مُحَمَّدٍ يَسْأَلُونَهَا عَنْ الْفَرَائِضِ",
            "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami [Uqbah bin Khalid] dari [Al A'masy] dari [Muslim] ia berkata; Kami bertanya kepada [Masruq]; Benarkah [Aisyah] ahli dalam faraidl? Ia menjawab; Demi Dzat yang tidak ada tuhan yang haq selain Dia, sungguh aku melihat para tokoh sahabat Muhammad bertanya kepadanya tentang faraidl."
        },
        {
            "number": 2736,
            "arab": " أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ شُعْبَةَ عَنْ عَاصِمٍ عَنْ أَبِي عُثْمَانَ عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ وَعَنْ أَبِي بَكْرَةَ قَالَ شُعْبَةُ هَذَا أَوَّلُ مَنْ رَمَى بِسَهْمٍ فِي سَبِيلِ اللَّهِ وَهَذَا تَدَلَّى مِنْ حِصْنِ الطَّائِفِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهُمَا حَدَّثَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ ادَّعَى إِلَى غَيْرِ أَبِيهِ وَهُوَ يَعْلَمُ أَنَّهُ غَيْرُ أَبِيهِ فَالْجَنَّةُ عَلَيْهِ حَرَامٌ",
            "id": "Telah mengabarkan kepada kami [Sa'id bin Amir] dari [Syu'bah] dari ['Ashim] dari [Abu Utsman] dari [Sa'd bin Abu Waqqash] dan dari [Abu Bakrah], Syu'bah berkata; Ini adalah orang pertama yang melepaskan anak panah fi sabilillah sedangkan yang ini adalah orang pertama yang turun dari benteng Tha`if untuk bergabung dengan Rasulullah shallallahu 'alaihi wasallam. Sesungguhnya mereka berdua menceritakan bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mengakui orang lain sebagai ayah kandungnya, padahal ia tahu bahwa orang itu bukan ayah kandungnya, maka surga haram atasnya.\""
        },
        {
            "number": 2737,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ عَنْ أَبِي مَعْمَرٍ عَنْ أَبِي بَكْرٍ الصِّدِّيقِ قَالَ كُفْرٌ بِاللَّهِ ادِّعَاءٌ إِلَى نَسَبٍ لَا يُعْرَفُ وَكُفْرٌ بِاللَّهِ تَبَرُّؤٌ مِنْ نَسَبٍ وَإِنْ دَقَّ حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ زَكَرِيَّا أَبِي يَحْيَى قَالَ سَمِعْتُ أَبَا وَائِلٍ يُحَدِّثُ عَنْ ابْنِ مَسْعُودٍ نَحْوًا مِنْهُ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Al A'masy] dari [Abdullah bin Murrah] dari [Abu Ma'mar] dari [Abu Bakr Ash Shiddiq] ia berkata; Termasuk perbuatan kufur kepada Allah adalah orang yang mengakui keturunan orang lain yang tidak dikenal dan berlepas diri dari nasabnya, sekali pun itu hal yang sepele. Telah menceritakan kepada kami [Muhammad bin Yusuf] dari [Zakariya Abu Yahya] ia berkata; aku mendengar [Abu Wa`il] menceritakan dari [Ibnu Mas'ud] seperti riwayat itu."
        },
        {
            "number": 2738,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ السَّلُولِيُّ عَنْ جَعْفَرٍ الْأَحْمَرِ عَنْ السَّرِيِّ بْنِ إِسْمَعِيلَ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ قَالَ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأُبَايِعَهُ فَجِئْتُ وَقَدْ قُبِضَ وَأَبُو بَكْرٍ قَائِمٌ فِي مَقَامِهِ فَأَطَابَ الثَّنَاءَ وَأَكْثَرَ الْبُكَاءَ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ كُفْرٌ بِاللَّهِ انْتِفَاءٌ مِنْ نَسَبٍ وَإِنْ دَقَّ وَادِّعَاءُ نَسَبٍ لَا يُعْرَفُ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala`] telah menceritakan kepada kami [Ishaq bin Manshur As Saluli] dari [Ja'far Al Ahmar] dari [As Sari bin Isma'il] dari [Qais bin Abu Hazim] ia berkata; Aku datang menemui Nabi shallallahu 'alaihi wasallam untuk melakukan janji setia (baiat) kepada beliau. Kemudian ketika aku datang lagi, beliau telah wafat dan [Abu Bakr] yang menggantikan kepemimpinan beliau. Ia mengucapkan puji-pujian begitu indah dan menangis begitu lama. Lalu ia berkata; Aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Termasuk perbuatan kufur kepada Allah adalah mengaku bukan keturunan seseorang (padahal sebenarnya ia anaknya), sekalipun itu hal yang remeh, dan mengakui keturunan orang lain yang tidak dikenal.\""
        },
        {
            "number": 2739,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ بَهْرَامَ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّمَا رَجُلٍ ادَّعَى إِلَى غَيْرِ وَالِدِهِ أَوْ تَوَلَّى غَيْرَ مَوَالِيهِ الَّذِينَ أَعْتَقُوهُ فَإِنَّ عَلَيْهِ لَعْنَةَ اللَّهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ إِلَى يَوْمِ الْقِيَامَةِ لَا يُقْبَلُ مِنْهُ صَرْفٌ وَلَا عَدْلٌ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Abdul Hamid bin Bahram] dari [Syahr bin Hausyab] dari [Ibnu Abbas] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa saja yang mengaku menisbatkan kepada selain ayahnya atau setia kepada orang lain selain tuan yang memerdekakannya, maka ia akan mendapat laknat Allah, malaikat, dan seluruh manusia hingga hari kiamat. Dan tidak akan diterima taubat dan fidyah (tebusan) nya.\" "
        },
        {
            "number": 2740,
            "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا شَرِيكٌ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ قَالَ قَالَ عَبْدُ اللَّهِ كَانَ عُمَرُ إِذَا سَلَكَ بِنَا طَرِيقًا وَجَدْنَاهُ سَهْلًا وَإِنَّهُ قَالَ فِي زَوْجٍ وَأَبَوَيْنِ لِلزَّوْجِ النِّصْفُ وَلِلْأُمِّ ثُلُثُ مَا بَقِيَ",
            "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Syarik] dari [Al A'masy] dari [Ibrahim] ia berkata; [Abdullah] berkata; Apabila Umar berjalan bersama kami di suatu jalan, kami akan mendapatkan kemudahan. [Beliau] berkata tentang masalah (bagian warisan) suami dan kedua orang tua; Suami mendapatkan setengah harta warisan dan ibu mendapatkan sepertiga dari yang tersisa."
        },
        {
            "number": 2741,
            "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا يَزِيدُ الرِّشْكُ قَالَ سَأَلْتُ سَعِيدَ بْنَ الْمُسَيَّبِ عَنْ رَجُلٍ تَرَكَ امْرَأَتَهُ وَأَبَوَيْهِ فَقَالَ قَسَّمَهَا زَيْدُ بْنُ ثَابِتٍ مِنْ أَرْبَعَةٍ",
            "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami [Yazid Ar Risyk] ia berkata; Aku bertanya kepada [Sa'id bin Al Musayyab] tentang seorang laki-laki yang (meninggal dunia dengan) meninggalkan isteri dan kedua orang tuanya. Lalu ia menjawab; [Zaid bin Tsabit] membaginya dari empat. "
        },
        {
            "number": 2742,
            "arab": " حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ شُعْبَةَ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمُهَلَّبِ أَنَّ عُثْمَانَ بْنَ عَفَّانَ قَالَ فِي امْرَأَةٍ وَأَبَوَيْنِ لِلْمَرْأَةِ الرُّبُعُ وَلِلْأُمِّ ثُلُثُ مَا بَقِيَ",
            "id": "Telah menceritakan kepada kami [Sa'id bin Amir] dari [Syu'bah] dari [Ayyub] dari [Abu Qilabah] dari [Abu Al Muhallab] bahwa [Utsman bin 'Affan] berkata tentang bagian seorang isteri dan kedua orang tua; Isteri mendapat seperempat dan ibu mendapat sepertiga dari harta yang tersisa."
        },
        {
            "number": 2743,
            "arab": " حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمُهَلَّبِ عَنْ عُثْمَانَ بْنِ عَفَّانَ أَنَّهُ قَالَ لِلْمَرْأَةِ الرُّبُعُ سَهْمٌ مِنْ أَرْبَعَةٍ وَلِلْأُمِّ ثُلُثُ مَا بَقِيَ سَهْمٌ وَلِلْأَبِ سَهْمَانِ أَخْبَرَنَا حَجَّاجٌ حَدَّثَنَا حَمَّادٌ عَنْ حَجَّاجٍ عَنْ عُمَيْرِ بْنِ سَعِيدٍ أَنَّهُ سَأَلَ الْحَارِثَ الْأَعْوَرَ عَنْ امْرَأَةٍ وَأَبَوَيْنِ فَقَالَ مِثْلَ قَوْلِ عُثْمَانَ",
            "id": "Telah menceritakan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Hammad bin Salamah] dari [Ayyub] dari [Abu Qilabah] dari [Abu Al Muhallab] dari [Utsman bin 'Affan] bahwa ia berkata; Seorang isteri mendapat seperempat bagian dari empat, ibu mendapat sepertiga bagian yang tersisa dan ayah mendapat dua bagian. Telah mengabarkan kepada kami [Hajjaj] telah menceritakan kepada kami [Hammad] dari [Hajjaj] dari [Umair bin [Sa'id] bahwa ia pernah bertanya kepada [Al Harits Al A'war] tentang seorang isteri dan kedua orang tua. Lalu ia menjawab seperti jawaban Utsman."
        },
        {
            "number": 2744,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ زَيْدِ بْنِ ثَابِتٍ أَنَّهُ قَالَ فِي امْرَأَةٍ تَرَكَتْ زَوْجَهَا وَأَبَوَيْهَا لِلزَّوْجِ النِّصْفُ وَلِلْأُمِّ ثُلُثُ مَا بَقِيَ",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Sa'id bin Al Musayyab] dari [Zaid bin Tsabit] bahwa ia berkata tentang seorang isteri yang meninggalkan suami dan kedua orang tuanya; Suami mendapat setengah bagian dan ibu mendapat sepertiga yang tersisa."
        },
        {
            "number": 2745,
            "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ ابْنِ أَبِي لَيْلَى عَنْ عَامِرٍ الشَّعْبِيِّ عَنْ عَلِيٍّ فِي امْرَأَةٍ وَأَبَوَيْنِ قَالَ مِنْ أَرْبَعَةٍ لِلْمَرْأَةِ الرُّبُعُ وَلِلْأُمِّ ثُلُثُ مَا بَقِيَ وَمَا بَقِيَ فَلِلْأَبِ",
            "id": "Telah mengabarkan kepada kami [Ubaidullah bin Musa] dari [Ibnu Abu Laila] dari [Amir Asy Sya'bi] dari [Ali] tentang seorang isteri dan kedua orang tua. Ia mengatakan; Dari empat (asal masalahnya empat), isteri mendapat seperempat, ibu mendapat sepertiga (dari harta) yang tersisa dan yang tersisa lagi untuk ayah."
        },
        {
            "number": 2746,
            "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ الْأَعْمَشِ وَمَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عَبْدِ اللَّهِ قَالَ كَانَ عُمَرُ إِذَا سَلَكَ بِنَا طَرِيقًا اتَّبَعْنَاهُ فِيهِ وَجَدْنَاهُ سَهْلًا وَإِنَّهُ قَضَى فِي امْرَأَةٍ وَأَبَوَيْنِ مِنْ أَرْبَعَةٍ فَأَعْطَى الْمَرْأَةَ الرُّبُعَ وَالْأُمَّ ثُلُثَ مَا بَقِيَ وَالْأَبَ سَهْمَيْنِ حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ عِيسَى عَنْ الشَّعْبِيِّ عَنْ زَيْدِ بْنِ ثَابِتٍ مِثْلَ ذَلِكَ",
            "id": "Telah menceritakan kepada kami Muhammad bin Yusuf dari Sufyan dari Al A'masy dan Manshur dari Ibrahim dari Abdullah ia berkata; Apabila Umar berjalan bersama kami di sebuah jalan dan kami mengikutinya, tentu kami akan mendapatkan kemudahan. Dan sesungguhnya ia telah memutuskan pada masalah isteri dan kedua orang tua dari empat. Ia memberikan untuk isteri seperempat, untuk ibu sepertiga dari yang tersisa dan untuk ayah dua bagian. Telah menceritakan kepada kami Muhammad bin Yusuf telah menceritakan kepada kami Sufyan dari Isa dari Asy Sya'bi dari Zaid bin Tsabit seperti riwayat itu."
        },
        {
            "number": 2747,
            "arab": " أَخْبَرَنَا مُحَمَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ أَبِيهِ عَنْ الْمُسَيَّبِ بْنِ رَافِعٍ عَنْ عَبْدِ اللَّهِ قَالَ كَانَ يَقُولُ مَا كَانَ اللَّهُ لِيَرَانِي أَنْ أُفَضِّلَ أُمًّا عَلَى أَبٍ",
            "id": "Telah mengabarkan kepada kami [Muhammad] telah menceritakan kepada kami [Sufyan] dari [ayahnya] dari [Al Musayyab bin Rafi'] dari [Abdullah], ia berkata; (Abdullah) pernah berkata; Allah tidak akan senang melihatku jika aku melebihkan bagian ibu atas ayah."
        },
        {
            "number": 2748,
            "arab": " أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ أَخْبَرَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ عِكْرِمَةَ قَالَ أَرْسَلَ ابْنُ عَبَّاسٍ إِلَى زَيْدِ بْنِ ثَابِتٍ أَتَجِدُ فِي كِتَابِ اللَّهِ لِلْأُمِّ ثُلُثُ مَا بَقِيَ فَقَالَ زَيْدٌ إِنَّمَا أَنْتَ رَجُلٌ تَقُولُ بِرَأْيِكَ وَأَنَا رَجُلٌ أَقُولُ بِرَأْيِي",
            "id": "Telah mengabarkan kepada kami [Sa'id bin Amir] telah mengabarkan kepada kami [Syu'bah] dari [Al Hakam] dari [Ikrimah] ia berkata; Ibnu Abbas mengirim surat kepada Zaid bin Tsabit; Apakah engkau pernah menemukan dalam kitab Allah; Ibu mendapat sepertiga dari warisan yang tersisa? [Zaid] menjawab; Sesungguhnya engkau adalah orang yang dapat berbicara berdasarkan pendapatmu dan aku juga orang yang dapat berbicara dengan pendapatku."
        },
        {
            "number": 2749,
            "arab": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ حَجَّاجٍ عَنْ الشَّعْبِيِّ وَحَجَّاجٍ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ أَنَّهُمَا قَالَا فِي زَوْجٍ وَأَبَوَيْنِ لِلزَّوْجِ النِّصْفُ وَلِلْأُمِّ ثُلُثُ جَمِيعِ الْمَالِ وَمَا بَقِيَ فَلِلْأَبِ",
            "id": "Telah menceritakan kepada kami Hajjaj bin Minhal telah menceritakan kepada kami Hammad bin Salamah dari Hajjaj dari Asy Sya'bi dan Hajjaj dari 'Atha` dari Ibnu Abbas bahwa mereka berdua berkata tentang bagian suami dan kedua orang tua; Suami mendapatkan setengah, ibu mendapatkan sepertiga dari seluruh harta dan sisanya untuk ayah."
        },
        {
            "number": 2750,
            "arab": " حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ أَخْبَرَنَا أَبُو عَوَانَةَ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلِيٍّ قَالَ لِلْأُمِّ ثُلُثُ جَمِيعِ الْمَالِ فِي امْرَأَةٍ وَأَبَوَيْنِ وَفِي زَوْجٍ وَأَبَوَيْنِ",
            "id": "Telah menceritakan kepada kami [Hajjaj bin Minhal] telah mengabarkan kepada kami [Abu 'Awanah] dari [Al A'masy] dari [Ibrahim] dari [Ali] ia berkata; Ibu mendapatkan sepetiga dari seluruh harta dalam masalah isteri dan kedua orang tua serta dalam masalah suami dan kedua orang tua."
        },
        {
            "number": 2751,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ أَبِيهِ عَنْ الْفُضَيْلِ بْنِ عَمْرٍو عَنْ إِبْرَاهِيمَ قَالَ خَالَفَ ابْنُ عَبَّاسٍ أَهْلَ الْقِبْلَةِ فِي امْرَأَةٍ وَأَبَوَيْنِ جَعَلَ لِلْأُمِّ الثُّلُثَ مِنْ جَمِيعِ الْمَالِ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Ibnu Idris] dari [ayahnya] dari [Al Fudlail bin Amr] dari [Ibrahim] ia berkata; [Ibnu Abbas] menyelisihi pendapat ahlu qiblat dalam masalah isteri dan kedua orang tua, ia menjadikan bagian ibu sepertiga dari seluruh harta."
        },
        {
            "number": 2752,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ الثَّوْرِيِّ عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ عَنْ الْأَسْوَدِ بْنِ يَزِيدَ قَالَ قَضَى مُعَاذُ بْنُ جَبَلٍ بِالْيَمَنِ فِي بِنْتٍ وَأُخْتٍ فَأَعْطَى الْبِنْتَ النِّصْفَ وَالْأُخْتَ النِّصْفَ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Sufyan Ats Tsauri] dari [Asy'ats bin Abu Asy Sya'tsa`] dari [Al Aswad bin Yazid] ia berkata; [Mu'adz bin Jabal] memutuskan hukum di Yaman dalam masalah bagian anak perempuan dan saudara perempuan, ia memberikan bagian anak perempuan setengah dan saudara perempuan setengah."
        },
        {
            "number": 2753,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ بْنِ يَزِيدَ أَنَّ ابْنَ الزُّبَيْرِ كَانَ لَا يُوَرِّثُ الْأُخْتَ مِنْ الْأَبِ وَالْأُمِّ مَعَ الْبِنْتِ حَتَّى حَدَّثَهُ الْأَسْوَدُ أَنَّ مُعَاذَ بْنَ جَبَلٍ جَعَلَ لِلْبِنْتِ النِّصْفَ وَلِلْأُخْتِ النِّصْفَ فَقَالَ أَنْتَ رَسُولِي إِلَى عَبْدِ اللَّهِ بْنِ عُتْبَةَ فَأَخْبِرْهُ بِذَاكَ وَكَانَ قَاضِيَهُ بِالْكُوفَةِ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Al A'masy] dari [Ibrahim] dari [Al Aswad bin Yazid] bahwa Ibnu Az Zubair tidak menetapkan warisan pada saudara perempuan seayah dan seibu bersama anak perempuan hingga Al Aswad menceritakannya bahwa [Mu'adz bin Jabal] menjadikan anak perempuan mendapat bagian setengah dan saudara perempuan mendapat bagian setengah. Ia pun berkata; Engkau adalah utusanku kepada Abdullah bin Utbah. Kabarkan hal ini kepadanya, ketika itu ia menjabat sebagai hakim di Kufah."
        },
        {
            "number": 2754,
            "arab": " حَدَّثَنَا بِشْرُ بْنُ عُمَرَ قَالَ سَأَلْتُ ابْنَ أَبِي الزِّنَادِ عَنْ رَجُلٍ تَرَكَ بِنْتًا وَأُخْتًا فَقَالَ لِابْنَتِهِ النِّصْفُ وَلِأُخْتِهِ مَا بَقِيَ وَقَالَ أَخْبَرَنِي أَبِي عَنْ خَارِجَةَ بْنِ زَيْدٍ أَنَّ زَيْدَ بْنَ ثَابِتٍ كَانَ يَجْعَلُ الْأَخَوَاتِ مَعَ الْبَنَاتِ عَصَبَةً لَا يَجْعَلُ لَهُنَّ إِلَّا مَا بَقِيَ",
            "id": "Telah menceritakan kepada kami [Bisyr bin Umar] ia berkata; Aku bertanya kepada [Ibnu Abu Az Zinad] tentang seorang laki-laki yang meninggalkan anak perempuan dan saudara perempuan. Ia pun menjawab; Anak perempuan mendapat bagian setengah dan saudara perempuan mendapatkan yang tersisa. Ia juga berkata; Telah mengabarkan kepadaku [ayahnya] dari [Kharijah bin Zaid] bahwa [Zaid bin Tsabit] menjadikan bagian para saudara perempuan bersama para anak perempuan adalah ashabah. Ia tidak memberikan warisan untuk mereka kecuali apa yang tersisa. "
        },
        {
            "number": 2755,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ وَالْأَعْمَشِ عَنْ إِبْرَاهِيمَ فِي زَوْجٍ وَأُمٍّ وَإِخْوَةٍ لِأَبٍ وَأُمٍّ وَإِخْوَةٍ لِأُمٍّ قَالَ كَانَ عُمَرُ وَعَبْدُ اللَّهِ وَزَيْدٌ يُشَرِّكُونَ وَقَالَ عُمَرُ لَمْ يَزِدْهُمْ الْأَبُ إِلَّا قُرْبًا",
            "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Manshur] dan [Al A'masy] dari [Ibrahim] tentang suami, isteri saudara perempuan seayah seibu dan saudara perempuan seibu. Ia berkata; [Umar], [Abdullah] dan [Zaid] menetapkan musyarrakah bagi mereka. Umar berkata; Ayah tidak menambah mereka kecuali kedekatan. "
        },
        {
            "number": 2756,
            "arab": " حَدَّثَنَا مُحَمَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ عَنْ الْحَارِثِ عَنْ عَلِيٍّ أَنَّهُ كَانَ لَا يُشَرِّكُ",
            "id": "Telah menceritakan kepada kami [Muhammad] telah menceritakan kepada kami [Sufyan] dari [Abu Ishaq] dari [Al Harits] dari [Ali] bahwa ia tidak menetapkan musyarrakah."
        },
        {
            "number": 2757,
            "arab": " أَخْبَرَنَا مُحَمَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ سُلَيْمَانَ التَّيْمِيِّ عَنْ أَبِي مِجْلَزٍ أَنَّ عُثْمَانَ كَانَ يُشَرِّكُ وَعَلِيٌّ كَانَ لَا يُشَرِّكُ",
            "id": "Telah mengabarkan kepada kami [Muhammad] telah menceritakan kepada kami [Sufyan] dari [Sulaiman At Taimi] dari [Abu Mijlaz] bahwa [Utsman] menetapkan musyarrakah namun [Ali] tidak menetapkan musyarrakah."
        },
        {
            "number": 2758,
            "arab": " حَدَّثَنَا مُحَمَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ ذَكْوَانَ أَنَّ زَيْدًا كَانَ يُشَرِّكُ",
            "id": "Telah menceritakan kepada kami [Muhammad] telah menceritakan kepada kami [Sufyan] dari [Ibnu Dzakwan] bahwa [Zaid] menetapkan musyarrakah."
        },
        {
            "number": 2759,
            "arab": " حَدَّثَنَا مُحَمَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ شُرَيْحٍ أَنَّهُ كَانَ يُشَرِّكُ",
            "id": "Telah menceritakan kepada kami [Muhammad] telah menceritakan kepada kami [Sufyan] dari [Abdul Malik bin Umair] dari [Syuraih] bahwa ia menetapkan musyarrakah."
        },
        {
            "number": 2760,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ الصَّلْتِ حَدَّثَنَا أَبُو شِهَابٍ عَنْ الْحَجَّاجِ عَنْ عَبْدِ الْمَلِكِ بْنِ الْمُغِيرَةِ عَنْ سَعِيدِ بْنِ فَيْرُوزَ عَنْ أَبِيهِ أَنَّ عُمَرَ قَالَ فِي الْمُشَرَّكَةِ لَمْ يَزِدْهُمْ الْأَبُ إِلَّا قُرْبًا",
            "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shalt] telah menceritakan kepada kami [Abu Syihab] dari [Al Hajjaj] dari [Abdul Malik bin Al Mughirah] dari [Sa'id bin Fairuz] dari [ayahnya] bahwa [Umar] berkata tentang musyarrakah; Ayah tidak menambah mereka kecuali kedekatan."
        },
        {
            "number": 2761,
            "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا زُهَيْرٌ عَنْ أَبِي إِسْحَقَ عَنْ الْحَارِثِ الْأَعْوَرِ قَالَ أُتِيَ عَبْدُ اللَّهِ فِي فَرِيضَةِ بَنِي عَمٍّ أَحَدُهُمْ أَخٌ لِأُمٍّ فَقَالَ الْمَالُ أَجْمَعُ لِأَخِيهِ لِأُمِّهِ فَأَنْزَلَهُ بِحِسَابِ أَوْ بِمَنْزِلَةِ الْأَخِ مِنْ الْأَبِ وَالْأُمِّ فَلَمَّا قَدِمَ عَلِيٌّ سَأَلْتُهُ عَنْهَا وَأَخْبَرْتُهُ بِقَوْلِ عَبْدِ اللَّهِ فَقَالَ يَرْحَمُهُ اللَّهُ إِنْ كَانَ لَفَقِيهًا أَمَّا أَنَا فَلَمْ أَكُنْ لِأَزِيدَهُ عَلَى مَا فَرَضَ اللَّهُ لَهُ سَهْمٌ السُّدُسُ ثُمَّ يُقَاسِمُهُمْ كَرَجُلٍ مِنْهُمْ",
            "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Zuhair] dari [Abu Ishaq] dari [Al Harits Al A'war] ia berkata; [Abdullah] pernah dihadapkan dengan masalah warisan dua anak paman dari pihak ayah. Salah satunya adalah saudara laki-laki seibu. Ia berkata; Harta seluruhnya untuk saudara laki-laki seibu. Ia menempatkan saudara laki-laki seibu dengan hitungan atau pada kedudukan saudara laki-laki seayah dan seibu. Ketika Ali datang, aku bertanya kepadanya tentang masalah ini. Aku juga memberitahukan perkataan Abdullah kepadanya. Maka [dia] menjawab; Semoga Allah merahmatinya, sesungguhnya ia adalah seorang faqih. Sedangkan aku tidak akan menambahkan bagian untuknya atas apa yang telah ditetapkan Allah, yaitu bagian seperenam. Lalu ia membagi harta untuk mereka seperti bagian laki-laki dari mereka."
        },
        {
            "number": 2762,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ عَنْ الْحَارِثِ عَنْ عَلِيٍّ أَنَّهُ أُتِيَ فِي ابْنَيْ عَمٍّ أَحَدُهُمَا أَخٌ لِأُمٍّ فَقِيلَ لِعَلِيٍّ إِنَّ ابْنَ مَسْعُودٍ كَانَ يُعْطِيهِ الْمَالَ كُلَّهُ فَقَالَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ إِنْ كَانَ لَفَقِيهًا وَلَوْ كُنْتُ أَنَا أَعْطَيْتُهُ السُّدُسَ وَمَا بَقِيَ كَانَ بَيْنَهُمْ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Abu Ishaq] dari [Al Harits] dari [Ali] bahwa ia pernah dihadapkan dengan masalah warisan dua anak paman dari pihak ayah, salah satunya adalah saudara laki-laki seibu. Kemudian ketika Ali diberitahukan bahwa Ibnu Mas'ud memberikan kepada saudara laki-laki seibu seluruh harta, maka Ali radliallahu 'anhu berkata; Ia adalah seorang faqih. Seandainya aku yang memutuskan maka aku akan memberikan bagian seperenam untuknya dan yang tersisa dibagikan di antara mereka."
        },
        {
            "number": 2763,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ عَنْ أَبِي قَيْسٍ الْأَوْدِيِّ عَنْ هُزَيْلِ بْنِ شُرَحْبِيلَ قَالَ جَاءَ رَجُلٌ إِلَى أَبِي مُوسَى الْأَشْعَرِيِّ وَإِلَى سَلْمَانَ بْنِ رَبِيعَةَ فَسَأَلَهُمَا عَنْ بِنْتٍ وَبِنْتِ ابْنٍ وَأُخْتٍ لِأُمٍّ وَأَبٍ فَقَالَا لِلِابْنَةِ النِّصْفُ وَمَا بَقِيَ فَلِلْأُخْتِ وَأْتِ ابْنَ مَسْعُودٍ فَإِنَّهُ سَيُتَابِعُنَا فَجَاءَ الرَّجُلُ إِلَى عَبْدِ اللَّهِ فَسَأَلَهُ عَنْ ذَلِكَ فَقَالَ لَقَدْ ضَلَلْتُ إِذًا وَمَا أَنَا مِنْ الْمُهْتَدِينَ وَإِنِّي أَقْضِي بِمَا قَضَى بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلِابْنَةِ النِّصْفُ وَلِابْنَةِ الِابْنِ السُّدُسُ وَمَا بَقِيَ فَلِلْأُخْتِ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan Ats Tsauri] dari [Abu Qais Al Audi] dari [Huzail bin Syurahbil] ia berkata; Ada seseorang mendatangi Abu Musa Al Asy'ari dan Salman bin Rabi'ah lalu menanyakan kepada keduanya tentang anak perempuan, anak perempuan dari anak laki-laki dan saudara perempuan seibu dan seayah. Mereka berdua menjawab; Anak perempuan mendapat setengah dan warisan yang tersisa untuk saudara perempuan. Datanglah kepada [Ibnu Mas'ud], tentu ia akan mengikuti pendapat kami. Lalu orang itu datang menemui Abdullah menanyakan tentang hal itu kepadanya. Ia pun mengatakan; Kalau tidak menjawab berarti aku telah tersesat dan tidak termasuk orang-orang yang mendapat petunjuk. Sesungguhnya aku memutuskan sesuatu dengan apa yang pernah diputuskan oleh Rasulullah shallallahu 'alaihi wasallam; Anak perempuan mendapat setengah, anak perempuan dari anak laki-laki mendapat seperenam, dan warisan yang tersisa untuk saudara perempuan."
        },
        {
            "number": 2764,
            "arab": " أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَبُو شِهَابٍ عَنْ الْأَعْمَشِ عَنْ مُسْلِمٍ عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِ أَنَّهُ كَانَ يَقُولُ فِي أَخَوَاتٍ لِأَبٍ وَأُمٍّ وَإِخْوَةٍ وَأَخَوَاتٍ لِأَبٍ قَالَ لِلْأَخَوَاتِ لِلْأَبِ وَالْأُمِّ الثُّلُثَانِ وَمَا بَقِيَ فَلِلذُّكُورِ دُونَ الْإِنَاثِ فَقَدِمَ مَسْرُوقٌ الْمَدِينَةَ فَسَمِعَ قَوْلَ زَيْدٍ فِيهَا فَأَعْجَبَهُ فَقَالَ لَهُ بَعْضُ أَصْحَابِهِ أَتَتْرُكُ قَوْلَ عَبْدِ اللَّهِ فَقَالَ إِنِّي أَتَيْتُ الْمَدِينَةَ فَوَجَدْتُ زَيْدَ بْنَ ثَابِتٍ مِنْ الرَّاسِخِينَ فِي الْعِلْمِ قَالَ أَحْمَدُ فَقُلْتُ لِأَبِي شِهَابٍ وَكَيْفَ قَالَ زَيْدٌ فِيهَا قَالَ شَرَّكَ بَيْنَهُمْ",
            "id": "Telah mengabarkan kepada kami [Ahmad bin Abdullah] telah menceritakan kepada kami [Abu Syihab] dari [Al A'masy] dari [Muslim] dari [Masruq] dari [Abdullah] bahwa ia pernah berkata dalam masalah beberapa saudara perempuan seayah dan seibu, beberapa saudara laki-laki dan beberapa saudara perempuan seayah, ia berkata; Beberapa saudara perempuan seayah dan seibu mendapat dua pertiga dan yang tersisa hanya untuk para laki-laki tidak untuk perempuan. Lalu ketika Masruq datang ke Madinah, ia mendengar perkataan [Zaid] dalam masalah itu, ia pun heran, lalu sebagian sahabatnya menanyakannya; Apakah engkau akan meninggalkan perkataan Abdullah? Ia menjawab; Aku datang ke Madinah dan menemukan Zaid bin Tsabit termasuk orang-orang yang mendalam ilmunya. Ahmad berkata; Aku bertanya kepada Abu Syihab; Bagaimana jawabannya itu? Ia menjawab; Ia membagi harta secara musyarrakah di antara mereka."
        },
        {
            "number": 2765,
            "arab": " حَدَّثَنَا سَعِيدُ بْنُ الْمُغِيرَةِ عَنْ عِيسَى بْنِ يُونُسَ عَنْ إِسْمَعِيلَ قَالَ ذَكَرْنَا عِنْدَ حَكِيمِ بْنِ جَابِرٍ أَنَّ ابْنَ مَسْعُودٍ قَالَ فِي أَخَوَاتٍ لِأَبٍ وَأُمٍّ وَإِخْوَةٍ وَأَخَوَاتٍ لِأَبٍ أَنَّهُ كَانَ يُعْطِي لِلْأَخَوَاتِ مِنْ الْأَبِ وَالْأُمِّ الثُّلُثَيْنِ وَمَا بَقِيَ فَلِلذُّكُورِ دُونَ الْإِنَاثِ فَقَالَ حَكِيمٌ قَالَ زَيْدُ بْنُ ثَابِتٍ هَذَا مِنْ عَمَلِ الْجَاهِلِيَّةِ أَنْ يَرِثَ الرِّجَالُ دُونَ النِّسَاءِ إِنَّ إِخْوَتَهُنَّ قَدْ رُدُّوا عَلَيْهِنَّ",
            "id": "Telah menceritakan kepada kami [Sa'id bin Al Mughirah] dari [Isa bin Yunus] dari [Isma'il] ia berkata; Kami menyebutkan kepada [Hakim bin Jabir] bahwa [Ibnu Mas'ud] berkata dalam masalah beberapa saudara perempuan seayah dan seibu, beberapa saudara laki-laki dan beberapa saudara perempuan seayah, bahwa ia memberi bagian kepada beberapa saudara peremuan seayah dan seibu dua pertiga, dan yang tersisa untuk para laki-laki saja. Lalu Hakim berkata; [Zaid bin Tsabit] berkata; Hal ini termasuk perbuatan jahiliyah, yaitu memberi hak waris kepada para laki-laki tidak kepada para perempuan. Sesungguhnya (bagian) para saudara laki-laki telah dikembalikan kepada mereka."
        },
        {
            "number": 2766,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ مَعْبَدِ بْنِ خَالِدٍ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ أَنَّهَا كَانَتْ تُشَرِّكُ بَيْنَ ابْنَتَيْنِ وَابْنَةِ ابْنٍ وَابْنِ ابْنٍ تُعْطِي الِابْنَتَيْنِ الثُّلُثَيْنِ وَمَا بَقِيَ فَشَرِيكُهُمْ وَكَانَ عَبْدُ اللَّهِ لَا يُشَرِّكُ يُعْطِي الذُّكُورَ دُونَ الْإِنَاثِ وَقَالَ الْأَخَوَاتُ بِمَنْزِلَةِ الْبَنَاتِ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Ma'bad bin Khalid] dari [Masruq] dari [Aisyah] bahwa ia melakukan musyarrakah di antara dua anak perempuan, anak perempuan dari anak laki-laki dan anak laki-laki dari anak laki-laki; Dua anak perempuan mendapat dua pertiga dan yang tersisa dibagikan secara musyarrakah. Abdullah tidak melakukan musyarrakah, ia memberi bagian para laki-laki tidak kepada para perempuan. Ia berkata; Para saudara perempuan sama kedudukannya dengan para anak perempuan."
        },
        {
            "number": 2767,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي سَهْلٍ عَنْ الشَّعْبِيِّ أَنَّ ابْنَ مَسْعُودٍ كَانَ يَقُولُ فِي بِنْتٍ وَبَنَاتِ ابْنٍ وَابْنِ ابْنٍ إِنْ كَانَتْ الْمُقَاسَمَةُ بَيْنَهُمْ أَقَلَّ مِنْ السُّدُسِ أَعْطَاهُمْ السُّدُسَ وَإِنْ كَانَ أَكْثَرَ مِنْ السُّدُسِ أَعْطَاهُمْ السُّدُسَ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Abu Sahl] dari [Asy Sya'bi] bahwa [Ibnu Mas'ud] pernah berkata dalam masalah anak perempuan dan para anak perempuan dari anak laki-laki serta anak laki-laki dari anak laki-laki; Jika pembagian di antara mereka kurang dari seperenam, maka diberkan kepada mereka seperenam dan jika lebih dari seperenam maka diberikan kepada mereka seperenam juga."
        },
        {
            "number": 2768,
            "arab": " حَدَّثَنَا مُحَمَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ مَسْرُوقٍ أَنَّهُ كَانَ يُشَرِّكُ فَقَالَ لَهُ عَلْقَمَةُ هَلْ أَحَدٌ مِنْهُمْ أَثْبَتُ مِنْ عَبْدِ اللَّهِ فَقَالَ لَا وَلَكِنِّي رَأَيْتُ زَيْدَ بْنَ ثَابِتٍ وَأَهْلَ الْمَدِينَةِ يُشَرِّكُونَ فِي ابْنَتَيْنِ وَبِنْتِ ابْنٍ وَابْنِ ابْنٍ وَأُخْتَيْنِ",
            "id": "Telah menceritakan kepada kami [Muhammad] telah menceritakan kepada kami [Sufyan] dari [Al A'masy] dari [Ibrahim] dari [Masruq] bahwa ia melakukan musyarrakah. Maka 'Alqamah berkata kepadanya; Adakah orang di antara mereka yang lebih memastikan dari pada Abdullah? Ia menjawab; Tidak ada, akan tetapi aku pernah melihat [Zaid bin Tsabit] dan ulama Madinah membagi harta warisan secara musyarrikah dalam masalah; Dua anak perempuan, seorang anak perempuan dari anak laki-laki, seorang anak laki-laki dari anak laki-laki dan dua saudara perempuan."
        },
        {
            "number": 2769,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ هِشَامٍ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ شُرَيْحٍ فِي امْرَأَةٍ تَرَكَتْ زَوْجَهَا وَأُمَّهَا وَأُخْتَهَا لِأَبِيهَا وَأُمِّهَا وَأُخْتَهَا لِأَبِيهَا وَإِخْوَتَهَا لِأُمِّهَا جَعَلَهَا مِنْ سِتَّةٍ ثُمَّ رَفَعَهَا فَبَلَغَتْ عَشْرَةً لِلزَّوْجِ النِّصْفُ ثَلَاثَةُ أَسْهُمٍ وَلِلْأُخْتِ مِنْ الْأَبِ وَالْأُمِّ النِّصْفُ ثَلَاثَةُ أَسْهُمٍ وَلِلْأُمِّ السُّدُسُ سَهْمٌ وَلِلْإِخْوَةِ مِنْ الْأُمِّ الثُّلُثُ سَهْمَانِ وَلِلْأُخْتِ مِنْ الْأَبِ سَهْمٌ تَكْمِلَةُ الثُّلُثَيْنِ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Hisyam] dari [Muhammad bin Sirin] dari [Syuraih] dalam masalah seorang isteri yang meninggalkan suami, ibu, saudara perempuan seayah dan seibu, saudara perempuan seayah dan saudara perempuannya seibu. Ia menjadikannya dari enam (asal masalahnya enam) kemudian menambahnya menjadi sepuluh (asal masalahnya menjadi sepuluh). Suami mendapat setengah, yaitu tiga bagian. Saudara perempuan seayah dan seibu mendapat setengah, yaitu tiga bagian. Ibu mendapat seperenam, yaikni tiga bagian. Para saudara laki-laki seibu mendapat sepertiga, yakni dua bagian. Saudara perempuan seayah satu bagian sebagai penyempurna dua pertiga."
        },
        {
            "number": 2770,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ عَنْ عَلِيِّ بْنِ مُسْهِرٍ عَنْ أَشْعَثَ عَنْ الشَّعْبِيِّ أَنَّ عَلِيًّا وَزَيْدًا كَانَا لَا يَحْجُبَانِ بِالْكُفَّارِ وَلَا بِالْمَمْلُوكِينَ وَلَا يُوَرِّثَانِهِمْ شَيْئًا وَكَانَ عَبْدُ اللَّهِ يَحْجُبُ بِالْكُفَّارِ وَبِالْمَمْلُوكِينَ وَلَا يُوَرِّثُهُمْ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Uyainah] dari [Ali bin Mushir] dari [Asy'ats] dari [Asy Sya'bi] bahwa [Ali] dan [Zaid] keduanya tidak menjadikan orang-orang kafir dan para budak sebagai hijab (penghalang) bagi ahli waris lainnya dan keduanya tidak masuk dalam kelompok ahli waris. Sementara [Abdullah] menjadikan orang-orang kafir dan para budak sebagai hijab namun tidak memasukkan mereka dalam kelompok ahli waris."
        },
        {
            "number": 2771,
            "arab": " حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ إِبْرَاهِيمَ أَنَّ عَلِيًّا وَزَيْدًا قَالَا الْمَمْلُوكُونَ وَأَهْلُ الْكِتَابِ لَا يَحْجُبُونَ وَلَا يَرِثُونَ وَقَالَ عَبْدُ اللَّهِ يَحْجُبُونَ وَلَا يَرِثُونَ",
            "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Syu'bah] dari [Al Hakam] dari [Ibrahim] bahwa [Ali] dan [Zaid] berkata; Para budak dan ahlu kitab tidak menghalangi dan tidak dapat menjadi ahli waris. Sedangkan [Abdullah] berkata; Mereka dapat menghalangi, namun tidak dapat menjadi ahli waris."
        },
        {
            "number": 2772,
            "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا يَحْيَى عَنْ سَعِيدٍ أَنَّ عُمَرَ كَانَ كَتَبَ مِيرَاثَ الْجَدِّ حَتَّى إِذَا طُعِنَ دَعَا بِهِ فَمَحَاهُ ثُمَّ قَالَ سَتَرَوْنَ رَأْيَكُمْ فِيهِ",
            "id": "Telah mengabarkan kepada kami [Yazid bin Harun] Telah mengabarkan kepada kami [Yahya] dari [Sa'id] bahwa [Umar] pernah menulis bagian warisan untuk kakek hingga ketika setelah ditikam, ia meminta tulisannya tersebut dan menghapusnya. Kemudian ia berkata; Kalian dapat berpendapat dengan pendapat kalian tentang bagian ini."
        },
        {
            "number": 2773,
            "arab": " أَخْبَرَنَا يَزِيدُ أَخْبَرَنَا أَشْعَثُ عَنْ ابْنِ سِيرِينَ قَالَ قُلْتُ لِعَبِيدَةَ حَدِّثْنِي عَنْ الْجَدِّ فَقَالَ إِنِّي لَأَحْفَظُ فِي الْجَدِّ ثَمَانِينَ قَضِيَّةً مُخْتَلِفَةً",
            "id": "Telah mengabarkan kepada kami [Yazid] telah mengabarkan kepada kami [Asy'ats] dari [Ibnu Sirin] ia berkata; Aku berkata kepada [Abidah]; Ceritakanlah kepadaku tentang bagian kakek. Lalu ia berkata; Sesungguhnya aku hafal delapan puluh masalah yang berbeda tentang bagian warisan kakek."
        },
        {
            "number": 2774,
            "arab": " أَخْبَرَنَا أَبُو غَسَّانَ حَدَّثَنَا إِسْرَائِيلُ عَنْ أَبِي إِسْحَقَ عَنْ عُبَيْدِ بْنِ عَمْرٍو الْخَارِفِيِّ عَنْ عَلِيٍّ قَالَ أَتَاهُ رَجُلٌ فَسَأَلَهُ عَنْ فَرِيضَةٍ فَقَالَ إِنْ لَمْ يَكُنْ فِيهَا جَدٌّ فَهَاتِهَا",
            "id": "Telah mengabarkan kepada kami [Abu Ghassan] telah menceritakan kepada kami [Isra`il] dari [Abu Ishaq] dari [Ubaid bin Amr Al Kharifi] dari [Ali] ia berkata; Seseorang datang kepadanya lalu bertanya tentang pembagian harta warisan. Maka ia menjawab; Jika di dalam ahli waris tidak ada kakek, maka bagikanlah."
        },
        {
            "number": 2775,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ عَنْ عُبَيْدِ بْنِ عَمْرٍو قَالَ جَاءَ رَجُلٌ إِلَى عَلِيٍّ فَسَأَلَهُ عَنْ فَرِيضَةٍ فَقَالَ إِنْ لَمْ يَكُنْ فِيهَا جَدٌّ فَهَاتِهَا",
            "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Abu Ishaq] dari [Ubaid bin Amr] ia berkata; Seseorang datang kepada [Ali] menanyakannya tentang pembagian harta warisan. Maka ia menjawab; Jika di dalam ahli waris tidak ada kakek maka bagikanlah."
        },
        {
            "number": 2776,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ السَّخْتِيَانِيِّ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ رَجُلٍ مِنْ مُرَادٍ سَمِعَ عَلِيًّا يَقُولُ مَنْ سَرَّهُ أَنْ يَتَقَحَّمَ جَرَاثِيمَ جَهَنَّمَ فَلْيَقْضِ بَيْنَ الْجَدِّ وَالْإِخْوَةِ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Ayyub As Sakhtiyani] dari [Sa'id bin Jubair] dari [seorang laki-laki dari Murad] ia mendengar [Ali] berkata; Barangsiapa yang senang menceburkan diri ke dasar neraka Jahannam, maka silahkan memutuskan masalah warisan antara kakek dan para saudara laki-laki."
        },
        {
            "number": 2777,
            "arab": " أَخْبَرَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا خَالِدٌ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ح وَعَنْ عِكْرِمَةَ أَنَّ أَبَا بَكْرٍ الصِّدِّيقَ جَعَلَ الْجَدَّ أَبًا",
            "id": "Telah mengabarkan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Khalid] dari [Abu Nadlrah] dari [Abu Sa'id Al Khudri], dalam riwayat lain dari [Ikrimah] bahwa [Abu Bakr Ash Shiddiq] menjadikan kakek pada posisi ayah dalam warisan."
        },
        {
            "number": 2778,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ سُلَيْمَانَ الشَّيْبَانِيِّ عَنْ كُرْدُوسٍ عَنْ أَبِي مُوسَى عَنْ أَبِي بَكْرٍ الصِّدِّيقِ أَنَّهُ جَعَلَ الْجَدَّ أَبًا",
            "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Sulaiman Asy Syaibani] dari [Kurdus] dari [Abu Musa] dari [Abu Bakr Ash Shiddiq] bahwa ia menjadikan kakek pada posisi ayah dalam warisan."
        },
        {
            "number": 2779,
            "arab": " حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَبُو شِهَابٍ عَنْ الشَّيْبَانِيِّ عَنْ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى عَنْ كُرْدُوسٍ عَنْ أَبِي مُوسَى أَنَّ أَبَا بَكْرٍ جَعَلَ الْجَدَّ أَبًا",
            "id": "Telah menceritakan kepada kami [Ahmad bin Abdullah] telah menceritakan kepada kami [Abu Syihab] dari [Asy Syaibani] dari [Abu Burdah bin Abu Musa] dari [Kurdus] dari [Abu Musa] bahwa [Abu Bakr] menjadikan kakek pada posisi ayah dalam warisan."
        },
        {
            "number": 2780,
            "arab": " أَخْبَرَنَا الْأَسْوَدُ بْنُ عَامِرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ أَبِي بُرْدَةَ عَنْ مَرْوَانَ عَنْ عُثْمَانَ أَنَّ أَبَا بَكْرٍ كَانَ يَجْعَلُ الْجَدَّ أَبًا",
            "id": "Telah mengabarkan kepada kami [Al Aswad bin Amir] telah menceritakan kepada kami [Syu'bah] dari [Amr bin Murrah] dari [Abu Burdah] dari [Marwan] dari [Utsman] bahwa [Abu Bakr] menjadikan kakek pada posisi ayah dalam warisan."
        },
        {
            "number": 2781,
            "arab": " حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى وَمُحَمَّدُ بْنُ يُوسُفَ عَنْ إِسْرَائِيلَ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي بُرْدَةَ قَالَ لَقِيتُ مَرْوَانَ بْنَ الْحَكَمِ بِالْمَدِينَةِ فَقَالَ يَا ابْنَ أَبِي مُوسَى أَلَمْ أُخْبَرْ أَنَّ الْجَدَّ لَا يُنَزَّلُ فِيكُمْ مَنْزِلَةَ الْأَبِ وَأَنْتَ لَا تُنْكِرُ قَالَ قُلْتُ وَلَوْ كُنْتَ أَنْتَ لَمْ تُنْكِرْ قَالَ مَرْوَانُ فَأَنَا أَشْهَدُ عَلَى عُثْمَانَ بْنِ عَفَّانَ أَنَّهُ شَهِدَ عَلَى أَبِي بَكْرٍ أَنَّهُ جَعَلَ الْجَدَّ أَبًا إِذَا لَمْ يَكُنْ دُونَهُ أَبٌ",
            "id": "Telah menceritakan kepada kami [Ubaidullah bin Musa] dan [Muhammad bin Yusuf] dari [Isra`il] dari [Abu Ishaq] dari [Abu Burdah] ia berkata; Aku bertemu Marwan bin Al Hakam di Madinah, lalu ia berkata kepadaku; Wahai Ibnu Abu Musa, bukankah telah diberitahukan bahwa menurut kalian, kakek tidak menempati pada posisi ayah dan kamu tidak mengingkarinya? Ia mengatakan; Aku menjawab; Meskipun dulunya engkau tidak akan mengingkari? [Marwan] berkata; Sebab aku menyaksikan bahwasanya [Utsman bin 'Affan] pernah menyaksikan [Abu Bakar] menempatkan kakek pada posisi ayah dalam warisan, jika mayit tidak memiliki ayah."
        },
        {
            "number": 2782,
            "arab": " حَدَّثَنَا الْأَسْوَدُ بْنُ عَامِرٍ أَخْبَرَنَا شُعْبَةُ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي نَضْرَةَ وَعَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ أَبَا بَكْرٍ كَانَ يَجْعَلُ الْجَدَّ أَبًا",
            "id": "Telah menceritakan kepada kami [Al Aswad bin Amir] Telah mengabarkan kepada kami [Syu'bah] dari [Khalid Al Hadza`] dari [Abu An Nadlr] dan dari [Ikrimah] dari [Ibnu Abbas] bahwa [Abu Bakr] menjadikan kakek pada posisi ayah dalam warisan."
        },
        {
            "number": 2783,
            "arab": " حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا أَيُّوبُ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ جَعَلَهُ الَّذِي قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ كُنْتُ مُتَّخِذًا أَحَدًا خَلِيلًا لَاتَّخَذْتُهُ خَلِيلًا وَلَكِنْ أُخُوَّةُ الْإِسْلَامِ أَفْضَلُ يَعْنِي أَبَا بَكْرٍ جَعَلَهُ أَبًا يَعْنِي الْجَدَّ",
            "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Ayyub] dari [Ikrimah] dari [Ibnu Abbas] ia berkata; [Orang] yang menyebabkan Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seandainya aku boleh menjadikan seseorang sebagai kekasih maka tentu aku akan menjadikannya (Abu Bakar) sebagai kekasih. Tetapi persaudaraan dalam Islam lebih baik.\" Yakni Abu Bakar, ia menjadikannya pada posisi ayah yakni kakek."
        },
        {
            "number": 2784,
            "arab": " حَدَّثَنَا مُسْلِمٌ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا أَيُّوبُ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ ابْنِ الزُّبَيْرِ أَنَّ أَبَا بَكْرٍ جَعَلَ الْجَدَّ أَبًا",
            "id": "Telah menceritakan kepada kami [Muslim] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Ayyub] dari [Ibnu Abu Mulaikah] dari [Ibnu Az Zubair] bahwa [Abu Bakr] menjadikan kakek pada posisi ayah dalam warisan."
        },
        {
            "number": 2785,
            "arab": " حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا الْأَشْعَثُ عَنْ الْحَسَنِ قَالَ إِنَّ الْجَدَّ قَدْ مَضَتْ سُنَّتُهُ وَإِنَّ أَبَا بَكْرٍ جَعَلَ الْجَدَّ أَبًا وَلَكِنَّ النَّاسَ تَحَيَّرُوا",
            "id": "Telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Al Asy'ats] dari [Al Hasan] ia berkata; Sesungguhnya kakek telah ditetapkan dalam sunnah dan sesungguhnya [Abu Bakr] telah menjadikan kakek pada posisi ayah, tetapi manusia menjadi bingung."
        },
        {
            "number": 2786,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ عَنْ عَلِيِّ بْنِ مُسْهِرٍ عَنْ عَاصِمٍ عَنْ الشَّعْبِيِّ قَالَ إِنَّ أَوَّلَ جَدٍّ وَرِثَ فِي الْإِسْلَامِ عُمَرُ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Uyainah] dari [Ali bin Mushir] dari ['Ashim] dari [Asy Sya'bi] ia berkata; Sesungguhnya (posisi seorang) kakek yang pertama kali memperoleh warisan di dalam Islam adalah [Umar]."
        },
        {
            "number": 2787,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا حَسَنٌ عَنْ عَاصِمٍ عَنْ الشَّعْبِيِّ قَالَ أَوَّلُ جَدٍّ وَرِثَ فِي الْإِسْلَامِ عُمَرُ فَأَخَذَ مَالَهُ فَأَتَاهُ عَلِيٌّ وَزَيْدٌ فَقَالَا لَيْسَ لَكَ ذَاكَ إِنَّمَا أَنْتَ كَأَحَدِ الْأَخَوَيْنِ",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Hasan] dari ['Ashim] dari [Asy Sya'bi] ia berkata; (Posisi seorang) kakek yang pertama memperoleh warisan di dalam Islam adalah Umar. Setelah mengambil bagiannya, [Ali] dan] Zaid] datang menemuinya, lalu keduanya berkata; Engkau tidak boleh melakukan hal itu, sesungguhnya posisimu seperti salah seorang dari dua saudara laki-laki."
        },
        {
            "number": 2788,
            "arab": " حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ عِيسَى الْحَنَّاطِ عَنْ الشَّعْبِيِّ قَالَ كَانَ عُمَرُ يُقَاسِمُ بِالْجَدِّ مَعَ الْأَخِ وَالْأَخَوَيْنِ فَإِذَا زَادُوا أَعْطَاهُ الثُّلُثَ وَكَانَ يُعْطِيهِ مَعَ الْوَلَدِ السُّدُسَ",
            "id": "Telah menceritakan kepada kami [Ubaidullah bin Musa] dari [Isa Al Hannath] dari [Asy Sya'bi] ia berkata; [Umar] membagi harta warisan kepada kakek bersama satu saudara laki-laki dan dua saudara laki-laki. Jika lebih dari dua orang bersaudara, Umar memberi kakek sepertiga. Umar juga memberi seperenam kepada kakek ketika bersama anak."
        },
        {
            "number": 2789,
            "arab": " حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ مَرْوَانَ بْنِ الْحَكَمِ أَنَّ عُمَرَ بْنَ الْخَطَّابِ لَمَّا طُعِنَ اسْتَشَارَهُمْ فِي الْجَدِّ فَقَالَ إِنِّي كُنْتُ رَأَيْتُ فِي الْجَدِّ رَأْيًا فَإِنْ رَأَيْتُمْ أَنْ تَتَّبِعُوهُ فَاتَّبِعُوهُ فَقَالَ لَهُ عُثْمَانُ إِنْ نَتَّبِعْ رَأْيَكَ فَإِنَّهُ رَشَدٌ وَإِنْ نَتَّبِعْ رَأْيَ الشَّيْخِ فَلَنِعْمَ ذُو الرَّأْيِ كَانَ",
            "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Hisyam bin Urwah] dari [ayahnya] dari [Marwan bin Al Hakam] bahwa [Umar bin Al Khaththab] ketika tertikam, ia bermusyawarah dengan mereka tentang bagian kakek. Ia berkata; Sesungguhnya aku memiliki pendapat tentang bagian kakek. Jika kalian setuju untuk mengikutinya maka ikutilah pendapatku itu. [Utsman] berkata kepadanya; Jika kami mengikuti pendapatmu, maka sesungguhnya pendapatmu itu benar, namun jika kami mengikuti pendapat asy syaikh (orang yang lebih tua dan faham tentang agamanya), maka ia memang sebaik-baik orang yang memiliki pendapat."
        },
        {
            "number": 2790,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ عَنْ عَلِيِّ بْنِ مُسْهِرٍ عَنْ الشَّيْبَانِيِّ عَنْ الشَّعْبِيِّ قَالَ كَتَبَ ابْنُ عَبَّاسٍ إِلَى عَلِيٍّ وَابْنُ عَبَّاسٍ بِالْبَصْرَةِ إِنِّي أُتِيتُ بِجَدٍّ وَسِتَّةِ إِخْوَةٍ فَكَتَبَ إِلَيْهِ عَلِيٌّ أَنْ أَعْطِ الْجَدَّ سُبُعًا وَلَا تُعْطِهِ أَحَدًا بَعْدَهُ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Uyainah] dari [Ali bin Mushir] dari [Asy Syaibani] dari [Asy Sya'bi] ia berkata; Ibnu Abbas menulis surat kepada Ali, saat itu Ibnu Abbas berada di Bashrah; Sesungguhnya aku telah dihadapkan dengan masalah bagian kakek dan enam saudara laki-laki. Maka [Ali] berkata; Berikan kepada kakek seperenam dan jangan engkau berikan seperenam kepada siapa pun setelahnya."
        },
        {
            "number": 2791,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا حَسَنٌ عَنْ إِسْمَعِيلَ عَنْ الشَّعْبِيِّ فِي سِتَّةِ إِخْوَةٍ وَجَدٍّ قَالَ أَعْطِ الْجَدَّ السُّدُسَ قَالَ أَبُو مُحَمَّد كَأَنَّهُ يَعْنِي عَلِيًّا الشَّعْبِيُّ يَرْوِيهِ عَنْ عَلِيٍّ",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Hasan] dari [Isma'il] dari [Asy Sya'bi] tentang masalah enam saudara laki-laki dan kakek, ia berkata; Berikan seperenam kepada kakek. Abu Muhammad berkata; Sepertinya Asy Sya'bi meriwayatkan langsung dari Ali."
        },
        {
            "number": 2792,
            "arab": " حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ عَبْدِ اللَّهِ بْنِ سَلَمَةَ أَنَّ عَلِيًّا كَانَ يَجْعَلُ الْجَدَّ أَخًا حَتَّى يَكُونَ سَادِسًا",
            "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Syu'bah] dari [Amr bin Murrah] dari [Abdullah bin Salamah] bahwa [Ali] menjadikan kakek pada posisi saudara laki-laki dalam warisan selama jumlah saudara enam orang. "
        },
        {
            "number": 2793,
            "arab": " أَخْبَرَنَا أَبُو النُّعْمَانِ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا يُونُسُ عَنْ الْحَسَنِ أَنَّ عَلِيًّا كَانَ يُشَرِّكُ الْجَدَّ مَعَ الْإِخْوَةِ إِلَى السُّدُسِ",
            "id": "Telah mengabarkan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Yunus] dari [Al Hasan] bahwa [Ali] memberikan pembagian warisan secara musyarrakah dalam masalah kakek ketika bersama para saudara laki-laki sebanyak seperenam."
        },
        {
            "number": 2794,
            "arab": " حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ عَبْدِ اللَّهِ بْنِ سَلَمَةَ قَالَ كَانَ عَلِيٌّ يُشَرِّكُ بَيْنَ الْجَدِّ وَالْإِخْوَةِ حَتَّى يَكُونَ سَادِسًا",
            "id": "Telah menceritakan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami [Syu'bah] dari [Amr bin Murrah] dari [Abdullah bin Salamah] ia berkata; [Ali] membagi harta secara musyarrakah antara kakek dan para saudara laki-laki, sampai berjumlah enam orang."
        },
        {
            "number": 2795,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ قَالَ كَانَ عَلِيٌّ يُشَرِّكُ الْجَدَّ إِلَى سِتَّةٍ مَعَ الْإِخْوَةِ يُعْطِي كُلَّ صَاحِبِ فَرِيضَةٍ فَرِيضَتَهُ وَلَا يُوَرِّثُ أَخًا لِأُمٍّ مَعَ جَدٍّ وَلَا أُخْتًا لِأُمٍّ وَلَا يَزِيدُ الْجَدَّ مَعَ الْوَلَدِ عَلَى السُّدُسِ إِلَّا أَنْ يَكُونَ غَيْرُهُ وَلَا يُقَاسِمُ بِأَخٍ لِأَبٍ مَعَ أَخٍ لِأَبٍ وَأُمٍّ وَإِذَا كَانَتْ أُخْتٌ لِأَبٍ وَأُمٍّ وَأَخٌ لِأَبٍ أَعْطَى الْأُخْتَ النِّصْفَ وَالنِّصْفَ الْآخَرَ بَيْنَ الْجَدِّ وَالْأَخِ نِصْفَيْنِ وَإِذَا كَانُوا إِخْوَةً وَأَخَوَاتٍ شَرَّكَهُمْ مَعَ الْجَدِّ إِلَى السُّدُسِ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Al A'masy] dari [Ibrahim] ia berkata; [Ali] pernah membagi harta secara musyarrakah pada kakek ketika bersama enam saudara laki-laki. Setiap orang yang memiliki bagian yang telah ditetapkan mendapatkan bagiannya, namun saudara laki-laki seibu tidak dapat mewarisi bersama kakek, begitu juga saudara perempuan seibu. Ali tidak memberikan bagian kakek bersama anak lebih dari seperenam kecuali jika bersama yang lainnya. Ia tidak memberi bagian untuk kakek dengan saudara laki-laki seayah bersama saudara laki-laki seayah dan seibu. Jika saudara perempuan seayah dan seibu dan saudara laki-laki seayah, ia memberikan saudara perempuan setengah dan setengah lainnya dibagikan kepada kakek dan saudara laki-laki dengan pembagian masing-masing mendapat setengah. Jika mereka beberapa saudara laki-laki dan beberapa saudara perempuan maka ia menggabungkan mereka bersama kakek dalam bagian seperenam."
        },
        {
            "number": 2796,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ الْعَبْسِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مَعْقِلٍ قَالَ سُئِلَ ابْنُ عَبَّاسٍ عَنْ الْجَدِّ فَقَالَ أَيُّ أَبٍ لَكَ أَكْبَرُ فَقُلْتُ أَنَا آدَمُ قَالَ أَلَمْ تَسْمَعْ إِلَى قَوْلِ اللَّهِ تَعَالَى { يَا بَنِي آدَمَ }",
            "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] dari [Sufyan] dari [Al 'Absi] dari [Abdurrahman bin Ma'qil] ia berkata; [Ibnu Abbas] pernah ditanya tentang kakek, lalu ia menjawab; Ayah mana yang lebih tua menurutmu? Aku menjawab; Adam. Ia bertanya lagi; Tidakkah engkau mendengar firman Allah: (Hai bani Adam)."
        },
        {
            "number": 2797,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ إِسْمَعِيلَ بْنِ سُمَيْعٍ عَنْ رَجُلٍ عَنْ ابْنِ عَبَّاسٍ قَالَ لَوَدِدْتُ أَنِّي وَالَّذِينَ يُخَالِفُونِي فِي الْجَدِّ تَلَاعَنَّا أَيُّنَا أَسْوَأُ قَوْلًا",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Isma'il bin Sumai'] dari [seseorang] dari [Ibnu Abbas] ia berkata; Aku berharap bahwa aku dan orang-orang yang menyelisiku dalam masalah kakek melakukan li'an, untuk mengetahui perkataan siapa yang paling buruk."
        },
        {
            "number": 2798,
            "arab": " حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا ابْنُ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ أَنَّهُ جَعَلَ الْجَدَّ أَبًا",
            "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Ibnu Thawus] dari [ayahnya] dari [Ibnu Abbas] bahwa ia menjadikan kakek pada posisi ayah dalam warisan."
        },
        {
            "number": 2799,
            "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا زُهَيْرٌ عَنْ أَبِي إِسْحَقَ قَالَ دَخَلْتُ عَلَى شُرَيْحٍ وَعِنْدَهُ عَامِرٌ وَإِبْرَاهِيمُ وَعَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ فِي فَرِيضَةِ امْرَأَةٍ مِنَّا الْعَالِيَةِ تَرَكَتْ زَوْجَهَا وَأُمَّهَا وَأَخَاهَا لِأَبِيهَا وَجَدَّهَا فَقَالَ لِي هَلْ مِنْ أُخْتٍ قُلْتُ لَا قَالَ هَلْ مِنْ أُخْتٍ قُلْتُ لَا قَالَ لِلْبَعْلِ الشَّطْرُ وَلِلْأُمِّ الثُّلُثُ قَالَ فَجَهِدْتُ عَلَى أَنْ يُجِيبَنِي فَلَمْ يُجِبْنِي إِلَّا بِذَلِكَ فَقَالَ إِبْرَاهِيمُ وَعَامِرٌ وَعَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ مَا جَاءَ أَحَدٌ بِفَرِيضَةٍ أَعْضَلَ مِنْ فَرِيضَةٍ جِئْتَ بِهَا قَالَ فَأَتَيْتُ عَبِيدَةَ السَّلْمَانِيَّ وَكَانَ يُقَالُ لَيْسَ بِالْكُوفَةِ أَحَدٌ أَعْلَمَ بِفَرِيضَةٍ مِنْ عَبِيدَةَ وَالْحَارِثِ الْأَعْوَرِ وَكَانَ عَبِيدَةُ يَجْلِسُ فِي الْمَسْجِدِ فَإِذَا وَرَدَتْ عَلَى شُرَيْحٍ فَرِيضَةٌ فِيهَا جَدٌّ رَفَعَهُمْ إِلَى عَبِيدَةَ فَفَرَضَ فَسَأَلْتُهُ فَقَالَ إِنْ شِئْتُمْ نَبَّأْتُكُمْ بِفَرِيضَةِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ فِي هَذَا جَعَلَ لِلزَّوْجِ ثَلَاثَةَ أَسْهُمٍ النِّصْفَ وَلِلْأُمِّ ثُلُثُ مَا بَقِيَ السُّدُسُ مِنْ رَأْسِ الْمَالِ وَلِلْأَخِ سَهْمٌ وَلِلْجَدِّ سَهْمٌ قَالَ أَبُو إِسْحَقَ الْجَدُّ أَبُو الْأَبِ",
            "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Zuhair] dari [Abu Ishaq] ia berkata; Aku pernah menemui Syuraih, saat itu sedang bersama Amir, Ibrahim dan Abdurrahman bin Abdulah untuk menanyakan masalah bagian (warisan) seorang perempuan yang meninggalkan seorang suami, ibu, saudara laki-laki seayah dan kakeknya. Maka ia bertanya kepadaku; Adakah suadara perempuan? Aku menjawab; Tidak ada. Ia Syuraih berkata; Suami mendapat setengah dan ibu mendapat sepertiga. Ia melanjutkan; Aku terus mendesaknya agar ia menjawab selain jawaban itu, namun ia tidak menjawab selain itu. Maka Ibrahim, Amir dan Abdurrahman bin Abdullah berkata; Tidak ada seorang pun yang datang membawa masalah faraidl yang lebih rumit dari pada masalah faraidl yang engkau bawa. Lalu aku menemui [Abidah As Salmani], ada yang mengatakan bahwa di Kufah tidak ada seorang pun yang lebih mengetahui tentang faraidl dari pada Abidah dan Al Harits Al A'war. Ketika itu Abidah sedang duduk di dalam masjid. Jika ada masalah faraidl yang sulit dipecahkan oleh Syuraih, ia menyuruh mereka kepada Abidah dan ia pun dapat memecahkannya. Aku bertanya kepadanya lalu ia pun menjawab; Jika kalian mau, aku dapat memberitahukan kepada kalian pembagian [Abdullah bin Mas'ud] dalam masalah ini. Ia menjadikan suami mendapat tiga bagian yakni setengah, Ibu mendapat sepertiga dari yang tersisa, yakni seperenam dari harta warisan. Saudara laki-laki mendapat satu bagian dan kakek mendapat satu bagian. Abu Ishaq berkata; Kakek adalah ayahnya ayah."
        },
        {
            "number": 2800,
            "arab": " أَخْبَرَنَا أَبُو النُّعْمَانِ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا يُونُسُ عَنْ الْحَسَنِ أَنَّ زَيْدًا كَانَ يُشَرِّكُ الْجَدَّ مَعَ الْإِخْوَةِ إِلَى الثُّلُثِ",
            "id": "Telah mengabarkan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Yunus] dari [Al Hasan] bahwa [Zaid] melakukan musyarrakah kepada kakek bersama para saudara laki-laki dalam bagian sepertiga."
        },
        {
            "number": 2801,
            "arab": " حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ حَدَّثَنَا أَبِي حَدَّثَنَا الْأَعْمَشُ عَنْ إِبْرَاهِيمَ عَنْ زَيْدِ بْنِ ثَابِتٍ أَنَّهُ كَانَ يُقَاسِمُ بِالْجَدِّ مَعَ الْإِخْوَةِ إِلَى الثُّلُثِ ثُمَّ لَا يُنْقِصُهُ",
            "id": "Telah menceritakan kepada kami [Umar bin Hafsh bin Ghiyats] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Al A'masy] dari [Ibrahim] dari [Zaid bin Tsabit] bahwa ia memberi bagian sepertiga kepada kakek (yang ada) bersama para saudara laki-laki kemudian ia tidak pernah menguranginya."
        },
        {
            "number": 2802,
            "arab": " حَدَّثَنَا سَعِيدُ بْنُ الْمُغِيرَةِ عَنْ عِيسَى بْنِ يُونُسَ عَنْ إِسْمَعِيلَ قَالَ قَالَ عُمَرُ خُذْ مِنْ أَمْرِ الْجَدِّ مَا اجْتَمَعَ النَّاسُ عَلَيْهِ قَالَ أَبُو مُحَمَّد يَعْنِي قَوْلَ زَيْدٍ",
            "id": "Telah menceritakan kepada kami [Sa'id bin Al Mughirah] dari [Isa bin Yunus] dari [Isma'il] ia berkata; [Umar] berkata; Ambillah keputusan (tentang masalah warisan) kakek yang disepakati oleh orang-orang. Abu Muhammad bierkata; Maksudnya pendapat Zaid."
        },
        {
            "number": 2803,
            "arab": " حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ هَمَّامٍ عَنْ قَتَادَةَ أَنَّ زَيْدَ بْنَ ثَابِتٍ قَالَ فِي أُخْتٍ وَأُمٍّ وَزَوْجٍ وَجَدٍّ قَالَ جَعَلَهَا مِنْ سَبْعٍ وَعِشْرِينَ لِلْأُمِّ سِتَّةٌ وَلِلزَّوْجِ تِسْعَةٌ وَلِلْجَدِّ ثَمَانِيَةٌ وَلِلْأُخْتِ أَرْبَعَةٌ",
            "id": "Telah menceritakan kepada kami [Sa'id bin Amir] dari [Hammam] dari [Qatadah] bahwa [Zaid bin Tsabit] berkata dalam masalah bagian warisan seorang saudara perempuan, ibu, suami dan kakek. Ia melanjutkan; Ia menjadikan dari dua puluh tujuh (asal masalahnya dalam penghitungan dua puluh tujuh), ibu mendapat enam (bagian), suami mendapat sembilan (bagian), kakek mendapat delapan (bagian), dan seorang saudara perempuan mendapatkan empat (bagian)."
        },
        {
            "number": 2804,
            "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا الْأَشْعَثُ عَنْ ابْنِ سِيرِينَ عَنْ ابْنِ مَسْعُودٍ قَالَ إِنَّ أَوَّلَ جَدَّةٍ أُطْعِمَتْ فِي الْإِسْلَامِ سَهْمًا أَمُّ أَبٍ وَابْنُهَا حَيٌّ",
            "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Al Asy'ats] dari [Ibnu Sirin] dari [Ibnu Mas'ud] ia berkata; Sesungguhnya (posisi) nenek yang diberi bagian (warisan) dalam Islam adalah ibu dari seorang ayah, sedang anak laki-lakinya masih hidup."
        },
        {
            "number": 2805,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا شَرِيكٌ عَنْ لَيْثٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَطْعَمَ جَدَّةً سُدُسًا",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Syarik] dari [Laits] dari [Thawus] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam memberi bagian seperenam untuk nenek."
        },
        {
            "number": 2806,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ جُرَيْجٍ عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّ عُمَرَ وَرَّثَ جَدَّةً مَعَ ابْنِهَا",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Ibnu Juraij] dari [Ibrahim bin Maisarah] dari [Sa'id bin Al Musayyab] bahwa [Umar] memberi hak waris kepada nenek ketika bersama anak laki-lakinya."
        },
        {
            "number": 2807,
            "arab": " حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا شُعْبَةُ أَخْبَرَنِي مَنْصُورُ بْنُ الْمُعْتَمِرِ قَالَ سَمِعْتُ إِبْرَاهِيمَ قَالَ أَطْعَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثَ جَدَّاتٍ سُدُسًا قَالَ قُلْتُ لِإِبْرَاهِيمَ مَنْ هُنَّهْ قَالَ جَدَّتَاكَ مِنْ قِبَلِ أَبِيكَ وَجَدَّتُكَ مِنْ قِبَلِ أُمِّكَ",
            "id": "Telah menceritakan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Syu'bah] telah mengabarkan kepadaku [Manshur bin Al Mu'tamir] ia berkata; Aku pernah mendengar [Ibrahim] berkata; Rasulullah shallallahu 'alaihi wasallam memberi bagian seperenam untuk tiga nenek. Ia berkata; Aku bertanya kepada Ibrahim; Siapa mereka. Ia menjawab; Ia adalah dua nenek dari pihak ayahmu dan satu nenek dari pihak ibumu."
        },
        {
            "number": 2808,
            "arab": " حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا يَزِيدُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنِي الْحَسَنُ قَالَ تَرِثُ الْجَدَّةُ وَابْنُهَا حَيٌّ",
            "id": "Telah menceritakan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Yazid bin Ibrahim] ia berkata; Telah memberitakan kepadaku [Al Hasan] ia berkata; Nenek berhak mendapat warisan bila anak laki-lakinya masih hidup."
        },
        {
            "number": 2809,
            "arab": " حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ دَاوُدَ عَنْ الشَّعْبِيِّ قَالَ لَا تَرِثُ أُمُّ أَبِ الْأُمِّ ابْنُهَا الَّذِي تُدْلِي بِهِ لَا يَرِثُ فَكَيْفَ تَرِثُ هِيَ",
            "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Salamah] dari [Dawud] dari [Asy Sya'bi] ia berkata; Ibu dari ayahnya ibu tidak dapat hak waris. Anaknya yang menjadikan ibu dari ayahnya ibu memiliki hubungan dengan mayit tidak dapat hak waris, bagaimana dengannya (apakah menerima warisan)? "
        },
        {
            "number": 2810,
            "arab": "أَخْبَرَنَا أَبُو مَعْمَرٍ عَنْ إِسْمَعِيلَ ابْنِ عُلَيَّةَ عَنْ سَلَمَةَ بْنِ عَلْقَمَةَ عَنْ حُمَيْدِ بْنِ هِلَالٍ عَنْ أَبِي الدَّهْمَاءِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ تَرِثُ الْجَدَّةُ وَابْنُهَا حَيٌّ",
            "id": "Telah mengabarkan kepada kami [Abu Ma'mar] dari [Isma'il bin 'Ulaiyah] dari [Salamah bin 'Alqamah] dari [Humaid bin Hilal] dari [Abu Ad Dahma`] dari [Imran bin Hushain] ia berkata; Nenek berhak mendapat warisan bila anaknya masih hidup."
        },
        {
            "number": 2811,
            "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا الْأَشْعَثُ عَنْ الزُّهْرِيِّ قَالَ جَاءَتْ إِلَى أَبِي بَكْرٍ جَدَّةٌ أُمُّ أَبٍ أَوْ أُمُّ أُمٍّ فَقَالَتْ إِنَّ ابْنَ ابْنِي أَوْ ابْنَ ابْنَتِي تُوُفِّيَ وَبَلَغَنِي أَنَّ لِي نَصِيبًا فَمَا لِي فَقَالَ أَبُو بَكْرٍ مَا سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِيهَا شَيْئًا وَسَأَسْأَلُ النَّاسَ فَلَمَّا صَلَّى الظُّهْرَ قَالَ أَيُّكُمْ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي الْجَدَّةِ شَيْئًا فَقَالَ الْمُغِيرَةُ بْنُ شُعْبَةَ أَنَا قَالَ مَاذَا قَالَ أَعْطَاهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُدُسًا قَالَ أَيَعْلَمُ ذَاكَ أَحَدٌ غَيْرُكَ فَقَالَ مُحَمَّدُ بْنُ مَسْلَمَةَ صَدَقَ فَأَعْطَاهَا أَبُو بَكْرٍ السُّدُسَ فَجَاءَتْ إِلَى عُمَرَ مِثْلُهَا فَقَالَ مَا أَدْرِي مَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهَا شَيْئًا وَسَأَسْأَلُ النَّاسَ فَحَدَّثُوهُ بِحَدِيثِ الْمُغِيرَةِ بْنِ شُعْبَةَ وَمُحَمَّدِ بْنِ مَسْلَمَةَ فَقَالَ عُمَرُ أَيُّكُمَا خَلَتْ بِهِ فَلَهَا السُّدُسُ فَإِنْ اجْتَمَعْتُمَا فَهُوَ بَيْنَكُمَا",
            "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Al Asy'ats] dari [Az Zuhri] ia berkata; Seorang nenek dari ibunya ayah atau ibunya ibu datang menemui Abu Bakr dan berkata; Sesungguhnya anak laki-laki dari anak laki-lakiku atau anak laki-laki dari anak perempuanku telah meninggal dan telah sampai kepadaku bahwa aku mendapatkan bagian harta warisannya, maka berapakah bagianku? Abu Bakr berkata; Aku belum pernah mendengar Rasulullah shallallahu 'alaihi wasallam memberikan kepada seorang nenek sedikitpun, aku akan bertanya kepada orang lain! Setelah dia selesai melaksanakan shalat dzuhur, dia bertanya: siapakah di antara kalian yang mendengar Rasulullah shallallahu 'alaihi wasallam telah memberikan seorang nenek dari bagian harta warisan? [Maka Al Mughirah bin Syu'bah] berkata: Saya! Dia berkata: Berapa? Al Mughirah menjawab: Rasulullah shallallahu 'alaihi wasallam memberikannya seperenam. Dia bertanya lagi: adakah orang lain selain kamu yang mengetahuinya? Maka [Muhammad bin Maslamah] berkata: Iya, dia benar! Maka Abu Bakar memberikan nenek tersebut seperenam. Kemudian datang kepada Umar seperti yang datang kepada Abu Bakar, lalu Umar berkata: aku tidak mengetahui dan tidak pernah mendengar bahwa Rasulullah shallallahu 'alaihi wasallam memberikan seorang nenek-nenek dari harta warisan, tapi aku akan bertanya kepada orang-orang! Maka mereka memberitahukan kepadanya tentang hadits Al Mughirah bin Syu'bah dan Muhammad bin Maslamah. Maka Umar berkata: siapa yang di antara kalian berdua yang (keberadaannya) sendiri ketika pembagian warisan, maka seperenam itu untuknya, dan apabila berdua maka seperenam untuk kalian berdua."
        },
        {
            "number": 2812,
            "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا الْأَشْعَثُ عَنْ الشَّعْبِيِّ عَنْ عَلِيٍّ وَزَيْدٍ قَالَا إِذَا كَانَتْ الْجَدَّاتُ سَوَاءً وَرِثَ ثَلَاثُ جَدَّاتٍ جَدَّتَا أَبِيهِ أُمُّ أُمِّهِ وَأُمُّ أَبِيهِ وَجَدَّةُ أُمِّهِ فَإِنْ كَانَتْ إِحَدَاهُنَّ أَقْرَبَ فَالسَّهْمُ لِذَوِي الْقُرْبَى",
            "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Asy'ats] dari [Asy Sya'bi] dari [Ali] dan [Zaid] keduanya berkata; Jika beberapa nenek memiliki kedudukan yang sama maka tiga orang nenek mendapat hak waris. Yaitu dua dari nenek ayah; Ibu dari ibunya ayah dan ibu dari ayahnya ayah dan nenek ibunya. Jika salah seorang dari mereka itu lebih dekat, maka bagian diberikan kepada yang terdekat."
        },
        {
            "number": 2813,
            "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا حَسَنٌ عَنْ أَشْعَثَ عَنْ الشَّعْبِيِّ عَنْ عَلِيٍّ وَزَيْدٍ أَنَّهُمَا كَانَا لَا يُوَرِّثَانِ الْجَدَّةَ أُمَّ الْأَبِ مَعَ الْأَبِ",
            "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Hasan] dari [Asy'ats] dari [Asy Sya'bi] dari [Ali] dan [Zaid] bahwa mereka berdua tidak memberikan hak waris kepada nenek, yakni ibu dari ayah, ketika bersama ayah."
        },
        {
            "number": 2814,
            "arab": " حَدَّثَنَا سَعِيدُ بْنُ الْمُغِيرَةِ عَنْ ابْنِ الْمُبَارَكِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ أَنَّ عُثْمَانَ كَانَ لَا يُوَرِّثُ الْجَدَّةَ وَابْنُهَا حَيٌّ",
            "id": "Telah menceritakan kepada kami [Sa'id bin Al Mughirah] dari [Ibnu Al Mubarak] dari [Ma'mar] dari [Az Zuhri] bahwa [Utsman] tidak memberi hak waris kepada nenek jika anaknya masih hidup."
        },
        {
            "number": 2815,
            "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا الْأَشْعَثُ عَنْ ابْنِ سِيرِينَ عَنْ ابْنِ مَسْعُودٍ قَالَ إِنَّ الْجَدَّاتِ لَيْسَ لَهُنَّ مِيرَاثٌ إِنَّمَا هِيَ طُعْمَةٌ أُطْعِمْنَهَا وَالْجَدَّاتُ أَقْرَبُهُنَّ وَأَبْعَدُهُنَّ سَوَاءٌ",
            "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Asy'ats] dari [Ibnu Sirin] dari [Ibnu Mas'ud] ia berkata; Sesungguhnya para nenek tidak memiliki hak waris, namun hanya ibarat makanan yang diberikan kepada mereka. Para nenek yang dekat dan yang jauh adalah sama."
        },
        {
            "number": 2816,
            "arab": " أَخْبَرَنَا حَجَّاجُ بْنُ مِنْهَالٍ أَخْبَرَنَا أَبُو عَوَانَةَ عَنْ الْمُغِيرَةِ عَنْ إِبْرَاهِيمَ قَالَ قَالَ عَبْدُ اللَّهِ تَرِثُ الْجَدَّةُ وَابْنُهَا حَيٌّ",
            "id": "Telah mengabarkan kepada kami [Hajjaj bin Minhal] telah mengabarkan kepada kami [Abu 'Awanah] dari [Al Mughirah] dari [Ibrahim] ia berkata; [Abdullah] berkata; Nenek mendapat warisan jika anaknya masih hidup."
        },
        {
            "number": 2817,
            "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا الْأَشْعَثُ عَنْ الشَّعْبِيِّ قَالَ جِئْنَ أَرْبَعُ جَدَّاتٍ يَتَسَاوَقْنَ إِلَى مَسْرُوقٍ فَأَلْقَى أَمَّ أَبِ الْأَبِ وَوَرَّثَ ثَلَاثًا جَدَّتَيْ أَبِيهِ أُمَّ أُمِّهِ وَأُمَّ أَبِيهِ وَجَدَّةَ أُمِّهِ",
            "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Asy'ats] dari [Asy Sya'bi] ia berkata; Empat orang nenek berjalan sambil berdesak-desakan mendatangi [Masruq]. Maka ia (memutuskan) tidak memberikan hak waris kepada satu nenek (ibu dari ayahnya ayah), namun ia memberi hak waris kepada tiga nenek (yang lain); Dua nenek dari ayahnya, yaitu ibu dari ibunya dan ibu dari ayahnya, dan nenek dari ibunya."
        },
        {
            "number": 2818,
            "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا شَرِيكٌ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَبْدِ اللَّهِ فِي ابْنَةٍ وَابْنَةِ ابْنٍ قَالَ النِّصْفُ وَالسُّدُسُ وَمَا بَقِيَ فَرَدٌّ عَلَى الْبِنْتِ",
            "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Syarik] dari [Al A'masy] dari [Ibrahim] dari [Abdullah] tentang anak perempuan dan anak perempuan dari anak perempuan (cucu). Ia berkata; Setengah dan seperenam, sedangkan yang tersisa dikembalikan kepada anak perempuan."
        },
        {
            "number": 2819,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ أَنَّهُ أُتِيَ فِي إِخْوَةٍ لِأُمٍّ وَأُمٍّ فَأَعْطَى الْإِخْوَةَ مِنْ الْأُمِّ الثُّلُثَ وَالْأُمَّ سَائِرَ الْمَالِ وَقَالَ الْأُمُّ عَصَبَةُ مَنْ لَا عَصَبَةَ لَهُ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Ibrahim] dari ['Alqamah] dari [Abdullah] bahwa ia pernah ditanya tentang saudara laki-laki seibu dan ibu. Maka ia memberikan bagian saudara laki-laki seibu sepertiga dan ibu mendapat (sisa) seluruh harta warisan. Ia berkata lagi; Ibu adalah ashabah orang yang tidak memiliki ashabah."
        },
        {
            "number": 2820,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا حَسَنٌ عَنْ أَبِيهِ قَالَ سَأَلْتُ الشَّعْبِيَّ عَنْ رَجُلٍ مَاتَ وَتَرَكَ ابْنَتَهُ لَا يُعْلَمُ لَهُ وَارِثٌ غَيْرُهَا قَالَ لَهَا الْمَالُ كُلُّهُ",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Hasan] dari [ayahnya] ia berkata; Aku bertanya kepada [Asy Sya'bi] tentang seorang laki-laki yang meninggal dunia dan meninggalkan anak perempuan. Tidak diketahui ada ahli waris lain selain anak perempuan tersebut. Asy Sya'bi berkata; Seluruh harta tersebut untuknya."
        },
        {
            "number": 2821,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ مُحَمَّدِ بْنِ سَالِمٍ عَنْ الشَّعْبِيِّ أَنَّ ابْنَ مَسْعُودٍ كَانَ لَا يَرُدُّ عَلَى أَخٍ لِأُمٍّ مَعَ أُمٍّ وَلَا عَلَى جَدَّةٍ إِذَا كَانَ مَعَهَا غَيْرُهَا مَنْ لَهُ فَرِيضَةٌ وَلَا عَلَى ابْنَةِ ابْنٍ مَعَ ابْنَةِ الصُّلْبِ وَلَا عَلَى امْرَأَةٍ وَزَوْجٍ وَكَانَ عَلِيٌّ يَرُدُّ عَلَى كُلِّ ذِي سَهْمٍ إِلَّا الْمَرْأَةَ وَالزَّوْجَ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Muhammad bin Salim] dari [Asy Sya'bi] bahwa [Ibnu Mas'ud] tidak mengembalikan sisa harta warisan kepada saudara laki-laki seibu yang ada bersama-sama dengan ibu, tidak mengembalikannya kepada nenek jika bersama ahli waris lain yang memiliki bagian yang sudah ditetapkan, tidak membagikan kepada anak perempuan dari anak laki-laki jika bersama anak perempuan kandung dan tidak membagikan kepada isteri dan suami. Sedangkan [Ali] mengembalikan harta (sisa harta yang telah dibagikan) kepada seluruh orang yang memiliki bagian kecuali isteri dan suami."
        },
        {
            "number": 2822,
            "arab": " أَخْبَرَنَا مُحَمَّدٌ حَدَّثَنَا سُفْيَانُ قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ سَالِمٍ عَنْ خَارِجَةَ بْنِ زَيْدٍ عَنْ زَيْدِ بْنِ ثَابِتٍ أَنَّهُ أُتِيَ فِي ابْنَةٍ أَوْ أُخْتٍ فَأَعْطَاهَا النِّصْفَ وَجَعَلَ مَا بَقِيَ فِي بَيْتِ الْمَالِ و قَالَ يَزِيدُ بْنُ هَارُونَ عَنْ مُحَمَّدِ بْنِ سَالِمٍ عَنْ الشَّعْبِيِّ عَنْ خَارِجَةَ",
            "id": "Telah mengabarkan kepada kami [Muhammad] telah menceritakan kepada kami [Sufyan] ia berkata; telah mengabarkan kepadaku [Muhammad bin Salim] dari [Kharijah bin Zaid] dari [Zaid bin Tsabit] bahwa ia pernah ditanya tentang anak perempuan atau saudara perempuan. Maka ia memberikan setengah kepadanya dan memasukkan warisan yang tersisa ke dalam Baitul Mal. [Yazid bin Harun] berkata; Dari [Muhammad bin Salim] dari [Asy Sya'bi] dari [Kharijah]."
        },
        {
            "number": 2823,
            "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ عَنْ عَلِيِّ بْنِ مُسْهِرٍ عَنْ سَعِيدٍ عَنْ أَبِي مَعْشَرٍ عَنْ إِبْرَاهِيمَ عَنْ عَبْدِ اللَّهِ قَالَ فِي ابْنِ الْمُلَاعَنَةِ قَالَ مِيرَاثُهُ لِأُمِّهِ",
            "id": "Telah mengabarkan kepada kami Muhammad bin Uyainah dari Ali bin Mushir dari Sa'id dari Abu Ma'syar dari Ibrahim dari Abdullah ia berkata tentang anak laki-laki dari seorang wanita yang terkena li'an; Warisannya untuk ibunya."
        },
        {
            "number": 2824,
            "arab": " أَخْبَرَنَا مُعَاذُ بْنُ هَانِئٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ طَهْمَانَ قَالَ سَمِعْتُ رَجُلًا سَأَلَ عَطَاءَ بْنَ أَبِي رَبَاحٍ عَنْ وَلَدِ الْمُتَلَاعِنَيْنِ لِمَنْ مِيرَاثُهُ قَالَ لِأُمِّهِ وَأَهْلِهَا",
            "id": "Telah mengabarkan kepada kami [Mu'adz bin Hani] telah menceritakan kepada kami [Ibrahim bin Thahman] ia berkata; Aku mendengar [seseorang] bertanya kepada ['Atha` bin Abu Rabah] tentang anak dari suami isteri yang melakukan li'an untuk siapa warisannya? Ia menjawab; Untuk ibunya dan keluarga ibu."
        },
        {
            "number": 2825,
            "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا حَسَنٌ عَنْ أَبِي سَهْلٍ عَنْ الشَّعْبِيِّ قَالَ قَالَ عَلِيٌّ فِي ابْنِ الْمُلَاعَنَةِ تَرَكَ أَخَاهُ لِأُمِّهِ وَأُمَّهُ لِأَخِيهِ السُّدُسُ وَلِأُمِّهِ الثُّلُثُ ثُمَّ يُرَدُّ عَلَيْهِمْ فَيَصِيرُ لِلْأَخِ الثُّلُثُ وَلِلْأُمِّ الثُّلُثَانِ و قَالَ ابْنُ مَسْعُودٍ لِأَخِيهِ السُّدُسُ وَمَا بَقِيَ فَلِلْأُمِّ",
            "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Hasan] dari [Abu Sahl] dari [Asy Sya'bi] ia berkata; [Ali] berkata tentang anak dari seorang wanita yang terkena li'an, ia meninggalkan saudara laki-laki seibu dan ibu. Saudara laki-laki mendapat seperenam dan ibu mendapat sepertiga. Kemudian sisa harta warisan dibagikan lagi kepada mereka berdua (saudara laki-laki seibu dan ibu), maka saudara lai-laki mendapat sepertiga dan ibu mendapat dua pertiga (dari sisa harta warisan yang dibagikan kembali). Dalam riwayat lain [Ibnu Mas'ud] berkata; Saudara laki-laki mendapat seperenam dan warisan yang tersisa untuk ibu."
        },
        {
            "number": 2826,
            "arab": "أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا حَسَنٌ عَنْ أَبِي سَهْلٍ عَنْ الشَّعْبِيِّ فِي ابْنِ الْمُلَاعَنَةِ تَرَكَ ابْنَ أَخٍ وَجَدًّا قَالَ الْمَالُ لِابْنِ الْأَخِ",
            "id": "Telah mengabarkan kepada kami Abu Nu'aim telah menceritakan kepada kami Hasan dari Abu Sahl dari Asy Sya'bi tentang anak laki-laki dari seorang wanita yang terkena li'an, ia meninggalkan seorang anak laki-laki dari saudara laki-laki dan kakek, ia berkata; Harta itu untuk anak laki-laki dari saudara laki-laki."
        },
        {
            "number": 2827,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا سَالِمُ بْنُ نُوحٍ عَنْ عُمَرَ بْنِ عَامِرٍ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ زَيْدِ بْنِ ثَابِتٍ فِي مِيرَاثِ ابْنِ الْمُلَاعَنَةِ لِأُمِّهِ الثُّلُثُ وَالثُّلُثَانِ لِبَيْتِ الْمَالِ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Salim bin Nuh] dari [Umar bin Amir] dari [Qatadah] dari [Sa'id bin Al Musayyab] dari [Zaid bin Tsabit] tentang warisan anak laki-laki dari seorang wanita yang terkena li'an; Untuk ibu sepertiga dan dua pertiga untuk Baitul Mal."
        },
        {
            "number": 2828,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا سَالِمُ بْنُ نُوحٍ عَنْ عُمَرَ بْنِ عَامِرٍ عَنْ حَمَّادٍ عَنْ إِبْرَاهِيمَ عَنْ عَبْدِ اللَّهِ قَالَ مِيرَاثُهُ لِأُمِّهِ تَعْقِلُ عَنْهُ عَصَبَةُ أُمِّهِ و قَالَ قَتَادَةُ عَنْ الْحَسَنِ لِأُمِّهِ الثُّلُثُ وَبَقِيَّةُ الْمَالِ لِعَصَبَةِ أُمِّهِ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Salim bin Nuh] dari [Umar bin Amir] dari [Hammad] dari [Ibrahim] dari [Abdullah] ia berkata; Warisannya diberikan untuk ibu, sebab yang membayar diyat adalah ashabah ibunya. Dalam riwayat lain [Qatadah] berkata; dari [Al Hasan]; Untuk ibunya sepertiga dan sisa harta untuk ashabah ibu."
        },
        {
            "number": 2829,
            "arab": " أَخْبَرَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ أَخْبَرَنَا قَتَادَةُ أَنَّ عَلِيًّا وَابْنَ مَسْعُودٍ قَالَا فِي وَلَدِ مُلَاعَنَةٍ تَرَكَ جَدَّتَهُ وَإِخْوَتَهُ لِأُمِّهِ قَالَ لِلْجَدَّةِ الثُّلُثُ وَلِلْإِخْوَةِ الثُّلُثَانِ و قَالَ زَيْدُ بْنُ ثَابِتٍ لِلْجَدَّةِ السُّدُسُ وَلِلْإِخْوَةِ لِلْأُمِّ الثُّلُثُ وَمَا بَقِيَ فَلِبَيْتِ الْمَالِ",
            "id": "Telah mengabarkan kepada kami [Hajjaj bin Al Minhal] telah menceritakan kepada kami [Hammad bin Salamah] telah mengabarkan kepada kami [Qatadah] bahwa [Ali] dan [Ibnu Mas'ud] keduanya berkata tentang anak dari seorang wanita yang terkena li'an, ia meninggalkan nenek dan beberapa saudara laki-laki seibu; Ia berkata; Untuk nenek sepertiga dan untuk para saudara laki-laki seibu dua pertiga. Dalam riwayat lain [Zaid bin Tsabit] berkata; Nenek mendapatkan seperenam, para saudara laki-laki seibu mendapat sepertiga dan harta warisan yang tersisa untuk Baitul Mal."
        },
        {
            "number": 2830,
            "arab": "حَدَّثَنَا حَجَّاجٌ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا يُونُسُ وَحُمَيدٌ عَنْ الْحَسَنِ قَالَ تَرِثُهُ أُمُّهُ يَعْنِي ابْنَ الْمُلَاعَنَةِ",
            "id": "Telah menceritakan kepada kami Hajjaj telah menceritakan kepada kami Hammad telah mengabarkan kepada kami Yunus dan Humaid dari Al Hasan ia berkata; Ibunya berhak memperoleh warisannya, yakni dari ayahnya (ayah anak dari seorang wanita yang terkena li'an)."
        },
        {
            "number": 2831,
            "arab": " أَخْبَرَنَا حَجَّاجٌ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا حَجَّاجٌ أَنَّ النَّخَعِيَّ وَالشَّعْبِيَّ قَالَا تَرِثُهُ أُمُّهُ",
            "id": "Telah mengabarkan kepada kami [Hajjaj] telah menceritakan kepada kami [Hammad] telah menceritakan kepada kami [Hajjaj] bahwa [An Nakha'i] dan [Asy Sya'bi] keduanya berkata; Ibunya berhak mendapat warisannya."
        },
        {
            "number": 2832,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ بْنِ عُمَيْرٍ قَالَ كَتَبْتُ إِلَى أَخٍ لِي مِنْ بَنِي زُرَيْقٍ أَسْأَلُهُ لِمَنْ قَضَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ابْنِ الْمُلَاعَنَةِ فَكَتَبَ إِلَيَّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى بِهِ لِأُمِّهِ هِيَ بِمَنْزِلَةِ أُمِّهِ وَأَبِيهِ و قَالَ سُفْيَانُ الْمَالُ كُلُّهُ لِلْأُمِّ هِيَ بِمَنْزِلَةِ أَبِيهِ وَأُمِّهِ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Daud bin Abu Hind] dari [Abdullah bin Ubaid bin Umair] ia berkata; Aku pernah menulis surat kepada [saudara laki-lakiku] dari banu Zuraiq untuk menanyakan keputusan Nabi shallallahu 'alaihi wasallam dalam masalah anak seorang wanita yang terkena li'an, untuk siapa harta itu? (Maka ia membalas suratku); Sesungguhnya Rasulullah shallallahu 'alaihi wasallam memutuskan warisannya diberikan kepada ibunya, ibu itu menempati posisi ibu dan ayahnya. Sufyan berkata; Seluruh harta untuk ibu karena ia menempati posisi ayah dan ibunya."
        },
        {
            "number": 2833,
            "arab": "أَخْبَرَنَا مُحَمَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ هِشَامٍ عَنْ الْحَسَنِ فِي ابْنِ الْمُلَاعَنَةِ تَرَكَ أُمَّهُ وَعَصَبَةَ أُمِّهِ قَالَ الثُّلُثُ لِأُمِّهِ وَمَا بَقِيَ فَلِعَصَبَةِ أُمِّهِ",
            "id": "Telah mengabarkan kepada kami Muhammad telah menceritakan kepada kami Sufyan dari Hisyam dari Al Hasan tentang anak seorang wanita yang terkena li'an, ia meninggalkan ibu dan ashabah ibu, ia berkata; Sepertiga untuk ibu dan yang tersisa untuk ashabah ibu."
        },
        {
            "number": 2834,
            "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ ابْنِ أَبِي لَيْلَى عَنْ عَامِرٍ عَنْ عَلِيٍّ وَعَبْدِ اللَّهِ فِي ابْنِ الْمُلَاعَنَةِ قَالَا عَصَبَتُهُ عَصَبَةُ أُمِّهِ",
            "id": "Telah mengabarkan kepada kami [Ubaidullah bin Musa] dari [Ibnu Abu Laila] dari [Amir] dari [Ali] dan [Abdullah] tentang anak seorang wanita yang terkena li'an, keduanya berkata; Ashabahnya adalah ashabah ibunya."
        },
        {
            "number": 2835,
            "arab": " حَدَّثَنَا أَبُو الْوَلِيدِ الْحَلَبِيُّ مُوسَى بْنُ خَالِدٍ حَدَّثَنَا مُعْتَمِرٌ عَنْ يُونُسَ عَنْ الْحَسَنِ أَنَّهُ كَانَ يَقُولُ مِيرَاثُ وَلَدِ الْمُلَاعَنَةِ لِأُمِّهِ قُلْتُ فَإِنْ كَانَ لَهُ أَخٌ مِنْ أُمِّهِ قَالَ لَهُ السُّدُسُ",
            "id": "Telah menceritakan kepada kami [Abu Al Walid Al Halabi Musa bin Khalid] telah menceritakan kepada kami [Mu'tamir] dari [Yunus] dari [Al Hasan] bahwa ia berkata; Warisan anak seorang wanita yang terkena li'an untuk ibunya. Aku bertanya; Jika ia memiliki saudara laki-laki dari ibunya? Ia menjawab; Ia (saudara laki-laki) mendapat seperenam."
        },
        {
            "number": 2836,
            "arab": " حَدَّثَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنَا الزُّهْرِيُّ قَالَ وَلَدُ الْمُلَاعَنَةِ لِأُمِّهِ تَرِثُ فَرِيضَتَهَا مِنْهُ وَسَائِرُ ذَلِكَ فِي بَيْتِ الْمَالِ",
            "id": "Telah menceritakan kepada kami [Abu Al Mughirah] telah menceritakan kepada kami [Al Auza'i] telah menceritakan kepada kami [Az Zuhri] ia berkata; Harta warisan anak seorang wanita yang melakukan li'an berhak diwarisi ibunya. Ibunya memperoleh warisan sesuai dengan bagian yang telah ditetapkan untuknya, sedangkan sisanya dimasukkan ke dalam Baitul Mal."
        },
        {
            "number": 2837,
            "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ مُوسَى بْنِ عُبَيْدَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ إِذَا تَلَاعَنَا فُرِّقَ بَيْنَهُمَا وَلَمْ يَجْتَمِعَا وَدُعِيَ الْوَلَدُ لِأُمِّهِ يُقَالُ ابْنُ فُلَانَةَ هِيَ عَصَبَتُهُ يَرِثُهَا وَتَرِثُهُ وَمَنْ دَعَاهُ لِزِنْيَةٍ جُلِدَ",
            "id": "Telah mengabarkan kepada kami Ubaidullah bin Musa dari Musa bin Ubaidah dari Nafi' dari Ibnu Umar ia berkata; Jika suami isteri melakukan li'an, maka keduanya harus diceraikan dan tidak boleh berkumpul lagi, sedangkan anaknya dinisbatkan kepada ibunya. Anak tersebut dipanggil; Anak fulanah (anak si ibu). Ibunya adalah ashabah, anak itu berhak mewarisi warisan ibunya dan ibunya berhak mewarisi warisan anak itu. Barangsiapa yang memanggilnya anak zina, maka ia harus didera."
        },
        {
            "number": 2838,
            "arab": "حَدَّثَنَا مُعَاذُ بْنُ هَانِئٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ طَهْمَانَ حَدَّثَنَا الشَّيْبَانِيُّ عَنْ الشَّعْبِيِّ فِي وَلَدِ الْمُتَلَاعِنَيْنِ أَنَّهُ تَرِثُهُ عَصَبَةُ أُمِّهِ وَهُمْ يَعْقِلُونَ عَنْهُ",
            "id": "Telah menceritakan kepada kami Mu'adz bin Hani` telah menceritakan kepada kami Ibrahim bin Thahman telah menceritakan kepada kami Asy Syaibani dari Asy Sya'bi tentang anak dari suami isteri yang melakukan li'an; Bahwa ashabah ibunya memperoleh warisannya, sebab mereka yang membayar diyatnya."
        },
        {
            "number": 2839,
            "arab": "حَدَّثَنَا سَهْلُ بْنُ حَمَّادٍ أَخْبَرَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ عَزْرَةَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ فِي وَلَدِ الْمُلَاعَنَةِ هُوَ الَّذِي لَا أَبَ لَهُ تَرِثُهُ أُمُّهُ وَإِخْوَتُهُ مِنْ أُمِّهِ وَعَصَبَةُ أُمِّهِ فَإِنْ قَذَفَهُ قَاذِفٌ جُلِدَ قَاذِفُهُ",
            "id": "Telah menceritakan kepada kami Sahl bin Hammad telah mengabarkan kepada kami Hammam dari Qatadah dari 'Azrah dari Sa'id bin Jubair dari Ibnu Abbas tentang anak seorang wanita yang melakukan li'an, yakni anak yang tidak memiliki ayah. Yang memperoleh warisannya adalah ibunya, para saudara laki-laki seibu dan ashabah ibu. Jika ada orang yang menuduhnya anak zina maka orang yang menuduh itu harus didera."
        },
        {
            "number": 2840,
            "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُبَارَكِ حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ عَنْ النُّعْمَانِ عَنْ مَكْحُولٍ أَنَّهُ سُئِلَ عَنْ مِيرَاثِ وَلَدِ الْمُلَاعَنَةِ لِمَنْ هُوَ قَالَ جَعَلَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأُمِّهِ فِي سَبَبِهِ لِمَا لَقِيَتْ مِنْ الْبَلَاءِ وَلِإِخْوَتِهِ مِنْ أُمِّهِ و قَالَ مَكْحُولٌ فَإِنْ مَاتَتْ الْأُمُّ وَتَرَكَتْ ابْنَهَا ثُمَّ تُوُفِّيَ ابْنُهَا الَّذِي جُعِلَ لَهَا كَانَ مِيرَاثُهُ لِإِخْوَتِهِ مِنْ أُمِّهِ كُلُّهُ لِأَنَّهُ كَانَ لِأُمِّهِمْ وَجَدِّهِمْ وَكَانَ لِأَبِيهَا السُّدُسُ مِنْ ابْنِ ابْنَتِهِ وَلَيْسَ يَرِثُ الْجَدُّ إِلَّا فِي هَذِهِ الْمَنْزِلَةِ لِأَنَّهُ إِنَّمَا هُوَ أَبُ الْأُمِّ وَإِنَّمَا وَرِثَ الْإِخْوَةُ مِنْ الْأُمِّ أُمَّهُمْ وَوَرِثَ الْجَدُّ ابْنَتَهُ لِأَنَّهُ جُعِلَ لَهَا فَالْمَالُ الَّذِي لِلْوَلَدِ لِوَرَثَةِ الْأُمِّ وَهُوَ يُحْرِزُهُ الْجَدُّ وَحْدَهُ إِذَا لَمْ يَكُنْ غَيْرُهُ",
            "id": "Telah mengabarkan kepada kami Muhammad bin Al Mubarak telah menceritakan kepada kami Yahya bin Hamzah dari An Nu'man dari Makhul bahwa ia pernah ditanya tentang warisan anak seorang wanita yang melakukan li'an, untuk siapa hartanya? Ia menjawab; Rasulullah shallallahu 'alaihi wasallam memberikan (warisan itu) untuk ibunya, sebab iia (ibu) yang menanggung ujian tersebut, dan untuk para saudara laki-lakinya dari ibu. Makhul berkata; Jika ibunya meninggal dan meninggalkan anak laki-laki. Kemudian anak yang membuat ibunya mendapatkan warisan meninggal, maka semua warisannya untuk saudaranya seibu karena warisan itu seharusnya untuk ibu mereka dan kakek mereka, dan bagi bapaknya ibu (kakek) mendapat seperenam dari warisan cucu laki-lakinya dari anak perempuannya, dan seorang kakek dari ibu tidak mendapatkan warisan kecuali dalam posisi ini karena dia adalah bapak dari pihak ibu. Dan sebab saudara seibu mendapatkan warisan adalah karena ibu mereka. Sesungguhnya saudara laki-laki dari ibu hanyalah mewariskan kepada ibu-ibu mereka, dan kakek hanya mewariskan kepada anak perempuannya karena harta itu diperuntukkan kepadanya. Adapun harta yang ada pada anak untuk bagian warisan ibunya, maka menghalangi kakek untuk mendapatkannya jika seorang diri."
        },
        {
            "number": 2841,
            "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ قَوْمًا اخْتَصَمُوا إِلَى عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ فِي وَلَدِ الْمُتَلَاعِنَيْنِ فَجَاءَ عَصَبَةُ أَبِيهِ يَطْلُبُونَ مِيرَاثَهُ فَقَالَ إِنَّ أَبَاهُ كَانَ تَبَرَّأَ مِنْهُ فَلَيْسَ لَكُمْ مِنْ مِيرَاثِهِ شَيْءٌ فَقَضَى بِمِيرَاثِهِ لِأُمِّهِ وَجَعَلَهَا عَصَبَتَهُ",
            "id": "Telah mengabarkan kepada kami Muhammad bin Al 'Ala` telah menceritakan kepada kami Yahya bin Abu Bukair telah menceritakan kepada kami Ibrahim bin Thahman dari Simak bin Harb dari Ikrimah dari Ibnu Abbas bahwa ada suatu kaum (beberapa orang) yang mengadukan masalah kepada Ali radlyallahu 'anhu tentang warisan anak seorang wanita yang melakukan li'an. Lalu ashabah ayahnya datang meminta bagian harta warisan. Maka ia menjawab; Sesungguhnya ayahnya telah melepaskan tanggung jawab darinya, maka kalian tidak berhak mendapat sedikit pun dari harta warisannya. Lalu ia memutuskan bahwa harta warisan anak itu untuk ibunya dan menjadikan ibu sebagai ashabah."
        },
        {
            "number": 2842,
            "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ إِسْرَائِيلَ عَنْ عَبْدِ الْأَعْلَى أَنَّهُ سَمِعَ مُحَمَّدَ بْنَ عَلِيٍّ يُحَدِّثُ عَنْ عَلِيٍّ فِي الرَّجُلِ يَكُونُ لَهُ مَا لِلرَّجُلِ وَمَا لِلْمَرْأَةِ مِنْ أَيِّهِمَا يُوَرَّثُ فَقَالَ مِنْ أَيِّهِمَا بَالَ",
            "id": "Telah mengabarkan kepada kami [Ubaidullah bin Musa] dari [Isra`il] dari [Abdul A'la] bahwa ia mendengar [Muhammad bin Ali] menceritakan dari [Ali] tentang seorang laki-laki yang memiliki alat kelamin laki-laki dan alat kelamin perempuan, sebagai apa statusnya ia mewarisi (laki-laki atau perempuan)? Ia menjawab; Dilihat dari alat kelaminnya yang mengeluarkan kencing (dari situlah ditetapkan statusnya)."
        },
        {
            "number": 2843,
            "arab": " حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا هُشَيْمٌ عَنْ مُغِيرَةَ عَنْ شِبَاكٍ عَنْ الشَّعْبِيِّ عَنْ عَلِيٍّ فِي الْخُنْثَى قَالَ يُوَرَّثُ مِنْ قِبَلِ مَبَالِهِ",
            "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Husyaim] dari [Mughirah] dari [Syibak] dari [Asy Sya'bi] dari [Ali] tentang khuntsa, ia berkata; Ia diberi warisan berdasarkan tempat keluarnya air kencing. "
        },
        {
            "number": 2844,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا أَبُو هَانِئٍ قَالَ سُئِلَ عَامِرٌ عَنْ مَوْلُودٍ وُلِدَ وَلَيْسَ بِذَكَرٍ وَلَا أُنْثَى لَيْسَ لَهُ مَا لِلذَّكَرِ وَلَيْسَ لَهُ مَا لِلْأُنْثَى يُخْرِجُ مِنْ سُرَّتِهِ كَهَيْئَةِ الْبَوْلِ وَالْغَائِطِ سُئِلَ عَنْ مِيرَاثِهِ فَقَالَ نِصْفُ حَظِّ الذَّكَرِ وَنِصْفُ حَظِّ الْأُنْثَى",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Abu Hani`] ia berkata; [Amir] pernah ditanya tentang warisan seorang anak yang melahirkan tanpa alat kelamin laki-laki dan alat kelamin perempuan, sementara dari pusarnya keluar sesuatu seperti air kencing dan kotoran. Maka ia menjawab; (Bagian warisannya adalah) setengah dari bagian laki-laki dan setengah dari bagian perempuan."
        },
        {
            "number": 2845,
            "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا عَاصِمٌ عَنْ الشَّعْبِيِّ قَالَ سُئِلَ أَبُو بَكْرٍ عَنْ الْكَلَالَةِ فَقَالَ إِنِّي سَأَقُولُ فِيهَا بِرَأْيِي فَإِنْ كَانَ صَوَابًا فَمِنْ اللَّهِ وَإِنْ كَانَ خَطَأً فَمِنِّي وَمِنْ الشَّيْطَانِ أُرَاهُ مَا خَلَا الْوَالِدَ وَالْوَلَدَ فَلَمَّا اسْتُخْلِفَ عُمَرُ قَالَ إِنِّي لَأَسْتَحْيِي اللَّهَ أَنْ أَرُدَّ شَيْئًا قَالَهُ أَبُو بَكْرٍ",
            "id": "Telah menceritakan kepada kami [Yazid bin Harun] telah menceritakan kepada kami ['Ashim] dari [Asy Sya'bi] ia berkata; [Abu Bakr] pernah ditanya tentang Al Kalalah. Maka ia menjawab; Sesungguhnya aku akan menjawab tentangnya berdasarkan pendapatku. Jika benar maka itu dari Allah dan jika salah maka itu dariku dan setan. Menurutku Al Kalalah adalah orang yang tidak memiliki ayah dan anak. Ketika [Umar] menjadi khalifah, ia berkata; Sesungguhnya aku malu kepada Allah jika aku menolak sesuatu yang telah dikatakan Abu Bakr. "
        },
        {
            "number": 2846,
            "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ حَدَّثَنَا سَعِيدٌ هُوَ ابْنُ أَبِي أَيُّوبَ قَالَ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ عَنْ مَرْثَدِ بْنِ عَبْدِ اللَّهِ الْيَزَنِيِّ عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ أَنَّهُ قَالَ مَا أَعْضَلَ بِأَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْءٌ مَا أَعْضَلَتْ بِهِمْ الْكَلَالَةُ",
            "id": "Telah menceritakan kepada kami [Abdullah bin Yazid] telah menceritakan kepada kami [Sa'id] ia adalah Ibnu Abu Ayyub, ia berkata; Telah menceritakan kepadaku [Yazid bin Abu Habib] dari [Martsad bin Abdullah Al Yazani] dari [Uqbah bin Amir Al Juhani] bahwa ia berkata; Tidak ada suatu pun yang menyulitkan bagi para sahabat Rasulullah shallallahu 'alaihi wasallam seperti kesulitan mereka dalam masalah Al Kalalah."
        },
        {
            "number": 2847,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ الْحَسَنِ بْنِ مُحَمَّدٍ عَنْ ابْنِ عَبَّاسٍ قَالَ الْكَلَالَةُ مَا خَلَا الْوَالِدَ وَالْوَلَدَ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Amr bin Dinar] dari [Al Hasan bin Muhammad] dari [Ibnu Abbas] ia berkata; Al Kalalah adalah orang yang tidak memiliki ayah dan anak."
        },
        {
            "number": 2848,
            "arab": " أَخْبَرَنَا مُحَمَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ الْقَاسِمِ بْنِ عَبْدِ اللَّهِ عَنْ سَعْدٍ أَنَّهُ كَانَ يَقْرَأُ هَذِهِ الْآيَةَ { وَإِنْ كَانَ رَجُلٌ يُورَثُ كَلَالَةً أَوْ امْرَأَةٌ وَلَهُ أَخٌ أَوْ أُخْتٌ } لِأُمٍّ",
            "id": "Telah mengabarkan kepada kami [Muhammad] telah menceritakan kepada kami [Sufyan] dari [Ya'la bin 'Atha`] dari [Al Qasim bin Abdullah] dari [Sa'd] bahwa ia membaca ayat ini: (Jika seseorang mati, baik laki-laki maupun perempuan yang tidak meninggalkan ayah dan tidak meninggalkan anak, tetapi mempunyai seorang saudara laki-laki atau seorang saudara perempuan), yakni seibu."
        },
        {
            "number": 2849,
            "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ حَدَّثَنَا حَيْوَةُ حَدَّثَنَا أَبُو الْأَسْوَدِ مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ أَنَّ عَاصِمَ بْنَ عُمَرَ بْنِ قَتَادَةَ الْأَنْصَارِيَّ أَخْبَرَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ الْتَمَسَ مَنْ يَرِثُ ابْنَ الدَّحْدَاحَةِ فَلَمْ يَجِدْ وَارِثًا فَدَفَعَ مَالَ ابْنِ الدَّحْدَاحَةِ إِلَى أَخْوَالِ ابْنِ الدَّحْدَاحَةِ",
            "id": "Telah mengabarkan kepada kami [Abdullah bin Yazid] telah menceritakan kepada kami [Haiwah] telah menceritakan kepada kami [Abu Al Aswad Muhammad bin Abdurrahman bin Naufal] bahwa ['Ashim bin Umar bin Qatadah Al Anshari] mengabarkan kepadanya bahwa [Umar bin Al Khaththab] mencari orang yang berhak mewarisi Ibnu Ad Dahdahah, namun ia tidak menemukan satu pun ahli waris. Maka ia menyerahkan harta Ibnu Ad Dahdahah kepada para paman Ibnu Ad Dahdahah dari pihak ibu."
        },
        {
            "number": 2850,
            "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ عَنْ عَمْرِو بْنِ مُسْلِمٍ عَنْ طَاوُسٍ عَنْ عَائِشَةَ قَالَتْ اللَّهُ وَرَسُولُهُ مَوْلَى مَنْ لَا مَوْلَى لَهُ وَالْخَالُ وَارِثُ مَنْ لَا وَارِثَ لَهُ",
            "id": "Telah mengabarkan kepada kami [Abu 'Ashim] dari [Ibnu Juraij] dari [Amru bin Muslim] dari [Thawus] dari [A`isyah] ia berkata; Allah dan RasulNya adalah wali bagi orang yang tidak memiliki wali dan paman dari pihak ibu adalah ahli waris bagi orang yang tidak memiliki ahli waris."
        },
        {
            "number": 2851,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ فِرَاسٍ عَنْ الشَّعْبِيِّ عَنْ زِيَادٍ قَالَ أُتِيَ عُمَرُ فِي عَمٍّ لِأُمٍّ وَخَالَةٍ فَأَعْطَى الْعَمَّ لِلْأُمِّ الثُّلُثَيْنِ وَأَعْطَى الْخَالَةَ الثُّلُثَ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Firas] dari [Asy Sya'bi] dari [Ziyad] ia berkata; [Umar] pernah ditanya tentang paman seibu dari pihak ayah dan bibi dari pihak ibu. Maka ia memberikan paman seibu dari pihak ayah dua pertiga dan memberikan bibi dari pihak ibu sepertiga dari harta warisan."
        },
        {
            "number": 2852,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ يُونُسَ عَنْ الْحَسَنِ أَنَّ عُمَرَ بْنَ الْخَطَّابِ أَعْطَى الْخَالَةَ الثُّلُثَ وَالْعَمَّةَ الثُّلُثَيْنِ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Yunus] dari [Al Hasan] bahwa [Umar bin Al Khaththab] memberikan bibi dari pihak ibu sepertiga dan bibi dari pihak ayah dua pertiga dari harta warisan."
        },
        {
            "number": 2853,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ الْحَسَنِ بْنِ عَمْرٍو عَنْ غَالِبِ بْنِ عَبَّادٍ عَنْ قَيْسِ بْنِ حَبْتَرٍ النَّهْشَلِيِّ قَالَ أُتِيَ عَبْدُ الْمَلِكِ بْنُ مَرْوَانَ فِي خَالَةٍ وَعَمَّةٍ فَقَامَ شَيْخٌ فَقَالَ شَهِدْتُ عُمَرَ بْنَ الْخَطَّابِ أَعْطَى الْخَالَةَ الثُّلُثَ وَالْعَمَّةَ الثُّلُثَيْنِ قَالَ فَهَمَّ أَنْ يَكْتُبَ بِهِ ثُمَّ قَالَ أَيْنَ زَيْدٌ عَنْ هَذَا",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Al Hasan bin Amr] dari [Ghalib bin 'Abbad] dari [Qais bin Habtar An Nahsyali] ia berkata; Abdul Malik bin Marwan pernah ditanya tentang bibi dari pihak ibu dan bibi dari pihak ayah. Maka ada seseorang [syaikh] berdiri seraya berkata; Aku menyaksikan [Umar bin Al Khaththab] memberikan bagian kepada bibi dari pihak ibu sepertiga dan bibi dari pihak ayah dua pertiga. Ia berkata lagi; Ia berniat menulis keputusannya ini, namun ia berkata; Bagaimana pendapat Zaid tentang hal ini? "
        },
        {
            "number": 2854,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ مُحَمَّدِ بْنِ سَالِمٍ عَنْ الشَّعْبِيِّ عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِ قَالَ الْخَالَةُ بِمَنْزِلَةِ الْأُمِّ وَالْعَمَّةُ بِمَنْزِلَةِ الْأَبِ وَبِنْتُ الْأَخِ بِمَنْزِلَةِ الْأَخِ وَكُلُّ رَحِمٍ بِمَنْزِلَةِ رَحِمِهِ الَّتِي يُدْلِي بِهَا إِذَا لَمْ يَكُنْ وَارِثٌ ذُو قَرَابَةٍ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Muhammad bin Salim] dari [Asy Sya'bi] dari [Masruq] dari [Abdullah] ia berkata; Kedudukan bibi dari pihak ibu sama dengan kedudukan ibu, bibi dari pihak ayah sama dengan ayah, anak perempuan dari saudara laki-laki sama dengan saudara laki-laki dan seluruh dzawul arham sama dengan dzawul arham lainnya yang ditentukan olehnya, mereka memiliki hubungan dengan mayit jika tidak ada ahli waris yang memiliki hubungan kerabat dekat. "
        },
        {
            "number": 2855,
            "arab": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا هِشَامٌ عَنْ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ عُتْبَةَ قَالَ حَدَّثَنِي الضَّحَّاكُ بْنُ قَيْسٍ أَنَّ عُمَرَ قَضَى فِي أَهْلِ طَاعُونِ عَمَوَاسَ أَنَّهُمْ كَانُوا إِذَا كَانُوا مِنْ قِبَلِ الْأَبِ سَوَاءً فَبَنُو الْأُمِّ أَحَقُّ وَإِذَا كَانَ بَعْضُهُمْ أَقْرَبَ مِنْ بَعْضٍ بِأَبٍ فَهُمْ أَحَقُّ بِالْمَالِ",
            "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Hisyam] dari [Muhammad] dari [Abdullah bin Utbah] ia berkata; telah menceritakan kepadaku [Adl Dlahhak bin Qais] bahwa [Umar] telah memutuskan para orang-orang yang terkena tha'un (lepra) Amawas. Jika mereka yang berasal dari pihak ayah kedudukannya sama, maka para anak laki-laki dari ibu lebih berhak. Jika sebagian mereka lebih dekat dari sebagian yang lain kepada ayah maka mereka lebih berhak mendapat harta warisan."
        },
        {
            "number": 2856,
            "arab": " حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَبُو شِهَابٍ حَدَّثَنِي أَبُو إِسْحَقَ الشَّيْبَانِيُّ عَنْ عُبَيْدِ بْنِ أَبِي الْجَعْدِ عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادِ بْنِ الْهَادِ قَالَ أُصِيبَ سَالِمٌ مَوْلَى أَبِي حُذَيْفَةَ يَوْمَ الْيَمَامَةِ فَبَلَغَ مِيرَاثُهُ مِائَتَيْ دِرْهَمٍ فَقَالَ عُمَرُ احْبِسُوهَا عَلَى أُمِّهِ حَتَّى تَأْتِيَ عَلَى آخِرِهَا",
            "id": "Telah menceritakan kepada kami [Ahmad bin Abdullah] telah menceritakan kepada kami [Abu Syihab] telah menceritakan kepadaku [Abu Ishaq Asy Syaibani] dari [Ubaid bin Abu Al Ja'd] dari [Abdullah bin Syaddad bin Al Had] ia berkata; Salim mantan budak Abu Hudzaifah meninggal (terbunuh) dalam perang Yamamah. Harta warisan yang ditinggalkan berjumlah dua ratus dirham. Maka [Umar] berkata; Simpan harta itu untuk ibunya, hingga akhirnya ia (ibu) datang."
        },
        {
            "number": 2857,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا زُهَيْرٌ عَنْ أَبِي إِسْحَقَ عَنْ الْحَارِثِ عَنْ عَلِيٍّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْإِخْوَةُ مِنْ الْأُمِّ يَتَوَارَثُونَ دُونَ بَنِي الْعَلَّاتِ يَرِثُ الرَّجُلُ أَخَاهُ لِأَبِيهِ وَأُمِّهِ دُونَ أَخِيهِ لِأَبِيهِ",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Zuhair] dari [Abu Ishaq] dari [Al Harits] dari [Ali] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Para saudara laki-laki seibu dapat saling mewarisi, tidak bagi saudara laki-laki seayah. Seseorang dapat mewarisi saudara laki-laki seayah dan seibu kecuali saudara laki-laki seayah.\""
        },
        {
            "number": 2858,
            "arab": " حَدَّثَنَا سَهْلُ بْنُ حَمَّادٍ حَدَّثَنَا شُعْبَةُ عَنْ النُّعْمَانِ بْنِ سَالِمٍ قَالَ قُلْتُ لِابْنِ عُمَرَ أَرَأَيْتَ رَجُلًا تَرَكَ ابْنَ ابْنَتِهِ أَيَرِثُهُ قَالَ لَا",
            "id": "Telah menceritakan kepada kami [Sahal bin Hammad] telah menceritakan kepada kami [Syu'bah] dari [An Nu'man bin Salim] ia berkata; Aku pernah bertanya kepada [Ibnu Umar]; Apa pendapatmu tentang seseorang yang meninggal dunia dan meninggalkan seorang anak laki-laki dari anak perempuan, apakah ia mendapat warisan? Ia menjawab; Tidak."
        },
        {
            "number": 2859,
            "arab": " حَدَّثَنَا يَعْلَى حَدَّثَنَا الْأَعْمَشُ عَنْ إِبْرَاهِيمَ قَالَ قَالَ عَبْدُ اللَّهِ الْأُمُّ عَصَبَةُ مَنْ لَا عَصَبَةَ لَهُ وَالْأُخْتُ عَصَبَةُ مَنْ لَا عَصَبَةَ لَهُ",
            "id": "Telah menceritakan kepada kami [Ya'la] telah menceritakan kepada kami [Al A'masy] dari [Ibrahim] ia berkata; [Abdullah] pernah berkata; Ibu adalah ashabah bagi orang yang tidak memiliki ashabah. Saudara perempuan juga ashabah bagi orang yang tidak memiliki ashabah."
        },
        {
            "number": 2860,
            "arab": " حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا ابْنُ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَلْحِقُوا الْفَرَائِضَ بِأَهْلِهَا فَمَا بَقِيَ فَهُوَ لِأَوْلَى رَجُلٍ ذَكَرٍ",
            "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Ibnu Thawus] dari [ayahnya] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Berikan bagian yang sudah ditetapkan kepada orang yang berhak mendapatkannya. Sedangkan harta yang tersisa dibagikan kepada pihak laki-laki yang paling dekat dengan mayit.\""
        },
        {
            "number": 2861,
            "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا يَحْيَى أَنَّ سُلَيْمَانَ بْنَ يَسَارٍ أَخْبَرَهُ عَنْ مُحَمَّدِ بْنِ الْأَشْعَثِ أَنَّ عَمَّةً لَهُ تُوُفِّيَتْ يَهُودِيَّةً بِالْيَمَنِ فَذَكَرَ ذَلِكَ لِعُمَرَ بْنِ الْخَطَّابِ فَقَالَ يَرِثُهَا أَقْرَبُ النَّاسِ إِلَيْهَا مِنْ أَهْلِ دِينِهَا",
            "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Yahya] bahwa [Sulaiman bin Yasar] mengabarkan kepadanya dari [Muhammad bin Al Asy'ats] bahwa seorang bibinya meninggal dunia di Yaman dalam keadaan (beragama) yahudi. Lalu ia menceritakan hal itu kepada [Umar bin Al Khaththab], maka ia berkata; Orang yang terdekat dan seagama dengannya adalah yang berhak mewarisinya."
        },
        {
            "number": 2862,
            "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ قَيْسِ بْنِ مُسْلِمٍ عَنْ طَارِقِ بْنِ شِهَابٍ قَالَ مَاتَتْ عَمَّةُ الْأَشْعَثِ بْنِ قَيْسٍ وَهِيَ يَهُودِيَّةٌ فَأَتَى عُمَرَ بْنَ الْخَطَّابِ فَقَالَ أَهْلُ دِينِهَا يَرِثُونَهَا",
            "id": "Telah menceritakan kepada kami Muhammad bin Yusuf telah menceritakan kepada kami Sufyan dari Qais bin Muslim dari Thariq bin Syihab ia berkata; Bibi Asy'ats bin Qais meninggal dunia dalam keadaan yahudi. Lalu ia menemui Umar bin Al Khaththab, ia pun mengatakan; Orang yang seagama dengannya yang lebih berhak mewarisinya."
        },
        {
            "number": 2863,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ حَمَّادٍ عَنْ إِبْرَاهِيمَ قَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِ أَهْلُ الشِّرْكِ لَا نَرِثُهُمْ وَلَا يَرِثُونَا",
            "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Hammad] dari [Ibrahim] ia berkata; [Umar bin Al Khaththab] pernah berkata; Kita tidak berhak mewarisi warisan orang musyrik dan mereka tidak berhak mewarisi kita."
        },
        {
            "number": 2864,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا حَسَنٌ عَنْ عِيسَى الْحَنَّاطِ عَنْ الشَّعْبِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبَا بَكْرٍ وَعُمَرَ قَالُوا لَا يَتَوَارَثُ أَهْلُ دِينَيْنِ",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Hasan] dari [Isa Al Hannath] dari [Asy Sya'bi] bahwa Rasulullah shallallahu 'alaihi wasallam, Abu Bakr dan Umar mengatakan; (Antara) dua pemeluk agama (yang berbeda) tidak bisa saling mewarisi."
        },
        {
            "number": 2865,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا زُهَيْرٌ عَنْ مُطَرِّفٍ عَنْ عَامِرٍ عَنْ عُمَرَ قَالَ لَا يَتَوَارَثُ أَهْلُ مِلَّتَيْنِ",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Zuhair] dari [Mutharrif] dari [Amir] dari [Umar] ia berkata; Dua pemeluk agama tidak bisa saling mewarisi."
        },
        {
            "number": 2866,
            "arab": "أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا شَرِيكٌ عَنْ الْأَشْعَثِ عَنْ الْحَسَنِ عَنْ جَابِرٍ قَالَ لَا نَرِثُ أَهْلَ الْكِتَابِ وَلَا يَرِثُونَا إِلَّا أَنْ يَمُوتَ لِلرَّجُلِ عَبْدُهُ أَوْ أَمَتُهُ",
            "id": "Telah mengabarkan kepada kami Abu Nu'aim telah menceritakan kepada kami Syarik dari Al Asy'ats dari Al Hasan dari Jabir ia berkata; Kita tidak berhak mewarisi ahli kitab dan mereka tidak berhak mewarisi kita kecuali jika budak laki-laki atau budak perempuan milik seseorang meninggal dunia."
        },
        {
            "number": 2867,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا شَرِيكٌ عَنْ الْأَشْعَثِ عَنْ الْحَسَنِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَرِثُ أَهْلَ الْكِتَابِ وَلَا يَرِثُونَا إِلَّا الرَّجُلُ يَرِثُ عَبْدَهُ أَوْ أَمَتَهُ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Syarik] dari [Al Asy'ats] dari [Al Hasan] dari [Jabir] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kita tidak berhak mewarisi ahli kitab dan mereka tidak berhak mewarisi kita kecuali seseorang yang mewarisi budak laki-laki atau budak perempuan miliknya.\""
        },
        {
            "number": 2868,
            "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ دَاوُدَ عَنْ الشَّعْبِيِّ عَنْ مَسْرُوقٍ قَالَ كَانَ مُعَاوِيَةُ يُوَرِّثُ الْمُسْلِمَ مِنْ الْكَافِرِ وَلَا يُوَرِّثُ الْكَافِرَ مِنْ الْمُسْلِمِ قَالَ قَالَ مَسْرُوقٌ وَمَا حَدَثَ فِي الْإِسْلَامِ قَضَاءٌ أَحَبُّ إِلَيَّ مِنْهُ قِيلَ لِأَبِي مُحَمَّدٍ تَقُولُ بِهَذَا قَالَ لَا",
            "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Salamah] dari [Dawud] dari [Asy Sya'bi] dari [Masruq] ia berkata; [Mu'awiyah] membolehkan orang muslim mewarisi orang kafir namun tidak membolehkan orang kafir mewarisi orang muslim. Ia melanjutkan; Masruq berkata; Tidak ada satu keputusan dalam Islam yang lebih aku sukai dari pada keputusan ini. Ada yang bertanya kepada Abu Muhammad; Apakah engkau juga mengatakan seperti ini? Ia menjawab; Tidak."
        },
        {
            "number": 2869,
            "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ عَنْ عَامِرٍ أَنَّ الْمُعْزِلَةَ بِنْتَ الْحَارِثِ تُوُفِّيَتْ بِالْيَمَنِ وَهِيَ يَهُودِيَّةٌ فَرَكِبَ الْأَشْعَثُ بْنُ قَيْسٍ وَكَانَتْ عَمَّتَهُ إِلَى عُمَرَ فِي مِيرَاثِهَا فَقَالَ عُمَرُ لَيْسَ ذَاكَ لَكَ يَرِثُهَا أَقْرَبُ النَّاسِ مِنْهَا مِنْ أَهْلِ دِينِهَا لَا يَتَوَارَثُ مِلَّتَانِ",
            "id": "Telah menceritakan kepada kami Yazid bin Harun dari Dawud bin Abu Hind dari Amir bahwa Al Mu'zilah binti Al Harits meninggal dunia di Yaman dalam keadaan yahudi. Al Asy'ats bin Qais segera menunggang kuda dan berangkat menemui Umar untuk menanyakan tentang warisannya, ia adalah bibinya dari pihak ayah. Umar pun menjawab; Tidak ada hak warisannya bagimu. Orang yang terdekat dan seagama dengannya yang berhak mewarisinya. Dua pemeluk agama yang berbeda tidak dapat saling mewarisi."
        },
        {
            "number": 2870,
            "arab": " حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا أَنَسُ بْنُ سِيرِينَ قَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِ لَا يَتَوَارَثُ مِلَّتَانِ شَتَّى وَلَا يَحْجُبُ مَنْ لَا يَرِثُ",
            "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Zaid] telah menceritakan kepada kami [Anas bin Sirin] ia berkata; [Umar bin Al Khaththab] berkata; Dua pemeluk agama yang berbeda tidak dapat saling mewarisi dan orang yang tidak dapat mewarisi tidak dapat menghalangi ahli waris lain."
        },
        {
            "number": 2871,
            "arab": " حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ عَلِيِّ بْنِ حُسَيْنٍ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ أُسَامَةَ بْنِ زَيْدٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَرِثُ الْمُسْلِمُ الْكَافِرَ وَلَا الْكَافِرُ الْمُسْلِمَ",
            "id": "Telah menceritakan kepada kami [Nashr bin Ali] telah menceritakan kepada kami [Abdul A'la] dari [Ma'mar] dari [Az Zuhri] dari [Ali bin Husain] dari [Amr bin Utsman] dari [Usamah bin Zaid] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang muslim tidak dapat mewarisi harta orang kafir dan orang kafir tidak dapat mewarisi harta orang muslim.\""
        },
        {
            "number": 2872,
            "arab": " حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ عَنْ سَعِيدٍ عَنْ أَبِي مَعْشَرٍ عَنْ إِبْرَاهِيمَ قَالَ إِذَا مَاتَ الْمَيِّتُ وَجَبَتْ الْحُقُوقُ لِأَهْلِهَا وَلَمْ يَجْعَلْ لِمَنْ أَسْلَمَ أَوْ أُعْتِقَ قَبْلَ أَنْ يُقْسَمَ الْمِيرَاثُ شَيْئًا",
            "id": "Telah menceritakan kepada kami [Ja'far bin 'Aun] dari [Sa'id] dari [Abu Ma'syar] dari [Ibrahim] ia berkata; Jika seseorang meninggal dunia maka hak-hak wajib diberikan kepada orang-orang yang berhak menerimanya. Sedikit pun bagian harta tidak diberikan kepada orang yang masuk Islam atau orang yang dimerdekakan sebelum warisan dibagikan."
        },
        {
            "number": 2873,
            "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى عَنْ الزُّهْرِيِّ عَنْ عَلِيِّ بْنِ حُسَيْنٍ عَنْ أُسَامَةَ بْنِ زَيْدٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَرِثُ الْمُسْلِمُ الْكَافِرَ وَلَا الْكَافِرُ الْمُسْلِمَ",
            "id": "Telah menceritakan kepada kami Muhammad bin Yusuf telah menceritakan kepada kami Sufyan dari Abdullah bin Isa dari Az Zuhri dari Ali bin Husain dari Usamah bin Zaid ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang muslim tidak dapat mewarisi harta orang kafir dan orang kafir tidak dapat mewarisi harta orang muslim.\""
        },
        {
            "number": 2874,
            "arab": " حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ عَلِيِّ بْنِ حُسَيْنٍ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ أُسَامَةَ بْنِ زَيْدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَرِثُ الْمُسْلِمُ الْكَافِرَ وَلَا الْكَافِرُ الْمُسْلِمَ",
            "id": "Telah menceritakan kepada kami [Amr bin 'Aun] telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Ali bin Husain] dari [Amr bin Utsman] dari [Usamah bin Zaid] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Orang muslim tidak dapat mewarisi harta orang kafir dan orang kafir tidak dapat mewarisi harta orang muslim.\""
        },
        {
            "number": 2875,
            "arab": " حَدَّثَنَا أَبُو النُّعْمَانِ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ مُغِيرَةَ عَنْ إِبْرَاهِيمَ قَالَ لَيْسَ لِلْمُكَاتَبِ مِيرَاثٌ مَا بَقِيَ عَلَيْهِ شَيْءٌ مِنْ مُكَاتَبَتِهِ",
            "id": "Telah menceritakan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Abu 'Awanah] dari [Al Mughirah] dari [Ibrahim] ia berkata; Mukatab tidak memperoleh warisan selama masih ada sisa pembayaran dari mukatabnya yang belum dilunasi. "
        },
        {
            "number": 2876,
            "arab": " حَدَّثَنَا يَعْلَى حَدَّثَنَا عَبْدُ الْمَلِكِ عَنْ عَطَاءٍ فِي رَجُلٍ لَهُ بَنُونَ قَدْ أَعْتَقَ مِنْ بَعْضِهِمْ النِّصْفَ وَمِنْ بَعْضِهِمْ الثُّلُثَ وَمِنْ بَعْضٍ الرُّبُعَ قَالَ لَا يَرِثُونَ حَتَّى يُعْتَقُوا",
            "id": "Telah menceritakan kepada kami [Ya'la] telah menceritakan kepada kami [Abdul Malik] dari ['Atha`] tentang seseorang yang memiliki beberapa budak, sebagian mereka telah ia merdekakan setengah (dari harga budak), sebagian lagi telah ia merdekakan sepertiga (dari harga budak) dan sebagian lainnya telah ia merdekakan seperempat (dari harga budak). Ia berkata; Mereka tidak dapat mewarisi hingga mereka dimerdekakan."
        },
        {
            "number": 2877,
            "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الرَّقِّيُّ وَسَعِيدُ بْنُ الْمُغِيرَةِ عَنْ ابْنِ الْمُبَارَكِ عَنْ مَعْمَرٍ عَنْ حَمَّادٍ عَنْ إِبْرَاهِيمَ فِي رَجُلٍ اشْتَرَى ابْنَهُ فِي مَرَضِهِ قَالَ إِنْ خَرَجَ مِنْ الثُّلُثِ وَرِثَهُ وَإِنْ وَقَعَتْ عَلَيْهِ السِّعَايَةُ لَمْ يَرِثْ",
            "id": "Telah menceritakan kepada kami [Abdul Ja'far Ar Ruqqi] dan [Sa'ib bin Al Mughirah] dari [Ibnu Al Mubarak] dari [Ma'mar] dari [Hammad] dari [Ibrahim] tentang seorang laki-laki yang membeli budaknya pada waktu sakitnya, ia berkata; Jika ia telah membayar sepertiga maka budak itu dapat mewarisinya, namun jika masih melakukan pekerjaan maka ia tidak dapat diwarisi."
        },
        {
            "number": 2878,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا حَسَنٌ عَنْ أَبِيهِ عَنْ الشَّعْبِيِّ قَالَ حَدُّ الْمُكَاتَبِ حَدُّ الْمَمْلُوكِ حَتَّى يُعْتَقَ",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Hasan] dari [ayahnya] dari [Asy Sya'bi] ia berkata; Hukuman bagi mukatab sama dengan hukuman seorang budak hingga ia telah merdeka."
        },
        {
            "number": 2879,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ حَدَّثَنَا يُونُسُ عَنْ الزُّهْرِيِّ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَوْلَى أَخٌ فِي الدِّينِ وَنِعْمَةٌ أَحَقُّ النَّاسِ بِمِيرَاثِهِ أَقْرَبُهُمْ مِنْ الْمُعْتِقِ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Sa'id bin Abdurrahman] telah menceritakan kepada kami [Yunus] dari [Az Zuhri] ia berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Mantan budak adalah saudara dalam agama dan anugerah kenikmatan. Orang yang paling berhak dengan warisannya adalah orang yang memerdekakannya yang paling dekat dengannya.\""
        },
        {
            "number": 2880,
            "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا مَنْصُورٌ عَنْ الْحَسَنِ وَمُحَمَّدُ بْنُ سَالِمٍ عَنْ الشَّعْبِيِّ فِي رَجُلٍ أَعْتَقَ مَمْلُوكًا ثُمَّ مَاتَ الْمَوْلَى وَالْمَمْلُوكُ وَتَرَكَ الْمُعْتِقُ أَبَاهُ وَابْنَهُ قَالَا الْمَالُ لِلِابْنِ",
            "id": "Telah menceritakan kepada kami Muhammad bin Isa telah menceritakan kepada kami Husyaim telah mengabarkan kepada kami Manshur dari Al Hasan dan Muhammad bin Salim dari Asy Sya'bi tentang seseorang yang memerdekakan budak kemudian orang yang memerdekakan dan budak tersebut meninggal dunia. Orang yang memerdekakan itu meninggalkan ayah dan seorang anak laki-laki, keduanya berkata; Harta itu (harta orang yang memerdekakan) diberikan kepada anak laki-laki."
        },
        {
            "number": 2881,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا عَبَّادٌ عَنْ عُمَرَ بْنِ عَامِرٍ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ زَيْدِ بْنِ ثَابِتٍ فِي رَجُلٍ تَرَكَ أَبَاهُ وَابْنَ ابْنِهِ فَقَالَ الْوَلَاءُ لِابْنِ الِابْنِ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami ['Abbad] dari [Umar bin Amir] dari [Qatadah] dari [Sa'id bin Al Musayyab] dari [Zaid bin Tsabit] tentang seorang anak laki-laki yang meninggalkan ayah dan anak laki-laki dari anak laki-lakinya, ia berkata; Wala` untuk anak laki-laki dari anak laki-laki. "
        },
        {
            "number": 2882,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا مُعَمَّرٌ حَدَّثَنَا خُصَيْفٌ عَنْ زِيَادِ بْنِ أَبِي مَرْيَمَ أَنَّ امْرَأَةً أَعْتَقَتْ عَبْدًا لَهَا ثُمَّ تُوُفِّيَتْ وَتَرَكَتْ ابْنَهَا وَأَخَاهَا ثُمَّ تُوُفِّيَ مَوْلَاهَا فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ابْنُ الْمَرْأَةِ وَأَخُوهَا فِي مِيرَاثِهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِيرَاثُهُ لِابْنِ الْمَرْأَةِ فَقَالَ أَخُوهَا يَا رَسُولَ اللَّهِ لَوْ أَنَّهُ جَرَّ جَرِيرَةً عَلَى مَنْ كَانَتْ قَالَ عَلَيْكَ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Mu'ammar] telah menceritakan kepada kami [Khushaif] dari [Ziyad bin Abu Maryam] bahwa seorang perempuan memerdekakan budak miliknya kemudian perempuan itu meninggal dunia dan meninggalkan anak laki-laki dan saudara laki-lakinya. Setelah itu mantan budaknya meninggal dunia. Anak laki-laki dan saudara laki-laki perempuan itu menemui Nabi shallallahu 'alaihi wasallam menanyakan tentang warisan mantan budak tersebut. Maka Nabi shallallahu 'alaihi wasallam: \"Warisannya untuk anak laki-laki perempuan itu.\" Saudara laki-laki perempuan itu berkata; Wahai Rasulullah, seandainya mantan budak itu melakukan kejahatan maka siapa yang menanggung diyat kejahatannya? Beliau menjawab: \"kamu.\""
        },
        {
            "number": 2883,
            "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّلْتِ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا مُغِيرَةُ قَالَ سَأَلْتُ إِبْرَاهِيمَ عَنْ رَجُلٍ أَعْتَقَ مَمْلُوكًا لَهُ فَمَاتَ وَمَاتَ الْمَوْلَى فَتَرَكَ الْمُعْتِقُ أَبَاهُ وَابْنَهُ فَقَالَ لِأَبِيهِ كَذَا وَمَا بَقِيَ فَلِابْنِهِ",
            "id": "Telah menceritakan kepada kami Muhammad bin Ash Shalt telah menceritakan kepada kami Husyaim telah mengabarkan kepada kami Mughirah ia berkata; Aku pernah bertanya kepada Ibrahim tentang seseorang yang memerdekakan budak miliknya, lalu ia dan mantan budaknya itu meninggal dunia. Sementara orang yang memerdekakan itu meninggalkan ayah dan seorang anak laki-laki, ia pun menjawab; Untuk ayahnya (bagiannya) sekian, dan harta yang tersisa untuk anak laki-lakinya."
        },
        {
            "number": 2884,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ الصَّلْتِ حَدَّثَنَا هُشَيْمٌ عَنْ شُعْبَةَ قَالَ سَمِعْتُ الْحَكَمَ وَحَمَّادًا يَقُولَانِ هُوَ لِلِابْنِ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shalt] telah menceritakan kepada kami [Husyaim] dari [Syu'bah] ia berkata; Aku mendengar [Al Hakam] dan [Hammad] keduanya berkata; Warisan itu diberikan kepada anak laki-laki."
        },
        {
            "number": 2885,
            "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا الْأَشْعَثُ عَنْ الْحَسَنِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ إِلَى الْبَقِيعِ فَرَأَى رَجُلًا يُبَاعُ فَأَتَاهُ فَسَاوَمَ بِهِ ثُمَّ تَرَكَهُ فَرَآهُ رَجُلٌ فَاشْتَرَاهُ فَأَعْتَقَهُ ثُمَّ جَاءَ بِهِ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنِّي اشْتَرَيْتُ هَذَا فَأَعْتَقْتُهُ فَمَا تَرَى فِيهِ فَقَالَ هُوَ أَخُوكَ وَمَوْلَاكَ قَالَ مَا تَرَى فِي صُحْبَتِهِ فَقَالَ إِنْ شَكَرَكَ فَهُوَ خَيْرٌ لَهُ وَشَرٌّ لَكَ وَإِنْ كَفَرَكَ فَهُوَ خَيْرٌ لَكَ وَشَرٌّ لَهُ قَالَ مَا تَرَى فِي مَالِهِ قَالَ إِنْ مَاتَ وَلَمْ يَتْرُكْ عَصَبَةً فَأَنْتَ وَارِثُهُ",
            "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Al Asy'ats] dari [Al Hasan] bahwa Nabi shallallahu 'alaihi wasallam pernah pergi ke Baqi' kemudian beliau melihat seorang budak laki-laki yang dijual. Beliau mendatangi lalu menawarnya kemudian beliau meninggalkannya. Setelah itu ada seseorang melihatnya lalu membeli dan memerdekakannya. Kemudian ia datang membawa mantan budak tersebut kepada Nabi shallallahu 'alaihi wasallam seraya berkata; Sesungguhnya aku telah membeli budak ini lalu memerdekakannya, apa pendapatmu tentangnya? Nabi shallallahu 'alaihi wasallam menjawab: \"Ia adalah saudaramu dan mantan budakmu.\" Ia bertanya lagi; Apa pendapatmu tentang berteman dengannya? Beliau menjawab: \"Jika ia bisa berterima kasih kepadamu maka itu baik baginya namun buruk bagimu dan jika ia ingkar terhadapmu maka itu baik bagimu namun buruk baginya.\" Ia bertanya lagi; Apa pendapatmu tentang hartanya? Beliau menjawab: \"Jika ia meninggal dunia dan tidak meninggalkan ashabah maka engkau adalah ahli warisnya.\""
        },
        {
            "number": 2886,
            "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا أَشْعَثُ عَنْ الْحَكَمِ وَسَلَمَةَ بْنِ كُهَيْلٍ عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ أَنَّ ابْنَةَ حَمْزَةَ أَعْتَقَتْ عَبْدًا لَهَا فَمَاتَ وَتَرَكَ ابْنَتَهُ وَمَوْلَاتَهُ بِنْتَ حَمْزَةَ فَقَسَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِيرَاثَهُ بَيْنَ ابْنَتِهِ وَمَوْلَاتِهِ بِنْتِ حَمْزَةَ نِصْفَيْنِ",
            "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Al Asy'ats] dari [Al Hakam] dan [Salamah bin Kuhail] dari [Abdullah bin Syaddad] bahwa anak perempuan Hamzah telah memerdekakan seorang budak laki-laki miliknya lalu mantan budaknya meninggal dunia dan meninggalkan anak perempuan dan tuannya, yakni anak perempuan Hamzah. Maka Rasulullah shallallahu 'alaihi wasallam membagi warisan budak yang telah dimerdekakan tersebut kepada anak perempuannya dan tuannya, masing-masing setengah (bagian)."
        },
        {
            "number": 2887,
            "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ عَنْ عَلِيِّ بْنِ مُسْهِرٍ عَنْ الشَّيْبَانِيِّ عَنْ الْحَكَمِ عَنْ شَمُوسَ الْكِنْدِيَّةِ قَالَتْ قَاضَيْتُ إِلَى عَلِيٍّ فِي أَبٍ مَاتَ فَلَمْ يَدَعْ أَحَدًا غَيْرِي وَمَوْلَاهُ فَأَعْطَانِي النِّصْفَ وَأَعْطَى مَوْلَاهُ النِّصْفَ",
            "id": "Telah menceritakan kepada kami Muhammad bin Uyainah dari Ali bin Mushir dari Asy Syaibani dari Al Hakam dari Syamus Al Kindiyah ia berkata; Aku pernah mengadukan kepada Ali tentang seorang ayah yang meninggal dunia namun tidak meninggalkan seorang pun selain aku dan mantan budaknya. Maka ia memberikan kepadaku dan mantan budak tersebut masing-masing setengah (bagian)."
        },
        {
            "number": 2888,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ عَنْ عَلِيِّ بْنِ مُسْهِرٍ عَنْ ابْنِ أَبِي لَيْلَى عَنْ الْحَكَمِ عَنْ أَبِي الْكَنُودِ عَنْ عَلِيٍّ أَنَّهُ أُتِيَ بِابْنَةٍ وَمَوْلًى فَأَعْطَى الِابْنَةَ النِّصْفَ وَالْمَوْلَى النِّصْفَ قَالَ الْحَكَمُ فَمَنْزِلِي هَذَا نَصِيبُ الْمَوْلَى الَّذِي وَرِثَهُ عَنْ مَوْلَاهُ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Uyainah] dari [Ali bin Mushir] dari [Ibnu Abu Laila] dari [Al Hakam] dari [Abu Al Kanud] dari [Ali] bahwa ia pernah ditanya tentang seorang anak perempuan dan mantan budak. Maka ia memberikan kepada anak perempuan dan mantan budak tersebut masing-masing setengah. Al Hakam berkata; Menurutku, ini adalah bagian mantan budak yang diwarisi dari orang yang memerdekakannya."
        },
        {
            "number": 2889,
            "arab": " أَخْبَرَنَا إِبْرَاهِيمُ بْنُ مُوسَى عَنْ ابْنِ إِدْرِيسَ عَنْ أَشْعَثَ عَنْ الْحَكَمِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مُدْلِجٍ أَنَّهُ مَاتَ وَتَرَكَ ابْنَتَهُ وَمَوَالِيَهُ فَأَعْطَى عَلِيٌّ ابْنَتَهُ النِّصْفَ وَمَوَالِيَهُ النِّصْفَ",
            "id": "Telah mengabarkan kepada kami [Ibrahim bin Musa] dari [Ibnu Idris] dari [Asy'ats] dari [Al Hakam] dari [Abdurrahman bin Mudlij] bahwa ada seorang budak meninggal dunia dan meninggalkan seorang anak perempuan dan orang yang memerdekakannya, maka [Ali] memberikan kepada anak perempuan itu setengah dan kepada para mantan budak ayahnya itu setengah."
        },
        {
            "number": 2890,
            "arab": "حَدَّثَنَا إِبْرَاهِيمُ عَنْ ابْنِ إِدْرِيسَ عَنْ الشَّيْبَانِيِّ عَنْ الْحَكَمِ عَنْ الشَّمُّوسِ أَنَّ أَبَاهَا مَاتَ فَجَعَلَ عَلِيٌّ لَهَا النِّصْفَ وَلِمَوَالِيهِ النِّصْفَ",
            "id": "Telah menceritakan kepada kami Ibrahim dari Ibnu Idris dari Asy Syaibani dari Al Hakam dari Asy Syammus bahwa ayahnya meninggal dunia. Maka Ali memberikan kepada perempuan itu setengah dan para mantan budaknya itu setengah."
        },
        {
            "number": 2891,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ حَدَّثَنَا أَشْعَثُ عَنْ جَهْمِ بْنِ دِينَارٍ عَنْ إِبْرَاهِيمَ أَنَّهُ سُئِلَ عَنْ أُخْتَيْنِ اشْتَرَتْ إِحْدَاهُمَا أَبَاهَا فَأَعْتَقَتْهُ ثُمَّ مَاتَ قَالَ لَهُمَا الثُّلُثَانِ فَرِيضَتُهُمَا فِي كِتَابِ اللَّهِ وَمَا بَقِيَ فَلِلْمُعْتِقَةِ دُونَ الْأُخْرَى",
            "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Hafsh bin Ghiyats] telah menceritakan kepada kami [Asy'ats] dari [Jahm bin Dinar] dari [Ibrahim] bahwa ia pernah ditanya tentang salah satu dari dua saudara perempuan yang membeli ayahnya lalu memerdekakannya kemudian ayahnya tersebut meninggal dunia. Ia menjawab; Mereka berdua mendapat dua pertiga sebagai bagian yang telah ditetapkan untuk keduanya dalam kitab Allah dan harta yang tersisa adalah untuk yang memerdekakannya bukan untuk yang lain."
        },
        {
            "number": 2892,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا إِسْرَائِيلُ حَدَّثَنَا الْأَشْعَثُ عَنْ الشَّعْبِيِّ فِي امْرَأَةٍ أَعْتَقَتْ أَبَاهَا فَمَاتَ الْأَبُ وَتَرَكَ أَرْبَعَ بَنَاتٍ هِيَ إِحْدَاهُنَّ قَالَ لَيْسَ عَلَيْهِ مِنَّةٌ لَهُنَّ الثُّلُثَانِ وَهِيَ مَعَهُنَّ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Isra`il] telah menceritakan kepada kami [Al Asy'ats] dari [Asy Sya'bi] tentang seorang perempuan yang memerdekakan ayahnya, lalu ayah tersebut meninggal dunia dan meninggalkan empat anak perempuan, salah satu dari mereka adalah yang memerdekakannya. Ia menjawab; Ayah tidak boleh melebihkan (bagian), mereka mendapat dua pertiga termasuk yang memerdekakan."
        },
        {
            "number": 2893,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا زُهَيْرٌ عَنْ حَيَّانَ بْنِ سَلْمَانَ قَالَ كُنْتُ عِنْدَ سُوَيْدِ بْنِ غَفَلَةَ فَجَاءَهُ رَجُلٌ فَسَأَلَهُ عَنْ فَرِيضَةِ رَجُلٍ تَرَكَ ابْنَتَهُ وَامْرَأَتَهُ قَالَ أَنَا أُنْبِئُكَ قَضَاءَ عَلِيٍّ قَالَ حَسْبِي قَضَاءُ عَلِيٍّ قَالَ قَضَى عَلِيٌّ لِامْرَأَتِهِ الثُّمُنَ وَلِابْنَتِهِ النِّصْفَ ثُمَّ رَدَّ الْبَقِيَّةَ عَلَى ابْنَتِهِ",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Zuhair] dari [Hayyan bin Salman] ia berkata; Ketika aku bersama [Suwaid bin Ghafalah], datang seorang laki-laki dan bertanya kepadanya tentang warisan seseorang yang meninggalkan anak perempuan dan isterinya; Aku beritahukan apakah itu keputusan Ali? Ia menjawab; Menurutku (cukup dengan) keputusan Ali. Ia melanjutkan; [Ali] memutuskan untuk isteri seperdelapan dan anak perempuan setengah kemudian ia mengembalikan sisanya kepada anak perempuan."
        },
        {
            "number": 2894,
            "arab": " حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ إِسْرَائِيلَ عَنْ أَبِي الْهَيْثَمِ عَنْ إِبْرَاهِيمَ أَنَّ مَوْلَاةً لِإِبْرَاهِيمَ تُوُفِّيَتْ وَتَرَكَتْ مَالًا فَقُلْتُ لِإِبْرَاهِيمَ فَقَالَ إِنَّ لَهَا ذَا قَرَابَةٍ",
            "id": "Telah menceritakan kepada kami [Ubaidullah] dari [Isra`il] dari [Abu Al Haitsam] dari [Ibrahim] bahwa seorang mantan budak perempuan Ibrahim meninggal dunia dan meninggalkan harta. Maka aku menanyakannya kepada Ibrahim, ia pun menjawab; Sesungguhnya ia masih memiliki kekerabatan."
        },
        {
            "number": 2895,
            "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا أَشْعَثُ عَنْ الشَّعْبِيِّ عَنْ عُمَرَ وَعَلِيٍّ وَزَيْدٍ قَالَ وَأَحْسَبُهُ قَدْ ذَكَرَ عَبْدَ اللَّهِ أَيْضًا أَنَّهُمْ قَالُوا الْوَلَاءُ لِلْكُبْرِ يَعْنُونَ بِالْكُبْرِ مَا كَانَ أَقْرَبَ بِأَبٍ أَوْ أُمٍّ",
            "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Asy'ats] dari [Asy Sya'bi] dari [Umar], [Ali] dan [Zaid]. Ia berkata; Dan aku mengira juga dikatakan oleh [Abdullah]. Mereka berkata; Wala` untuk yang lebih tua. Menurut mereka, yang dimaksud lebih tua adalah yang lebih dekat dengan ayah atau ibu."
        },
        {
            "number": 2896,
            "arab": " حَدَّثَنَا يَزِيدُ حَدَّثَنَا أَشْعَثُ عَنْ ابْنِ سِيرِينَ عَنْ عَبْدِ اللَّهِ بْنِ عُتْبَةَ قَالَ كُتِبَ إِلَى عُمَرَ فِي شَأْنِ فُكَيْهَةَ بِنْتِ سَمْعَانَ أَنَّهَا مَاتَتْ وَتَرَكَتْ ابْنَ أَخِيهَا لِأَبِيهَا وَأُمِّهَا وَابْنَ أَخِيهَا لِأَبِيهَا فَكَتَبَ عُمَرُ إِنَّ الْوَلَاءَ لِلْكُبْرِ",
            "id": "Telah menceritakan kepada kami [Yazid] telah menceritakan kepada kami [Asy'ats] dari [Ibnu Sirin] dari [Abdullah bin Utbah] ia berkata; Sebuah surat dikirim kepada Umar tentang perihal Fukaihah binti Sam'an yang meninggal dunia dan meninggalkan seorang anak laki-laki dari saudara laki-laki seayah dan seibu serta seorang anak laki-laki dari saudara laki-laki seayah. Maka [Umar] membalas surat tersebut; Sesungguhnya wala` untuk yang lebih tua."
        },
        {
            "number": 2897,
            "arab": " حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَبُو شِهَابٍ عَنْ الشَّيْبَانِيِّ عَنْ الشَّعْبِيِّ أَنَّ عَلِيًّا وَزَيْدًا قَالَا الْوَلَاءُ لِلْكُبْرِ و قَالَ عَبْدُ اللَّهِ وَشُرَيْحٌ لِلْوَرَثَةِ",
            "id": "Telah menceritakan kepada kami [Ahmad bin Abdullah] telah menceritakan kepada kami [Abu Syihab] dari [Asy Syaibani] dari [Asy Sya'bi] bahwa [Ali] dan [Zaid] berkata; Wala` untuk yang lebih tua. Sementara [Abdullah] dan [Syuraih] berkata; Untuk ahli waris."
        },
        {
            "number": 2898,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ عَنْ عَلِيِّ بْنِ مُسْهِرٍ عَنْ أَشْعَثَ عَنْ الشَّعْبِيِّ قَالَ قَضَى عُمَرُ وَعَبْدُ اللَّهِ وَعَلِيٌّ وَزَيْدٌ لِلْكُبْرِ بِالْوَلَاءِ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Uyainah] dari [Ali bin Mushir] dari [Asy'ats] dari [Asy Sya'bi] ia berkata; [Umar], [Abdullah], [Ali] dan [Zaid] memutuskan bahwa wala` untuk yang lebih tua."
        },
        {
            "number": 2899,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا شَرِيكٌ عَنْ أَشْعَثَ عَنْ ابْنِ سِيرِينَ قَالَ تُوُفِّيَتْ فُكَيْهَةُ بِنْتُ سَمْعَانَ وَتَرَكَتْ ابْنَ أَخِيهَا لِأَبِيهَا وَبَنِي بَنِي أَخِيهَا لِأَبِيهَا وَأُمِّهَا فَوَرَّثَ عُمَرُ بَنِي أَخِيهَا لِأَبِيهَا ",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Syarik] dari [Asy'ats] dari [Ibnu Sirin] ia berkata; Fukaihah binti Sam'an meninggal dunia dan meninggalkan seorang anak laki-laki dari saudara laki-laki seayah dan anak laki-laki dari anak laki-laki (cucu laki-laki) dari saudara laki-laki seayah dan seibu. Maka [Umar] memberikan warisan kepada anak laki-laki dari saudara laki-laki seayah."
        },
        {
            "number": 2900,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ حَرْبٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عُمَرَ وَعَلِيٍّ وَزَيْدٍ أَنَّهُمْ قَالُوا الْوَلَاءُ لِلْكُبْرِ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Abdus Salam bin Harb] dari [Al A'masy] dari [Ibrahim] dari [Umar], [Ali] dan [Zaid] bahwa mereka berkata; Wala` untuk yang lebih tua."
        },
        {
            "number": 2901,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا أَبُو عَوَانَةَ عَنْ مُغِيرَةَ عَنْ إِبْرَاهِيمَ فِي أَخَوَيْنِ وَرِثَا مَوْلًى كَانَ أَعْتَقَهُ أَبُوهُمَا فَمَاتَ أَحَدُهُمَا وَتَرَكَ وَلَدًا قَالَ كَانَ عَلِيٌّ وَزَيْدٌ وَعَبْدُ اللَّهِ يَقُولُونَ الْوَلَاءُ لِلْكُبْرِ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Abu 'Awanah] dari [Mughirah] dari [Ibrahim] tentang dua saudara laki-laki yang mewarisi mantan budak yang telah dimerdekakan ayah mereka. Lalu salah seorang dari dua saudara itu meninggal dunia dan meninggalkan seorang anak laki-laki, ia berkata; [Ali], [Zaid] dan [Abdullah] berkata; Wala` untuk yang lebih tua."
        },
        {
            "number": 2902,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ قَالَ سَمِعْتُ مَطَرًا الْوَرَّاقَ يَقُولُ قَالَ عُمَرُ وَعَلِيٌّ الْوَلَاءُ لِلْكُبْرِ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Hammad bin Zaid] ia berkata; Aku mendengar [Mathar Al Warraq] berkata; [Umar] dan [Ali] berkata; Wala` untuk yang lebih tua."
        },
        {
            "number": 2903,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ عِيسَى عَنْ رَوْحٍ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ وَابْنِ جُرَيْجٍ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ قَالَ الْوَلَاءُ لِلْكُبْرِ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Isa] dari [Rauh] dari [Ibnu Juraij] dari ['Atha`] dan Ibnu Juraij juga dari [Ibnu Thawus] dari [ayahnya] ia berkata; Wala` untuk yang lebih tua."
        },
        {
            "number": 2904,
            "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ إِسْرَائِيلَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ قَالَ الْوَلَاءُ لِلْكُبْرِ",
            "id": "Telah mengabarkan kepada kami [Ubaidullah bin Musa] dari [Isra`il] dari [Manshur] dari [Ibrahim] ia berkata; Wala` untuk yang lebih tua."
        },
        {
            "number": 2905,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ مُطَرِّفٍ عَنْ الشَّعْبِيِّ وَسُفْيَانُ عَنْ يُونُسَ عَنْ الْحَسَنِ فِي الرَّجُلِ يُوَالِي الرَّجُلَ قَالَا هُوَ بَيْنَ الْمُسْلِمِينَ قَالَ سُفْيَانُ وَكَذَلِكَ نَقُولُ",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Mutharrif] dari [Asy Sya'bi] dan Sufyan dari [Yunus] dari [Al Hasan] tentang seseorang menjadikan wali untuk orang lain, keduanya berkata; Ia sama dengan kaum muslimin lainnya. Sufyan berkata; Kami juga berpendapat seperti itu."
        },
        {
            "number": 2906,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ قَالَ سَمِعْتُ تَمِيمًا الدَّارِيَّ يَقُولُ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ مَا السُّنَّةُ فِي الرَّجُلِ مِنْ أَهْلِ الْكُفْرِ يُسْلِمُ عَلَى يَدَيْ رَجُلٍ مِنْ الْمُسْلِمِينَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هُوَ أَوْلَى النَّاسِ بِمَحْيَاهُ وَمَمَاتِهِ",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Abdul Aziz bin Umar bin Abdul Aziz] dari [Abdullah bin Mauhab] ia berkata; Aku pernah mendengar [Tamim Ad Dari] berkata; Aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam; Wahai Rasulullah, apa yang sunnah dilakukan terhadap seorang kafir yang masuk Islam di hadapan seorang muslim? Rasulullah shallallahu 'alaihi wasallam menjawab: \"Seseorang itu (orang kafir yang masuk Islam) lebih berhak dengan hidup dan matinya.\""
        },
        {
            "number": 2907,
            "arab": " حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ إِسْرَائِيلَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ قَالَ سُئِلَ عَنْ رَجُلٍ مِنْ أَهْلِ السَّوَادِ أَسْلَمَ عَلَى يَدَيْ رَجُلٍ قَالَ يَعْقِلُ عَنْهُ وَيَرِثُهُ",
            "id": "Telah menceritakan kepada kami [Ubaidullah] dari [Isra`il] dari [Manshur] dari [Ibrahim] ia berkata; Ia pernah ditanya tentang seorang laki-laki dari ahli kegelapan yang masuk Islam di hadapan seseorang? Ia menjawab; Laki-laki membayar diyat orang tersebut dan ia berhak mewarisinya."
        },
        {
            "number": 2908,
            "arab": " حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا شُعْبَةُ عَنْ مُغِيرَةَ عَنْ إِبْرَاهِيمَ قَالَ تَرِثُ الْمَرْأَةُ مِنْ دِيَةِ زَوْجِهَا فِي الْعَمْدِ وَالْخَطَإِ",
            "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Syu'bah] dari [Mughirah] dari [Ibrahim] ia berkata; Isteri berhak mewarisi diyat suaminya pada pembunuhan sengaja maupun tidak sengaja."
        },
        {
            "number": 2909,
            "arab": " حَدَّثَنَا أَبُو النُّعْمَانِ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ مُغِيرَةَ عَنْ إِبْرَاهِيمَ قَالَ الدِّيَةُ عَلَى فَرَائِضِ اللَّهِ",
            "id": "Telah menceritakan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Abu 'Awanah] dari [Mughirah] dari [Ibrahim] ia berkata; Diyat dibagikan berdasarkan pembagian yang telah ditetapkan Allah."
        },
        {
            "number": 2910,
            "arab": " حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا أَيُّوبُ عَنْ أَبِي قِلَابَةَ قَالَ الدِّيَةُ سَبِيلُهَا سَبِيلُ الْمِيرَاثِ",
            "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Ayyub] dari [Abu Qilabah] ia berkata; Cara pembagian diyat sama dengan cara pembagian harta warisan."
        },
        {
            "number": 2911,
            "arab": " حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ حُمَيْدٍ وَدَاوُدَ بْنِ أَبِي هِنْدٍ أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ كَتَبَ أَنْ يُوَرَّثَ الْإِخْوَةُ مِنْ الْأُمِّ مِنْ الدِّيَةِ",
            "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Salamah] dari [Humaid] dan [Dawud bin Abu Hind] bahwa [Umar bin Abdul Aziz] menetapkan bahwa para saudara laki-laki seibu mewarisi diyat."
        },
        {
            "number": 2912,
            "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي اللَّيْثُ حَدَّثَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ الْعَقْلُ مِيرَاثٌ بَيْنَ وَرَثَةِ الْقَتِيلِ عَلَى كِتَابِ اللَّهِ وَفَرَائِضِهِ",
            "id": "Telah menceritakan kepada kami [Abdullah bin Shalih] telah bercerita kepadaku [Al Laits] telah menceritakan kepadaku [Yunus] dari [Ibnu Syihab] ia berkata; Diyat adalah warisan yang dibagikan di antara ahli waris korban yang terbunuh sesuai dengan kitab Allah dan pembagian yang telah ditetapkanNya."
        },
        {
            "number": 2913,
            "arab": " حَدَّثَنَا قَبِيصَةُ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ بَعْضِ وَلَدِ ابْنِ الْحَنَفِيَّةِ عَنْ عَلِيٍّ قَالَ لَقَدْ ظَلَمَ مَنْ لَمْ يُوَرِّثْ الْإِخْوَةَ مِنْ الْأُمِّ مِنْ الدِّيَةِ",
            "id": "Telah menceritakan kepada kami [Qabishah] telah menceritakan kepada kami [Sufyan] dari [Amr bin Dinar] dari [sebagian anak Ibnu Al Hanafiyyah] dari [Ali] ia berkata; Sungguh telah melakukan kezhaliman orang yang tidak memberikan hak waris dari harta diyat kepada para saudara laki-laki seibu."
        },
        {
            "number": 2914,
            "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو خَالِدٍ أَخْبَرَنَا ابْنُ سَالِمٍ عَنْ الشَّعْبِيِّ عَنْ عُمَرَ وَعَلِيٍّ وَزَيْدٍ قَالُوا الدِّيَةُ تُورَثُ كَمَا يُورَثُ الْمَالُ خَطَؤُهُ وَعَمْدُهُ",
            "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami [Abu Khalid] telah mengabarkan kepada kami [Ibnu Salim] dari [Asy Sya'bi] dari [Umar], [Ali] dan [Zaid]. Mereka berkata; Diyat dapat diwarisi sebagaimana harta yang dapat diwarisi, baik diyat pembunuhan yang tidak disengaja maupun yang disengaja."
        },
        {
            "number": 2915,
            "arab": " حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ حَدَّثَنَا إِسْمَعِيلُ عَنْ عَامِرٍ قَالَ كَانَ عَلِيٌّ لَا يُوَرِّثُ الْإِخْوَةَ مِنْ الْأُمِّ وَلَا الزَّوْجَ وَلَا الْمَرْأَةَ مِنْ الدِّيَةِ شَيْئًا قَالَ عَبْد اللَّهِ بَعْضُهُمْ يُدْخِلُ بَيْنَ إِسْمَعِيلَ وَعَامِرٍ رَجُلًا",
            "id": "Telah menceritakan kepada kami [Ja'far bin 'Aun] telah menceritakan kepada kami [Isma'il] dari [Amir] ia berkata; [Ali] tidak memberikan hak waris sedikitpun kepada para saudara laki-laki seibu, suami dan isteri dari diyat. Abdullah berkata; Sebagian mereka memasukkan seseorang (perawi dalam sanad hadits) di antara Isma'il dan Amir."
        },
        {
            "number": 2916,
            "arab": " حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ زِيَادٍ الْأَعْلَمِ عَنْ الْحَسَنِ قَالَ لَا يُوَرَّثُ الْإِخْوَةُ مِنْ الْأُمِّ مِنْ الدِّيَةِ",
            "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] dari [Hammad bin Salamah] dari [Ziyad Al A'lam] dari [Al Hasan] ia berkata; Saudara laki-laki seibu tidak dapat mewarisi harta yang berasal dari diyat."
        },
        {
            "number": 2917,
            "arab": " حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ عَنْ أَبِيهِ عَنْ خَارِجَةَ بْنِ زَيْدٍ عَنْ زَيْدِ بْنِ ثَابِتٍ قَالَ كُلُّ قَوْمٍ مُتَوَارِثِينَ عَمِيَ مَوْتُهُمْ فِي هَدْمٍ أَوْ غَرَقٍ فَإِنَّهُمْ لَا يَتَوَارَثُونَ يَرِثُهُمْ الْأَحْيَاءُ",
            "id": "Telah menceritakan kepada kami [Yahya bin Hassan] telah menceritakan kepada kami [Ibnu Abu Az Zinad] dari [ayahnya] dari [Kharijah bin Zaid] dari [Zaid bin Tsabit] ia berkata; Setiap orang yang berhak mewarisi (dari harta) yang meninggal dunia karena tertimpa reruntuhan atau tenggelam, maka mereka tidak dapat saling mewarisi. Tetapi ahli waris yang hidup dapat mewarisi mereka."
        },
        {
            "number": 2918,
            "arab": " حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ يَحْيَى بْنِ عَتِيقٍ قَالَ قَرَأْتُ فِي بَعْضِ كُتُبِ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ فِي الْقَوْمِ يَقَعُ عَلَيْهِمْ الْبَيْتُ لَا يُدْرَى أَيُّهُمَا مَاتَ قَبْلُ قَالَ لَا يُوَرَّثُ الْأَمْوَاتُ بَعْضُهُمْ مِنْ بَعْضٍ وَيُوَرَّثُ الْأَحْيَاءُ مِنْ الْأَمْوَاتِ",
            "id": "Telah menceritakan kepada kami [Yahya bin Hassan] telah menceritakan kepada kami [Hammad bin Zaid] dari [Yahya bin 'Atiq] ia berkata; Aku pernah membaca sebagian surat untuk [Umar bin Abdul Aziz] tentang beberapa orang yang tertimpa reruntuhan rumah, tidak diketahui siapa di antara mereka yang lebih dahulu meninggal dunia. Ia menjawab; Orang-orang yang meninggal dunia tidak dapat saling mewarisi sebagian dengan sebagian lain namun ahli waris yang masih hidup dapat mewarisi orang-orang yang telah meninggal dunia."
        },
        {
            "number": 2919,
            "arab": " حَدَّثَنَا نُعَيْمُ بْنُ حَمَّادٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ مُحَمَّدٍ حَدَّثَنَا جَعْفَرٌ عَنْ أَبِيهِ أَنَّ أُمَّ كُلْثُومٍ وَابْنَهَا زَيْدًا مَاتَا فِي يَوْمٍ وَاحِدٍ فَالْتَقَتْ الصَّائِحَتَانِ فِي الطَّرِيقِ فَلَمْ يَرِثْ كُلُّ وَاحِدٍ مِنْهُمَا مِنْ صَاحِبِهِ وَأَنَّ أَهْلَ الْحَرَّةِ لَمْ يَتَوَارَثُوا وَأَنَّ أَهْلَ صِفِّينَ لَمْ يَتَوَارَثُوا",
            "id": "Telah menceritakan kepada kami [Nu'aim bin Hammad] dari [Abdul Aziz bin Muhammad] telah menceritakan kepada kami [Ja'far] dari [ayahnya] bahwa Ummu Kultsum dan anak laki-lakinya, Zaid, keduanya meninggal dunia pada hari yang sama. Lalu ada dua orang yang berteriak di jalan bertemu, namun masing-masing dari keduanya tidak dapat mewarisi. Orang-orang yang meninggal dunia pada peristiwa Harrah tidak dapat saling mewarisi dan orang-orang yang meninggal dunia pada peristiwa Shiffin juga tidak dapat saling mewarisi."
        },
        {
            "number": 2920,
            "arab": " أَخْبَرَنَا جَعْفَرُ بْنُ عَوْنٍ أَخْبَرَنَا ابْنُ أَبِي لَيْلَى عَنْ الشَّعْبِيِّ أَنَّ بَيْتًا بِالشَّامِ وَقَعَ عَلَى قَوْمٍ فَوَرَّثَ عُمَرُ بَعْضَهُمْ مِنْ بَعْضٍ",
            "id": "Telah mengabarkan kepada kami [Ja'far bin 'Aun] telah mengabarkan kepada kami [Ibnu Abu Laila] dari [Asy Sya'bi] bahwa di Syam ada sebuah rumah runtuh dan menimpa penghuninya. Maka [Umar] memberikan warisan kepada sebagian mereka dari sebagian lainnya."
        },
        {
            "number": 2921,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ حُرَيْشٍ عَنْ أَبِيهِ عَنْ عَلِيٍّ أَنَّهُ وَرَّثَ أَخَوَيْنِ قُتِلَا بِصِفِّينَ أَحَدَهُمَا مِنْ الْآخَرِ",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Huraisy] dari [ayahnya] dari [Ali] bahwa ia memberikan hak waris kepada dua orang laki-laki bersaudara yang terbunuh pada peristiwa Shiffin. Salah satu dari mereka dapat mewarisi yang lain."
        },
        {
            "number": 2922,
            "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا حُمَيْدٌ عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ الْمُزَنِيِّ أَنَّ رَجُلًا هَلَكَ وَتَرَكَ عَمَّتَهُ وَخَالَتَهُ فَأَعْطَى عُمَرُ الْعَمَّةَ نَصِيبَ الْأَخِ وَأَعْطَى الْخَالَةَ نَصِيبَ الْأُخْتِ",
            "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Humaid] dari [Bakr bin Abdullah Al Muzani] bahwa ada seorang laki-laki meninggal dunia dan meninggalkan seorang bibi dari pihak ayah dan bibi dari pihak ibu. Maka [Umar] memberikan bagian kepada bibi dari pihak ayah seperti bagian saudara laki-laki dan memberikan kepada bibi dari pihak ibu seperti bagian saudara perempuan."
        },
        {
            "number": 2923,
            "arab": " أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَبُو شِهَابٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ قَالَ مَنْ أَدْلَى بِرَحِمٍ أُعْطِيَ بِرَحِمِهِ الَّتِي يُدْلِي بِهَا",
            "id": "Telah mengabarkan kepada kami [Ahmad bin Abdullah] telah menceritakan kepada kami [Abu Syihab] dari [Al A'masy] dari [Ibrahim] ia berkata; Barangsiapa yang mempunyai hubungan satu rahim, maka ia diberikan warisan dengan sebab hubungan satu rahim yang menyebabkan ia terhubung."
        },
        {
            "number": 2924,
            "arab": " حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَبُو شِهَابٍ قَالَ حَدَّثَنِي أَبُو إِسْحَقَ الشَّيْبَانِيُّ عَنْ الشَّعْبِيِّ فِي رَجُلٍ تَرَكَ عَمَّتَهُ وَابْنَةَ أَخِيهِ قَالَ الْمَالُ لِابْنَةِ أَخِيهِ",
            "id": "Telah menceritakan kepada kami [Ahmad bin Abdullah] telah menceritakan kepada kami [Abu Syihab] ia berkata; telah menceritakan kepadaku [Abu Ishaq Asy Syaibani] dari [Asy Sya'bi] tentang seorang laki-laki yang meninggalkan seorang bibi dari pihak ayah dan anak perempuan dari saudara laki-laki, ia berkata; Harta diberikan kepada anak perempuan dari saudara laki-laki."
        },
        {
            "number": 2925,
            "arab": "حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا شَرِيكٌ عَنْ لَيْثٍ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْخَالُ وَارِثٌ",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Syarik] dari [Laits] dari [Muhammad bin Munkadir] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, Beliau bersabda: \"Paman dari pihak ibu adalah ahli waris.\""
        },
        {
            "number": 2926,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا حَسَنٌ عَنْ عُبَيْدَةَ عَنْ إِبْرَاهِيمَ أَنَّ عُمَرَ وَعَبْدَ اللَّهِ رَأَيَا أَنْ يُوَرِّثَا خَالًا",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Hasan] dari [Ubaidah] dari [Ibrahim] bahwa [Umar] dan [Abdullah] berpendapat bahwa bibi dari pihak ibu dapat mewarisi."
        },
        {
            "number": 2927,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا حَسَنٌ عَنْ سُلَيْمَانَ أَبِي إِسْحَقَ عَنْ الشَّعْبِيِّ فِي عَمَّةٍ وَبِنْتِ أَخٍ قَالَ الْمَالُ لِابْنَةِ الْأَخِ حَدَّثَنَا أَبُو نُعَيْمٍ أَخْبَرَنَا حَسَنٌ عَنْ سُلَيْمَانَ عَنْ بَعْضِهِمْ عَنْ إِبْرَاهِيمَ قَالَ لِلْعَمَّةِ",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Hasan] dari [Sulaiman Abu Ishaq] dari [Asy Sya'bi] tentang bibi dari pihak ibu dan anak perempuan dari saudara laki-laki, ia berkata; Harta warisan diberikan kepada anak perempuan dari saudara laki-laki. Telah menceritakan kepada kami [Abu Nu'aim] telah mengabarkan kepada kami [Hasan] dari [Sulaiman] dari [sebagian mereka] dari [Ibrahim] ia berkata; Harta tersebut diberikan kepada bibi dari pihak ayah."
        },
        {
            "number": 2928,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ الشَّيْبَانِيِّ عَنْ الشَّعْبِيِّ فِي بِنْتِ أَخٍ وَعَمَّةٍ قَالَ أَعْطِي الْمَالَ لِابْنَةِ الْأَخِ",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Asy Syaibani] dari [Asy Sya'bi] tentang anak perempuan dari saudara laki-laki dan bibi dari pihak ayah, ia berkata; Harta diberikan kepada anak perempuan dari saudara laki-laki."
        },
        {
            "number": 2929,
            "arab": "حَدَّثَنَا يَعْلَى حَدَّثَنَا زَكَرِيَّا عَنْ عَامِرٍ عَنْ مَسْرُوقٍ فِي رَجُلٍ تُوُفِّيَ وَلَيْسَ لَهُ وَارِثٌ إِلَّا ابْنَةُ أَخِيهِ وَخَالُهُ قَالَ لِلْخَالِ نَصِيبُ أُخْتِهِ وَلِابْنَةِ الْأَخِ نَصِيبُ أَبِيهَا",
            "id": "Telah menceritakan kepada kami Ya'la telah menceritakan kepada kami Zakariya dari Amir dari Masruq tentang seseorang yang meninggal dunia dan tidak memiliki ahli waris selain anak perempuan dari saudara laki-laki dan bibi dari pihak ibu, ia berkata; Untuk bibi dari pihak ibu sama seperti bagian saudara perempuan, dan untuk anak perempuan dari saudara laki-laki seperti bagian ayahnya."
        },
        {
            "number": 2930,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا يُونُسُ عَنْ عَامِرٍ قَالَ كَانَ مَسْرُوقٌ يُنَزِّلُ الْعَمَّةَ بِمَنْزِلَةِ الْأَبِ إِذَا لَمْ يَكُنْ أَبٌ وَالْخَالَةَ بِمَنْزِلَةِ الْأُمِّ إِذَا لَمْ تَكُنْ أُمٌّ",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Yunus] dari [Amir] ia berkata; [Masruq] menempatkan bibi dari pihak ayah sama pada kedudukan ayah jika mayit tidak memiliki ayah dan bibi dari pihak ibu pada kedudukan ibu jika mayit tidak memiliki ibu."
        },
        {
            "number": 2931,
            "arab": " حَدَّثَنَا يَعْلَى عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ مُحَمَّدِ بْنِ حَبَّانَ نَسَبَهُ إِلَى جَدِّهِ عَنْ عَمِّهْ وَاسِعِ بْنِ حَبَّانَ قَالَ تُوُفِّيَ ابْنُ الدَّحْدَاحَةِ وَكَانَ أَتِيًّا وَهُوَ الَّذِي لَا يُعْرَفُ لَهُ أَصْلٌ فَكَانَ فِي بَنِي الْعَجْلَانِ وَلَمْ يَتْرُكْ عَقِبًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِعَاصِمِ بْنِ عَدِيٍّ هَلْ تَعْلَمُونَ لَهُ فِيكُمْ نَسَبًا قَالَ مَا نَعْرِفُهُ يَا رَسُولَ اللَّهِ فَدَعَا ابْنَ أُخْتِهِ فَأَعْطَاهُ مِيرَاثَهُ",
            "id": "Telah menceritakan kepada kami [Ya'la] dari [Muhammad bin Ishaq] dari [Muhammad bin Habban] ia menisbatkan kepada kakeknya dari pamannya [Wasi' bin Habban] ia berkata; Ibnu Ad-Dahdahah meninggal dan ia adalah seorang pendatang yang tidak dikenali asal usul keturunannya, ia tinggal di Bani Al-'Ajlan dan tidak meninggalkan seorang anak. Maka Rasulullah shallallahu 'alaihi wasallam bertanya kepada 'Ashim bin Adi; \"Apakah kalian mengetahui ia memiliki hubungan nasab dengan kalian?\" Ia menjawab; Kami tidak tahu, wahai Rasulullah. Maka beliau memanggil anak laki-laki dari saudara perempuannya dan kepada anak laki-laki dari saudara perempuannya tersebut beliau memberikan harta warisannya."
        },
        {
            "number": 2932,
            "arab": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ حَدَّثَنَا أَبِي عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عُمَرَ أَنَّهُ أَعْطَى خَالًا الْمَالَ",
            "id": "Telah menceritakan kepada kami Umar bin Hafsh bin Ghiyats telah menceritakan kepada kami ayahku dari Al A'masy dari Ibrahim dari Umar bahwa ia memberikan harta warisan kepada bibi dari pihak ibu."
        },
        {
            "number": 2933,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا أَبُو هَانِئٍ قَالَ سُئِلَ عَامِرٌ عَنْ امْرَأَةٍ أَوْ رَجُلٍ تُوُفِّيَ وَتَرَكَ خَالَةً وَعَمَّةً لَيْسَ لَهُ وَارِثٌ وَلَا رَحِمٌ غَيْرُهُمَا فَقَالَ كَانَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ يُنَزِّلُ الْخَالَةَ بِمَنْزِلَةِ أُمِّهِ وَيُنَزِّلُ الْعَمَّةَ بِمَنْزِلَةِ أَخِيهَا",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Abu Hani`] ia berkata; [Amir] pernah ditanya tentang seorang perempuan atau laki-laki yang meninggal dunia dan meninggalkan seorang bbi dari pihak ibu dan seorang bibi dari pihak ayah. Tidak ada seorang ahli waris dan orang yang satu rahim pun selain mereka berdua. Maka ia berkata; [Abdullah Mas'ud] menempatkan bibi dari pihak ibu pada kedudukan ibu dan bibi dari pihak ayah pada kedudukan saudara laki-laki."
        },
        {
            "number": 2934,
            "arab": " حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَبُو شِهَابٍ عَنْ عَمْرٍو عَنْ الْحَسَنِ فِي رَجُلٍ اعْتَرَفَ عِنْدَ مَوْتِهِ بِأَلْفِ دِرْهَمٍ لِرَجُلٍ وَأَقَامَ آخَرُ بَيِّنَةً بِأَلْفِ دِرْهَمٍ وَتَرَكَ الْمَيِّتُ أَلْفَ دِرْهَمٍ فَقَالَ الْمَالُ بَيْنَهُمَا نِصْفَيْنِ إِلَّا أَنْ يَكُونَ مُفْلِسًا فَلَا يَجُوزُ إِقْرَارُهُ",
            "id": "Telah menceritakan kepada kami [Ahmad bin Abdullah] telah menceritakan kepada kami [Abu Syihab] dari [Amr] dari [Al Hasan] tentang seorang laki-laki ketika meninggal dunia mengaku mempunyai hutang seribu dirham kepada seseorang dan ada orang lain yang memberikan bukti bahwa ia (si mayit) juga mempunyai hutang seribu dirham kepadanya. Sementara si mayit tersebut hanya meninggalkan harta seribu dirham, ia berkata; Harta itu dibagi dua, masing-masing mendapat setengah, kecuali jika si mayit adalah orang yang tidak punya harta maka pengakuannya tidak dibenarkan."
        },
        {
            "number": 2935,
            "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ قَالَ قُلْتُ لِشَرِيكٍ كَيْفَ ذَكَرْتَ فِي الْأَخَوَيْنِ يَدَّعِي أَحَدُهُمَا أَخًا قَالَ يَدْخُلُ عَلَيْهِ فِي نَصِيبِهِ قُلْتُ مَنْ ذَكَرَهُ قَالَ جَابِرٌ عَنْ عَامِرٍ عَنْ عَلِيٍّ",
            "id": "Telah mengabarkan kepada kami [Abu Nu'aim] ia berkata; Aku bertanya kepada [Syarik]; Bagaimana riwayat yang engkau sebutkan tentang dua saudara laki-laki yang salah satunya mengaku sebagai saudara? Ia menjawab; Orang yang mengaku ini masuk dalam bagian saudara. Aku bertanya; Siapa yang meriwayatkannya? Ia menjawab; [Jabir] dari [Amir] dari [Ali]."
        },
        {
            "number": 2936,
            "arab": " حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدٍ الْمُحَارِبِيُّ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ فِي الْإِخْوَةِ يَدَّعِي بَعْضُهُمْ الْأَخَ وَيُنْكِرُ الْآخَرُونَ قَالَ يَدْخُلُ مَعَهُمْ بِمَنْزِلَةِ عَبْدٍ يَكُونُ بَيْنَ الْإِخْوَةِ فَيَعْتِقَ أَحَدُهُمْ نَصِيبَهُ قَالَ وَكَانَ عَامِرٌ وَالْحَكَمُ وَأَصْحَابُهُمَا يَقُولُونَ لَا يَدْخُلُ إِلَّا فِي نَصِيبِ الَّذِي اعْتَرَفَ بِهِ",
            "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Abdurrahman bin Muhammad Al Muharibi] dari [Al A'masy] dari [Ibrahim] tentang para saudara laki-laki di mana sebagian mereka mengaku sebagai saudara dan sebagian lainnya tidak mengaku sebagai saudara, ia berkata; Saudara yang tidak mengaku sebagai saudara masuk bersama mereka seperti seorang budak yang dimiliki beberapa saudara, lalu salah seorang dari mereka tersebut memerdekakan bagiannya. Ia berkata lagi; [Amir], [Hakam] dan para sahabat mereka berkata; Ia tidak masuk kecuali dalam bagian saudara yang mengaku sebagai saudaranya."
        },
        {
            "number": 2937,
            "arab": " حَدَّثَنَا أَبُو بَكْرٍ عَنْ وَكِيعٍ قَالَ إِذَا كَانَا أَخَوَيْنِ فَادَّعَى أَحَدُهُمَا أَخًا وَأَنْكَرَهُ الْآخَرُ قَالَ كَانَ ابْنُ أَبِي لَيْلَى يَقُولُ هِيَ مِنْ سِتَّةٍ لِلَّذِي لَمْ يَدَّعِ ثَلَاثَةٌ وَلِلْمُدَّعِي سَهْمَانِ وَلِلْمُدَّعَى سَهْمٌ",
            "id": "Telah menceritakan kepada kami [Abu Bakr] dari [Waki'] ia berkata; Jika ada dua orang bersaudara, lalu salah satunya mengaku sebagai saudara dan yang lainnya tidak mengaku sebagai saudara, [Ibnu Abu Laila] berkata; Pembagian warisannya dari enam. Orang yang tidak mengaku mendapat tiga bagian, orang yang mengakui mendapat dua bagian dan orang yang diakui mendapatkan satu bagian."
        },
        {
            "number": 2938,
            "arab": " حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ مُغِيرَةَ عَنْ حَمَّادٍ فِي الرَّجُلِ يَكُونُ لَهُ ثَلَاثَةُ بَنِينَ فَقَالَ ثُلُثِي لِأَصْغَرِ بَنِيَّ فَقَالَ الْأَوْسَطُ أَنَا أُجِيزُ وَقَالَ الْأَكْبَرُ لَا أُجِيزُ قَالَ هِيَ مِنْ تِسْعَةٍ يُخْرِجُ ثُلُثَهُ فَلَهُ سَهْمُهُ وَسَهْمُ الَّذِي أَجَازَ وَقَالَ حَمَّادٌ يَرُدُّ السَّهْمَ عَلَيْهِمْ جَمِيعًا وَقَالَ عَامِرٌ الَّذِي رَدَّ إِنَّمَا رَدَّ عَلَى نَفْسِهِ",
            "id": "Telah menceritakan kepada kami [Yunus bin Muhammad] telah menceritakan kepada kami [Abu 'Awanah] dari [Mughirah] dari [Hammad] tentang seorang laki-laki yang memiliki tiga orang anak laki-laki. Laki-laki itu pun berkata; Sepertiga hartaku untuk anakku yang bungsu. Anak kedua berkata; Aku membolehkan dan anak yang sulung berkata; Aku tidak membolehkan. Ia menjawab; Pembagian warisan ini dari sembilan. Dikeluarkan sepertiganya, yang tidak membolehkan mendapat bagiannya dan satu bagian untuk yang membolehkan. Hammad berkata; Bagian dikembalikan kepada mereka. Sedangkan [Amir] berkata; Orang yang menolak, sesungguhnya ia menolak atas dirinya sendiri."
        },
        {
            "number": 2939,
            "arab": " حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ عَنْ شَرِيكٍ عَنْ خَالِدٍ عَنْ ابْنِ سِيرِينَ عَنْ شُرَيْحٍ فِي رَجُلٍ أَقَرَّ بِأَخٍ قَالَ بَيِّنَتُهُ أَنَّهُ أَخُوهُ",
            "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Yahya bin Adam] dari [Syarik] dari [Khalid] dari [Ibnu Sirin] dari [Syuraih] tentang seseorang yang mengaku sebagai saudara mayit, ia berkata; Ia harus menunjukkan bukti bahwa ia adalah saudaranya."
        },
        {
            "number": 2940,
            "arab": " أَخْبَرَنَا أَبُو النُّعْمَانِ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ مُغِيرَةَ عَنْ الْحَارِثِ الْعُكْلِيِّ فِي رَجُلٍ أَقَرَّ عِنْدَ مَوْتِهِ بِأَلْفِ دِرْهَمٍ مُضَارَبَةً وَأَلْفٍ دَيْنًا وَلَمْ يَدَعْ إِلَّا أَلْفَ دِرْهَمٍ قَالَ يُبْدَأُ بِالدَّيْنِ فَإِنْ فَضَلَ فَضْلٌ كَانَ لِصَاحِبِ الْمُضَارَبَةِ",
            "id": "Telah mengabarkan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Abu 'Awanah] dari [Mughirah] dari [Al Harits Al 'Ukli] tentang seseorang yang mengaku ketika hendak meninggal dunia bahwa ia memiliki pinjaman seribu dirham secara mudlarabah dan hutang seribu dirham. Tetapi ia tidak mengaku kecuali seribu dirham saja, ia berkata; Hutang dilunasi dahulu. Jika ada sisa (dari harta), maka diberikan kepada orang yang memberi pinjaman secara mudlarabah. "
        },
        {
            "number": 2941,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا حَسَنٌ عَنْ مُطَرِّفٍ عَنْ الشَّعْبِيِّ فِي رَجُلٍ مَاتَ وَتَرَكَ ثَلَاثَ مِائَةِ دِرْهَمٍ وَثَلَاثَةَ بَنِينَ فَجَاءَ رَجُلٌ يَدَّعِي مِائَةَ دِرْهَمٍ عَلَى الْمَيِّتِ فَأَقَرَّ لَهُ أَحَدُهُمْ قَالَ يَدْخُلُ عَلَيْهِمْ بِالْحِصَّةِ ثُمَّ قَالَ الشَّعْبِيُّ مَا أُرَى أَنْ يَكُونَ مِيرَاثًا حَتَّى يُقْضَى الدَّيْنُ",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Hasan] dari [Mutharrif] dari [Asy Sya'bi] tentang seseorang yang meninggal dunia dan meninggalkan harta senilai tiga ratus dirham dan tiga orang anak laki-laki. Lalu ada seseorang mengakui si mayit berhutang seratus dirham kepadanya. Salah seorang dari anak-anaknya membenarkan pengakuan tersebut. Ia berkata; Hutang itu termasuk dalam bagian mereka yang membenarkan. Kemudian Asy Sya'bi berkata; Aku tidak berpendapat si mayit memiliki warisan hingga hutang dilunasi."
        },
        {
            "number": 2942,
            "arab": " حَدَّثَنَا أَبُو خَيْثَمَةَ مُصْعَبُ بْنُ سَعِيدٍ الْحَرَّانِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ عَنْ الْأَشْعَثِ عَنْ الْحَسَنِ فِي رَجُلٍ هَلَكَ وَتَرَكَ ابْنَيْنِ وَتَرَكَ أَلْفَيْ دِرْهَمٍ فَاقْتَسَمَا الْأَلْفَيْ دِرْهَمٍ وَغَابَ أَحَدُ الِابْنَيْنِ فَجَاءَ رَجُلٌ فَاسْتَحَقَّ عَلَى الْمَيِّتِ أَلْفَ دِرْهَمٍ قَالَ يَأْخُذُ جَمِيعَ مَا فِي يَدِ هَذَا الشَّاهِدِ وَيُقَالُ لَهُ اتَّبِعْ أَخَاكَ الْغَائِبَ وَخُذْ نِصْفَ مَا فِي يَدِهِ",
            "id": "Telah menceritakan kepada kami [Abu Khaitsamah Mush'ab bin Sa'id Al Harrani] telah menceritakan kepada kami [Muhammad bin Abdullah] dari [Al Asy'ats] dari [Al Hasan] tentang seseorang yang meninggal dunia dan meninggalkan dua anak laki-laki dan harta senilai dua ribu dirham. Keduanya pun sepakat untuk membagi dua ribu dirham dan salah satunya pergi. Lalu ada seseorang datang dan menuntut hutang terhadap si mayit senilai seribu dirham. Ia berkata; Ia boleh mengambil semua yang ada di tangan anak laki-laki yang berada di tempat dan dikatakan kepadanya; Cari saudaramu yang pergi tersebut lalu ambil setengah dari apa yang ada di tangannya."
        },
        {
            "number": 2943,
            "arab": " حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ زِيَادٍ الْأَعْلَمِ عَنْ الْحَسَنِ قَالَ إِذَا أَقَرَّ بَعْضُ الْوَرَثَةِ بِدَيْنٍ فَهُوَ عَلَيْهِ بِحِصَّتِهِ",
            "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] dari [Hammad bin Salamah] dari [Ziyad Al A'lam] dari [Al Hasan] ia berkata; Jika sebagian ahli waris membenarkan si mayit memiliki hutang maka ahli waris tersebut harus melunasinya."
        },
        {
            "number": 2944,
            "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ أَبِي هَاشِمٍ عَنْ إِبْرَاهِيمَ قَالَ إِذَا شَهِدَ اثْنَانِ مِنْ الْوَرَثَةِ بِدَيْنٍ فَهُوَ مِنْ جَمِيعِ الْمَالِ إِذَا كَانُوا عُدُولًا وَقَالَ الشَّعْبِيُّ عَلَيْهِمَا فِي نَصِيبِهِمَا",
            "id": "Telah menceritakan kepada kami Sulaiman bin Harb dari Hammad bin Salamah dari Abu Hasyim dari Ibrahim ia berkata; Jika dua orang dari ahli waris bersaksi bahwa si mayit memiliki hutang maka harus dilunasi dengan seluruh harta warisan jika mereka adalah orang yang adil. Asy Sya'bi berkata; Kedua ahli waris itu harus melunasi dengan bagian mereka."
        },
        {
            "number": 2945,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا ثَابِتُ بْنُ الْوَلِيدِ بْنِ جُمَيْعٍ قَالَ أَخْبَرَنِي أَبِي عَنْ الْقَاسِمِ بْنِ عَبْدِ الرَّحْمَنِ قَالَ كَانَ ابْنُ مَسْعُودٍ يُوَرِّثُ أَهْلَ الْمُرْتَدِّ إِذَا قُتِلَ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Tsabit bin Al Walid bin Jumai'] ia berkata; telah mengabarkan kepada kami [ayahku] dari [Al Qasim bin Abdur Rahman] ia berkata; [Ibnu Mas'ud] memberikan hak waris kepada ahli waris orang murtad jika ia terbunuh."
        },
        {
            "number": 2946,
            "arab": " حَدَّثَنَا الْحَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي عَمْرٍو الشَّيْبَانِيِّ أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ جَعَلَ مِيرَاثَ الْمُرْتَدِّ لِوَرَثَتِهِ مِنْ الْمُسْلِمِينَ",
            "id": "Telah menceritakan kepada kami [Al Hajjaj bin Minhal] telah menceritakan kepada kami [Abu 'Awanah] dari [Al A'masy] dari [Abu Amr Asy Syaibani] bahwa [Ali bin Abu Thalib] menjadikan warisan orang murtad untuk ahli warisnya dari kaum muslimin."
        },
        {
            "number": 2947,
            "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا الْحَجَّاجُ عَنْ الْحَكَمِ أَنَّ عَلِيًّا قَضَى فِي مِيرَاثِ الْمُرْتَدِّ لِأَهْلِهِ مِنْ الْمُسْلِمِينَ",
            "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Al Hajjaj] dari [Al Hakam] bahwa [Ali] memutuskan warisan orang murtad untuk keluarganya dari kaum muslimin."
        },
        {
            "number": 2948,
            "arab": " حَدَّثَنَا زَكَرِيَّا بْنُ عَدِيٍّ حَدَّثَنَا عُبَيْدُ اللَّهِ هُوَ ابْنُ عَمْرٍو عَنْ عَبْدِ الْكَرِيمِ عَنْ الْحَكَمِ قَالَ إِذَا قَتَلَ الرَّجُلُ أَخَاهُ عَمْدًا لَمْ يُوَرَّثْ مِنْ مِيرَاثِهِ وَلَا مِنْ دِيَتِهِ فَإِذَا قَتَلَهُ خَطَأً وُرِّثَ مِنْ مِيرَاثِهِ وَلَمْ يُوَرَّثْ مِنْ دِيَتِهِ قَالَ وَكَانَ عَطَاءٌ يَقُولُ ذَلِكَ",
            "id": "Telah menceritakan kepada kami [Zakariya bin 'Adi] telah menceritakan kepada kami [Ubaidullah] ia adalah Ibnu Amr, dari [Abdul Karim] dari [Al Hakam] ia berkata; Jika seseorang membunuh saudaranya secara sengaja maka ia tidak dapat mewarisi harta warisan darinya dan tidak pula dari diyatnya. Namun jika ia membunuhnya secara tidak sengaja maka ia dapat mewarisi harta warisannya. Tetapi tidak dapat mewarisi diyatnya. Ia berkata lagi; [Atha`] berpendapat seperti itu."
        },
        {
            "number": 2949,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ عَنْ عَلِيِّ بْنِ مُسْهِرٍ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ خِلَاسٍ عَنْ عَلِيٍّ قَالَ رَمَى رَجُلٌ أُمَّهُ بِحَجَرٍ فَقَتَلَهَا فَطَلَبَ مِيرَاثَهُ مِنْ إِخْوَتِهِ فَقَالَ لَهُ إِخْوَتُهُ لَا مِيرَاثَ لَكَ فَارْتَفَعُوا إِلَى عَلِيٍّ فَجَعَلَ عَلَيْهِ الدِّيَةَ وَأَخْرَجَهُ مِنْ الْمِيرَاثِ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Uyainah] dari [Ali bin Mushir] dari [Sa'id] dari [Qatadah] dari [Khilas] dari [Ali] ia berkata; Ada seseorang melempar ibunya dengan batu hingga membunuhnya, lalu orang tersebut meminta warisan kepada para saudaranya. Para saudaranya pun berkata kepadanya; Tidak ada warisan bagimu. Lalu mereka mengadukan masalah ini kepada Ali, ia pun memutuskan bahwa orang tersebut wajib membayar diyat dan dikeluarkan dari warisan."
        },
        {
            "number": 2950,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا زُهَيْرٌ عَنْ الْحَسَنِ بْنِ الْحُرِّ عَنْ الْحَكَمِ أَنَّ الرَّجُلَ إِذَا قَتَلَ امْرَأَتَهُ خَطَأً أَنَّهُ يُمْنَعُ مِيرَاثَهُ مِنْ الْعَقْلِ وَغَيْرِهِ",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Zuhair] dari [Al Hasan bin Al Hurr] dari [Al Hakam] bahwa jika seseorang membunuh isterinya secara tidak sengaja maka ia tidak dapat mewarisi baik dari harta diyat maupun lainnya."
        },
        {
            "number": 2951,
            "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ لَيْثٍ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ قَالَ لَا يَرِثُ الْقَاتِلُ مِنْ الْمَقْتُولِ شَيْئًا",
            "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Laits] dari [Mujahid] dari [Ibnu Abbas] ia berkata; Pembunuh tidak dapat mewarisi sedikit pun dari harta orang yang dibunuh."
        },
        {
            "number": 2952,
            "arab": " حَدَّثَنَا سَعِيدُ بْنُ الْمُغِيرَةِ عَنْ ابْنِ الْمُبَارَكِ عَنْ مَعْمَرٍ عَنْ قَتَادَةَ فِي رَجُلٍ قَذَفَ امْرَأَتَهُ وَجَاءَ بِشُهُودٍ فَرُجِمَتْ قَالَ يَرِثُهَا",
            "id": "Telah menceritakan kepada kami [Sa'id bin Al Mughirah] dari [Ibnu Al Mubarak] dari [Ma'mar] dari [Qatadah] tentang seorang laki-laki yang menuduh isterinya dan ia mendatangkan beberapa saksi lalu isterinya pun dirajam, ia berkata; Suami dapat mewarisi isterinya."
        },
        {
            "number": 2953,
            "arab": " حَدَّثَنَا أَبُو النُّعْمَانِ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ حَمَّادٍ فِي رَجُلٍ جُلِدَ الْحَدَّ أَرَاهُ مَاتَ شَكَّ أَبُو النُّعْمَانِ قَالَ يَتَوَارَثَانِ",
            "id": "Telah menceritakan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Abu 'Awanah] dari [Hammad] tentang seorang laki-laki yang dijatuhi hukuman dera, menurutku ia meninggal, Abu An Nu'man ragu, ia berkata; Mereka dapat saling waris mewarisi."
        },
        {
            "number": 2954,
            "arab": " حَدَّثَنَا أَبُو النُّعْمَانِ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ مُحَمَّدِ بْنِ سَالِمٍ عَنْ عَامِرٍ عَنْ عَلِيٍّ قَالَ الْقَاتِلُ لَا يَرِثُ وَلَا يَحْجُبُ",
            "id": "Telah menceritakan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Abu 'Awanah] dari [Muhammad bin Salim] dari [Amir] dari [Ali] ia berkata; Pembunuh tidak dapat mewarisi dan tidak dapat menghalangi pembagian warisan."
        },
        {
            "number": 2955,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا حَسَنٌ عَنْ لَيْثٍ عَنْ أَبِي عَمْرٍو الْعَبْدِيِّ عَنْ عَلِيٍّ قَالَ لَا يُوَرَّثُ الْقَاتِلُ",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Hasan] dari [Laits] dari [Abu Amr Al 'Abdi] dari [Ali] ia berkata; Pembunuh tidak dapat mewarisi."
        },
        {
            "number": 2956,
            "arab": " حَدَّثَنَا زَكَرِيَّا بْنُ عَدِيٍّ حَدَّثَنَا أَبُو بَكْرٍ عَنْ مُطَرِّفٍ عَنْ الشَّعْبِيِّ قَالَ قَالَ عُمَرُ لَا يَرِثُ قَاتِلٌ خَطَأً وَلَا عَمْدًا",
            "id": "Telah menceritakan kepada kami [Zakariya bin Adi] telah menceritakan kepada kami [Abu Bakr] dari [Mutharrif] dari [Asy Sya'bi] ia berkata; [Umar] berkata; Pembunuh tidak berhak mewarisi, baik pembunuhan yang dilakukan secara tidak sengaja maupun secara sengaja."
        },
        {
            "number": 2957,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ لَيْثٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَ لَا يَرِثُ الْقَاتِلُ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Sufyan] dari [Laits] dari [Thawus] dari [Ibnu Abbas] ia berkata; Pembunuh tidak dapat mewarisi."
        },
        {
            "number": 2958,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ قَالَ إِذَا اجْتَمَعَ نَسَبَانِ وُرِّثَ بِأَكْبَرِهِمَا يَعْنِي الْمَجُوسَ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Abdul A'la] dari [Ma'mar] dari [Az Zuhri] ia berkata; Jika dua nasab bergabung maka yang mewarisi adalah nasab yang lebih tua, yakni Majusi."
        },
        {
            "number": 2959,
            "arab": " حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ حَمَّادِ بْنِ أَبِي سُلَيْمَانَ قَالَ يَرِثُ مِنْ الْجَانِبِ الَّذِي يَصْلُحُ وَلَا يَرِثُ مِنْ الْجَانِبِ الَّذِي لَا يَصْلُحُ",
            "id": "Telah menceritakan kepada kami [Hajjaj bin [Muhammad bin Al Minhal]] telah menceritakan kepada kami [Hammad bin Salamah] dari [Hammad bin Abu Sulaiman] ia berkata; Ia mewarisi dari pihak yang pantas dan tidak mewarisi dari pihak yang tidak pantas."
        },
        {
            "number": 2960,
            "arab": " حَدَّثَنَا حَجَّاجٌ حَدَّثَنَا حَمَّادٌ عَنْ سُفْيَانَ الثَّوْرِيِّ عَنْ رَجُلٍ عَنْ الشَّعْبِيِّ أَنَّ عَلِيًّا وَابْنَ مَسْعُودٍ قَالَا فِي الْمَجُوسِ إِذَا أَسْلَمُوا يَرِثُونَ مِنْ الْقَرَابَتَيْنِ جَمِيعًا",
            "id": "Telah menceritakan kepada kami [Hajjaj] telah menceritakan kepada kami [Hammad] dari [Sufyan Ats Tsauri] dari [seseorang] dari [Asy Sya'bi] bahwa [Ali] dan [Ibnu Mas'ud] keduanya berkata tentang orang Majusi yang masuk Islam; Mereka berhak mewarisi dari dua kerabat semuanya."
        },
        {
            "number": 2961,
            "arab": " أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ عَنْ أَبِيهِ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ فِي امْرَأَةِ الْأَسِيرِ أَنَّهَا تَرِثُهُ وَيَرِثُهَا",
            "id": "Telah mengabarkan kepada kami [Yahya bin Hassan] telah menceritakan kepada kami [Ibnu Abu Az Zinad] dari [ayahnya] dari [Umar bin Abdul Aziz] tentang seorang perempuan yang ditawan; Sesungguhnya ia dapat mewarisi suaminya dan suaminya dapat mewarisinya."
        },
        {
            "number": 2962,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ الْفَضْلِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ حَدَّثَنِي مَعْمَرٌ عَنْ إِسْحَقَ بْنِ رَاشِدٍ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ فِي الْأَسِيرِ يُوصِي قَالَ أَجِزْ لَهُ وَصِيَّتَهُ مَا دَامَ عَلَى دِينِهِ لَمْ يَتَغَيَّرْ عَنْ دِينِهِ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Al Fadlal] telah menceritakan kepada kami [Abdullah bin Al Mubarak] telah menceritakan kepadaku [Ma'mar] dari [Ishaq bin Rasyid] dari [Umar bin Abdul Aziz] tentang tawanan yang berwasiat, ia berkata; Aku membolehkan wasiatnya selama ia masih memeluk agamanya dan tidak berubah dari agamanya tersebut."
        },
        {
            "number": 2963,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ دَاوُدَ عَنْ الشَّعْبِيِّ عَنْ شُرَيْحٍ قَالَ يُوَرَّثُ الْأَسِيرُ إِذَا كَانَ فِي أَيْدِي الْعَدُوِّ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Dawud] dari [Asy Sya'bi] dari [Syuraih] ia berkata; Orang yang ditawan berhak mewarisi sekalipun ia berada di tangan musuh."
        },
        {
            "number": 2964,
            "arab": " حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا سُفْيَانُ حَدَّثَنِي مَنْ سَمِعَ إِبْرَاهِيمَ يَقُولُ يُوَرَّثُ الْأَسِيرُ",
            "id": "Telah menceritakan kepada kami [Muhammad] ia berkata; Telah menceritakan kepada kami [Sufyan] telah menceritakan kepadaku [orang yang mendengar] [Ibrahim] ia berkata; Orang yang ditawan berhak mewarisi."
        },
        {
            "number": 2965,
            "arab": " حَدَّثَنَا الْمُعَلَّى بْنُ أَسَدٍ حَدَّثَنَا وُهَيْبٌ عَنْ دَاوُدَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّهُ كَانَ لَا يُوَرِّثُ الْأَسِيرَ",
            "id": "Telah menceritakan kepada kami [Al Mu'alla bin Asad] telah menceritakan kepada kami [Wuhaib] dari [Dawud] dari [Sa'id bin Al Musayyab] bahwa ia tidak memberikan hak waris kepada orang yang ditawan."
        },
        {
            "number": 2966,
            "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا الْأَشْعَثُ عَنْ الشَّعْبِيِّ قَالَ كَتَبَ عُمَرُ بْنُ الْخَطَّابِ إِلَى شُرَيْحٍ أَنْ لَا يُوَرِّثَ الْحَمِيلَ إِلَّا بِبَيِّنَةٍ وَإِنْ جَاءَتْ بِهِ فِي خِرَقِهَا",
            "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Al Asy'ats] dari [Asy Sya'bi] ia berkata; [Umar bin Al Khaththab] menulis surat kepada Syuraih, agar ia tidak memberikan hak waris kepada orang yang di bawa ke negeri Islam saat masih kecil kecuali ada bukti sekali pun ia datang dengan membawa kain-kain yang digunakannya saat masih kecil."
        },
        {
            "number": 2967,
            "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ عَنْ إِسْرَائِيلَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ قَالَ وَرِّثْ الْحَمِيلَ",
            "id": "Telah mengabarkan kepada kami [Ubaidullah] dari [Isra`il] dari [Manshur] dari [Ibrahim] ia berkata; Warisilah harta orang yang dibawa ke negeri Islam saat masih kecil."
        },
        {
            "number": 2968,
            "arab": " حَدَّثَنَا أَبُو سَعِيدٍ مِنْ بَنِي أُمَيَّةَ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي مَرْيَمَ عَنْ ضَمْرَةَ وَالْفُضَيْلِ بْنِ فَضَالَةَ وَابْنِ أَبِي عَوْفٍ وَرَاشِدٍ وَعَطِيَّةَ قَالُوا لَا يُوَرَّثُ الْحُمَلَاءُ",
            "id": "Telah menceritakan kepada kami [Abu Sa'id] dari bani Umayah dari [Abu Bakr bin Abdullah bin Abu Maryam] dari [Dlamrah], [Al Fudlail bin Fadlalah], [Ibnu Abu 'Auf], [Rasyid] dan ['Athiyah], mereka berkata; Warisan orang-orang yang dibawa ke negeri Islam saat masih kecil tidak dapat diwarisi."
        },
        {
            "number": 2969,
            "arab": " حَدَّثَنَا سَعِيدُ بْنُ الْمُغِيرَةِ قَالَ قَالَ ابْنُ الْمُبَارَكِ حَدَّثَنَا ابْنُ عَوْنٍ عَنْ مُحَمَّدٍ قَالَ ذُكِرَ عِنْدَهُ قَوْلُ مَنْ يَقُولُ فِي الْحَمِيلِ فَأَنْكَرَ ذَلِكَ وَقَالَ قَدْ تَوَارَثَ الْمُهَاجِرُونَ وَالْأَنْصَارُ بِنَسَبِهِمْ الَّذِي كَانَ فِي الْجَاهِلِيَّةِ",
            "id": "Telah menceritakan kepada kami [Sa'id bin Al Mughirah] ia berkata; [Ibnu Al Mubarak] berkata; Telah menceritakan kepada kami [Ibnu 'Aun] dari [Muhammad] ia berkata; Disebutkan kepadanya ucapan orang yang berkata tentang orang yang dibawa ke negeri Islam saat masih kecil. Maka ia pun mengingkari hal itu dan berkata; Orang-orang Muhajirin dan Anshar saling mewarisi karena nasab keturunan mereka yang lahir pada masa jahiliyah."
        },
        {
            "number": 2970,
            "arab": " حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ عَنْ ابْنِ إِدْرِيسَ عَنْ هِشَامٍ عَنْ الْحَسَنِ وَابْنِ سِيرِينَ قَالَا لَا يُوَرَّثُ الْحَمِيلُ إِلَّا بِبَيِّنَةٍ",
            "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dari [Ibnu Idris] dari [Hisyam] dari [Al Hasan] dan [Ibnu Sirin] keduanya berkata; Warisan orang yang dibawa ke negeri Islam saat masih kecil tidak dapat diwarisi kecuali jika ada bukti."
        },
        {
            "number": 2971,
            "arab": " حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا جَرِيرٌ عَنْ لَيْثٍ عَنْ حَمَّادٍ عَنْ إِبْرَاهِيمَ قَالَ لَمْ يَكُنْ أَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ يُوَرِّثُونَ الْحَمِيلَ",
            "id": "Telah menceritakan kepada kami [Abu Bakr] telah menceritakan kepada kami [Jarir] dari [Laits] dari [Hammad] dari [Ibrahim] ia berkata; Abu Bakr, Umar dan Utsman tidak memberikan hak waris kepada orang yang dibawa ke negeri Islam saat masih kecil."
        },
        {
            "number": 2972,
            "arab": " حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا عَبْدُ الرَّحِيمِ الْمُحَارِبِيُّ عَنْ زَائِدَةَ عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ قَالَ أَقَرَّتْ امْرَأَةٌ مِنْ مُحَارِبٍ جَلِيبَةٌ بِنَسَبٍ لَهَا جَلِيبٍ فَوَرَّثَهُ عَبْدُ اللَّهِ بْنُ عُتْبَةَ مِنْ أُخْتِهِ",
            "id": "Telah menceritakan kepada kami [Abu Bakr] telah menceritakan kepada kami [Abdurrahim Al Muharibi] dari [Za`idah] dari [Asy'ats bin Abu Asy Sya'tsa`] ia berkata; Seorang perempuan dari Muharib yang dibawa paksa ke suatu negeri mengaku senasab dengan seseorang yang juga dibawa paksa ke negeri tersebut. Maka [Abdullah bin Utbah] memberikan hak waris kepada laki-laki tersebut dari warisan saudara perempuannya."
        },
        {
            "number": 2973,
            "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي اللَّيْثُ حَدَّثَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ رَجُلٍ قَالَ عِنْدَ فِرَاقِ الدُّنْيَا أَنَا مَوْلَى فُلَانٍ قَالَ يَرِثُ مِيرَاثَهُ لِمَنْ سَمَّى أَنَّهُ مَوْلَاهُ عِنْدَ فِرَاقِ الدُّنْيَا إِلَّا أَنْ يَأْتُوا عَلَيْهِ بِبَيِّنَةٍ بِغَيْرِ ذَلِكَ يَرُدُّونَ بِهِ قَوْلَهُ فَيُرَدُّ مِيرَاثُهُ إِلَى مَا قَامَتْ بِهِ الْبَيِّنَةُ",
            "id": "Telah menceritakan kepada kami [Abdullah bin Shalih] telah menceritakan kepadaku [Laits] telah menceritakan kepadaku [Yunus] dari [Ibnu Syihab] tentang seseorang yang berkata ketika hendak meninggal dunia; Aku mantan budak fulan. Ia berkata; Warisannya diwariskan kepada orang yang disebutkan bahwa ia adalah majikannya ketika hendak meninggal kecuali mereka menunjukkan bukti yang membantah hal itu. Maka warisan dikembalikan kepada yang terbukti benar."
        },
        {
            "number": 2974,
            "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا شَرِيكٌ عَنْ مُحَمَّدِ بْنِ سَالِمٍ عَنْ الشَّعْبِيِّ عَنْ عَلِيٍّ وَعَبْدِ اللَّهِ قَالَا وَلَدُ الزِّنَا بِمَنْزِلَةِ ابْنِ الْمُلَاعَنَةِ",
            "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Syarik] dari [Muhammad bin Salim] dari [Asy Sya'bi] dari [Ali] dan [Abdullah] keduanya berkata; Warisan anak zina menempati kedudukan anak wanita yang terkena li'an."
        },
        {
            "number": 2975,
            "arab": "أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا زُهَيْرٌ عَنْ الْحَسَنِ بْنِ الْحُرِّ حَدَّثَنِي الْحَكَمُ أَنَّ وَلَدَ الزِّنَا لَا يَرِثُهُ الَّذِي يَدَّعِيهِ وَلَا يَرِثُهُ الْمَوْلُودُ",
            "id": "Telah mengabarkan kepada kami Abu Nu'aim telah menceritakan kepada kami Zuhair dari Al Hasan bin Al Hurr telah menceritakan kepadaku Al Hakam bahwa anak zina tidak dapat diwarisi oleh orang yang mengakuinya sebagai anak dan tidak dapat diwarisi oleh anak yang dilahirkannya."
        },
        {
            "number": 2976,
            "arab": " حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا رَوْحٌ عَنْ مُحَمَّدِ بْنِ أَبِي حَفْصَةَ عَنْ الزُّهْرِيِّ عَنْ عَلِيِّ بْنِ حُسَيْنٍ أَنَّهُ كَانَ لَا يُوَرِّثُ وَلَدَ الزِّنَا وَإِنْ ادَّعَاهُ الرَّجُلُ",
            "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Rauh] dari [Muhammad bin Abu Hafshah] dari [Az Zuhri] dari [Ali bin Husain] bahwa ia tidak memberikan hak waris kepada anak zina sekalipun seseorang mengakuinya sebagai anak."
        },
        {
            "number": 2977,
            "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي بَكْرُ بْنُ مُضَرَ عَنْ عَمْرٍو يَعْنِي ابْنَ الْحَارِثِ عَنْ بُكَيْرٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ قَالَ أَيُّمَا رَجُلٍ أَتَى إِلَى غُلَامٍ يَزْعُمُ أَنَّهُ ابْنٌ لَهُ وَأَنَّهُ زَنَى بِأُمِّهِ وَلَمْ يَدَّعِ ذَلِكَ الْغُلَامَ أَحَدٌ فَهُوَ يَرِثُهُ قَالَ بُكَيْرٌ وَسَأَلْتُ عُرْوَةَ عَنْ ذَلِكَ فَقَالَ مِثْلَ قَوْلِ سُلَيْمَانَ بْنِ يَسَارٍ وَقَالَ عُرْوَةُ بَلَغَنَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْوَلَدُ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ",
            "id": "Telah menceritakan kepada kami [Abdullah bin Shalih] telah menceritakan kepadaku [Bakr bin Mudlar] dari [Amru] yakni Ibnu Al Harits, dari [Bukair] dari [Sulaiman bin Yasar] ia berkata; Siapa pun orangnya yang mendatangi seorang anak lalu mengaku bahwa ia adalah anaknya dan mengaku bahwa ia telah berzina dengan ibunya, sementara tidak ada seorang pun yang mengaku anak tersebut sebagai anaknya, maka anak tersebut dapat mewarisinya. Bukair berkata; Aku pernah bertanya kepada [Urwah] tentang hal itu. Maka ia menjawab seperti perkataan Sulaiman bin Yasar. Urwah juga berkata; Telah sampai berita kepada kami bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Anak adalah milik pemilik kasur (istri) dan (balasan) lelaki yang berzina adalah batu (dirajam).\""
        },
        {
            "number": 2978,
            "arab": " حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى عَنْ حَفْصِ بْنِ غِيَاثٍ عَنْ عَمْرٍو عَنْ الْحَسَنِ قَالَ ابْنُ الْمُلَاعَنَةِ مِثْلُ وَلَدِ الزِّنَا تَرِثُهُ أُمُّهُ وَوَرَثَتُهُ وَرَثَةُ أُمِّهِ",
            "id": "Telah menceritakan kepada kami [Ibrahim bin Musa] dari [Hafsh bin Ghiyats] dari [Amr] dari [Al Hasan] ia berkata; Anak seorang wanita yang terkena li'an sama dengan anak zina. Ibunya dapat mewarisinya dan ahli warisnya adalah ahli waris ibunya."
        },
        {
            "number": 2979,
            "arab": "حَدَّثَنَا أَبُو النُّعْمَانِ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ مُغِيرَةَ عَنْ إِبْرَاهِيمَ قَالَ لَا يُوَرَّثُ وَلَدُ الزِّنَا",
            "id": "Telah menceritakan kepada kami Abu An Nu'man telah menceritakan kepada kami Abu 'Awanah dari Mughirah dari Ibrahim ia berkata; Warisan anak zina tidak dapat diwarisi."
        },
        {
            "number": 2980,
            "arab": "حَدَّثَنَا سَعِيدُ بْنُ الْمُغِيرَةِ عَنْ ابْنِ الْمُبَارَكِ عَنْ مَعْمَرٍ أَوْ يُونُسَ عَنْ الزُّهْرِيِّ فِي أَوْلَادِ الزِّنَا قَالَ يَتَوَارَثُونَ مِنْ قِبَلِ الْأُمَّهَاتِ وَإِنْ وَلَدَتْ تَوْأَمًا فَمَاتَ وَرِثَ السُّدُسَ",
            "id": "Telah menceritakan kepada kami [Sa'id bin Al Mughirah] dari [Ibnu Al Mubarak] dari [Ma'mar] atau [Yunus] dari [Az Zuhri] tentang anak-anak zina, ia berkata; Ahli waris dari jalur keturunan ibu dapat saling mewarisi, jika anak zina memperoleh anak lalu ia meninggal dunia maka anaknya mendapat harta warisan seperenam."
        },
        {
            "number": 2981,
            "arab": " حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ حَدَّثَنَا هُشَيْمٌ عَنْ مُغِيرَةَ عَنْ شِبَاكٍ عَنْ إِبْرَاهِيمَ قَالَ لَا يَرِثُ وَلَدُ الزِّنَا لَا يَرِثُ مَنْ لَمْ يُقَمْ عَلَى أَبِيهِ الْحَدُّ أَوْ تُمْلَكُ أُمُّهُ بِنِكَاحٍ أَوْ شِرَاءٍ",
            "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] ia berkata; Telah menceritakan kepada kami [Husyaim] dari [Mughirah] dari [Syibak] dari [Ibrahim] ia berkata; Anak zina tidak dapat mewarisi, tidak dapat mewarisi orang yang ayahnya tidak dijatuhi hukuman atau memiliki ibunya dengan cara dinikahi atau dibeli."
        },
        {
            "number": 2982,
            "arab": "حَدَّثَنَا إِسْمَعِيلُ بْنُ أَبَانَ عَنْ مُوسَى بْنِ مُحَمَّدٍ الْأَنْصَارِيِّ عَنْ إِسْمَعِيلَ عَنْ الْحَسَنِ فِي الرَّجُلِ يَفْجُرُ بِالْمَرْأَةِ ثُمَّ يَتَزَوَّجُهَا قَالَ لَا بَأْسَ إِلَّا أَنْ تَكُونَ حُبْلَى فَإِنَّ الْوَلَدَ لَا يَلْحَقُهُ",
            "id": "Telah menceritakan kepada kami Isma'il bin Aban dari Musa bin Muhammad Al Anshari dari Isma'il dari Al Hasan tentang seseorang yang melakukan zina dengan seorang wanita kemudian menikahinya, ia berkata; Tidak mengapa kecuali jika wanita itu hamil. Sebab anak tidak bisa dihubungkan (nasabnya) dengan laki-laki tersebut."
        },
        {
            "number": 2983,
            "arab": " حَدَّثَنَا زَيْدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ رَاشِدٍ عَنْ سُلَيْمَانَ بْنِ مُوسَى عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى أَنَّ لِكُلِّ مُسْتَلْحَقٍ اسْتُلْحِقَ بَعْدَ أَبِيهِ الَّذِي ادَّعَاهُ وَرَثَتُهُ بَعْدَهُ فَقَضَى إِنْ كَانَ مِنْ أَمَةٍ يَمْلِكُهَا يَوْمَ يَطَؤُهَا فَقَدْ لَحِقَ بِمَنْ اسْتَلْحَقَهُ وَلَيْسَ لَهُ مِمَّا قُسِمَ قَبْلَهُ مِنْ الْمِيرَاثِ شَيْءٌ وَمَا أَدْرَكَ مِنْ مِيرَاثٍ لَمْ يُقْسَمْ فَلَهُ نَصِيبُهُ وَلَا يَلْحَقُ إِذَا كَانَ الَّذِي يُدْعَى لَهُ أَنْكَرَهُ وَإِنْ كَانَ مِنْ أَمَةٍ لَا يَمْلِكُهَا أَوْ حُرَّةٍ عَاهَرَهَا فَإِنَّهُ لَا يَلْحَقُ وَلَا يَرِثُ وَإِنْ كَانَ الَّذِي يُدْعَى لَهُ هُوَ ادَّعَاهُ وَهُوَ وَلَدُ زِنَا لِأَهْلِ أُمِّهِ مَنْ كَانُوا حُرَّةً أَوْ أَمَةً",
            "id": "Telah menceritakan kepada kami [Zaid bin Yahya] dari [Muhammad bin Rasyid] dari [Sulaiman bin Musa] dari [Amr bin Syu'aib] dari [ayahnya] dari [kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam pernah memutuskan: \"Bahwa setiap orang yang menasabkan pada dirinya, maka ia dinisbatkan kepada ayahnya yang diakuinya dan ahli warisnya adalah setelahnya.\" Lalu beliau memutuskan: \"Jika ia berasal dari budak wanita yang dimiliki pada hari ia menggaulinya, maka ia mengikuti nasab orang yang diakui sebagai ayahnya dan sedikit pun ia tidak mendapat bagian harta warisan yang telah dibagikan sebelumnya. Sedangkan harta warisan yang belum dibagi, maka ia mendapat bagian darinya. Namun jika orang yang diakui sebagai ayahnya mengingkarinya maka ia tidak berhak mengikuti nasab kepadanya. dan jika ia berasal dari seorang budak yang bukan miliknya atau wanita merdeka yang dizinai maka ia tidak mengikuti nasab dan mendapat warisan. Meskipun orang yang diakui sebagai ayah itu mengakuinya. Ia tetap berstatus anak zina yang mengikuti keluarga ibunya, baik wanita merdeka maupun budak.\""
        },
        {
            "number": 2984,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ عَنْ الْحَسَنِ عَنْ عُمَيْرِ بْنِ يَزِيدَ قَالَ سَأَلْتُ الشَّعْبِيَّ عَنْ مَمْلُوكٍ لِي وَلَدُ زِنًا قَالَ لَا تَبِعْهُ وَلَا تَأْكُلْ ثَمَنَهُ وَاسْتَخْدِمْهُ",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] dari [Al Hasan] dari [Umair bin Yazid] ia berkata; Aku pernah bertanya kepada [Asy Sya'bi] tentang budakku yang terlahir dari hasil perzinaan. Ia menjawab; Jangan engkau jual dirinya dan makan uang hasil penjualannya tetapi perbantukanlah ia."
        },
        {
            "number": 2985,
            "arab": " حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ عَنْ سَعِيدٍ عَنْ الزُّهْرِيِّ سُئِلَ عَنْ وَلَدِ زِنَا يَمُوتُ قَالَ إِنْ كَانَ ابْنَ عَرَبِيَّةٍ وَرِثَتْ أُمُّهُ الثُّلُثَ وَجُعِلَ بَقِيَّةُ مَالِهِ فِي بَيْتِ الْمَالِ وَإِنْ كَانَ ابْنَ مَوْلَاةٍ وَرِثَتْ أُمُّهُ الثُّلُثَ وَوَرِثَ مَوَالِيهَا الَّذِينَ أَعْتَقُوهَا مَا بَقِيَ قَالَ مَرْوَانُ سَمِعْتُ مَالِكًا يَقُولُ ذَلِكَ",
            "id": "Telah menceritakan kepada kami [Marwan bin Muhammad] dari [Sa'id] dari [Az Zuhri] ia ditanya tentang anak zina yang meninggal, ia menjawab; Jika ia adalah anak Arab maka ibunya mendapat sepertiga harta warisan, sedangkan sisanya diserahkan ke Baitul Mal. Jika ia adalah anak budak maka ibunya mendapat sepertiga harta warisan, sedangkan sisa harta tersebut diberikan kepada majikannya yang telah memerdekakan ibunya. Marwan berkata; Aku telah mendengar [Malik] berpendapat seperti itu."
        },
        {
            "number": 2986,
            "arab": "حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ حَدَّثَنَا الْهَيْثَمُ بْنُ حُمَيْدٍ عَنْ الْعَلَاءِ بْنِ الْحَارِثِ حَدَّثَنِي عَمْرُو بْنُ شُعَيْبٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى بِمِيرَاثِ ابْنِ الْمُلَاعَنَةِ لِأُمِّهِ كُلِّهِ لِمَا لَقِيَتْ فِيهِ مِنْ الْعَنَاءِ",
            "id": "Telah menceritakan kepada kami Marwan bin Muhammad telah menceritakan kepada kami Al Haitsam bin Humaid dari Al 'Ala` bin Al Harits telah menceritakan kepadaku Amr bin Syu'aib bahwa Nabi shallallahu 'alaihi wasallam memutuskan seluruh harta warisan anak seorang wanita yang terkena li'an adalah untuk ibunya karena penderitaan yang ia dapatkan."
        },
        {
            "number": 2987,
            "arab": " حَدَّثَنَا إِسْمَعِيلُ بْنُ أَبَانَ عَنْ مُوسَى بْنِ مُحَمَّدٍ الْأَنْصَارِيِّ قَالَ حَدَّثَنِي الْحَارِثُ بْنُ حَصِيرَةَ عَنْ زَيْدِ بْنِ وَهْبٍ عَنْ عَلِيٍّ أَنَّهُ قَالَ فِي وَلَدِ الزِّنَا لِأَوْلِيَاءِ أُمِّهِ خُذُوا ابْنَكُمْ تَرِثُونَهُ وَتَعْقِلُونَهُ وَلَا يَرِثُكُمْ",
            "id": "Telah menceritakan kepada kami [Isma'il bin Aban] dari [Musa bin Muhammad Al Anshari] ia berkata; Telah menceritakan kepadaku [Al Harits bin Hashirah] dari [Zaid bin Wahb] dari [Ali] bahwa ia pernah berkata tentang warisan anak zina kepada wali-wali ibunya; Ambillah anak kalian. Kalian memperoleh warisannya dan membayar diyatnya tetapi ia tidak memperoleh warisan dari kalian."
        },
        {
            "number": 2988,
            "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ وَعَبْدُ اللَّهِ بْنُ يَزِيدَ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ أَبِي عَمْرٍو الشَّيْبَانِيِّ قَالَ قَالَ عَبْدُ اللَّهِ السَّائِبَةُ يَضَعُ مَالَهُ حَيْثُ شَاءَ قَالَ عَبْدُ اللَّهِ بْنُ يَزِيدَ قَالَ شُعْبَةُ لَمْ يَسْمَعْ هَذَا مِنْ سَلَمَةَ أَحَدٌ غَيْرِي",
            "id": "Telah mengabarkan kepada kami [Abu Nu'aim] dan [Abdullah bin Zaid] keduanya berkata; Telah menceritakan kepada kami [Syu'bah] dari [Salamah bin Kuhail] dari [Abu Amr Asy Syaibani] ia berkata; [Abdullah] berkata; Budak Sa`ibah menyerahkan hartanya ke mana pun ia mau. Abdullah bin Yazid berkata; Syu'bah berkata; Belum ada satu orang pun yang mendengar hal ini dari Salamah selain diriku. "
        },
        {
            "number": 2989,
            "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ حَدَّثَنَا حَاتِمُ بْنُ وَرْدَانَ عَنْ يُونُسَ عَنْ الْحَسَنِ سُئِلَ عَنْ مِيرَاثِ السَّائِبَةِ فَقَالَ كُلُّ عَتِيقٍ سَائِبَةٌ",
            "id": "Telah mengabarkan kepada kami [Al Hakam bin Al Mubarak] telah menceritakan kepada kami [Hatim bin Wardan] dari [Yunus] dari [Al Hasan] ketika ia ditanya tentang warisan Sa`ibah, ia pun menjawab; Semua budak yang dimerdekakan adalah sa`ibah. "
        },
        {
            "number": 2990,
            "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا سُلَيْمَانُ عَنْ أَبِي عُثْمَانَ قَالَ قَالَ عُمَرُ الصَّدَقَةُ وَالسَّائِبَةُ لِيَوْمِهِمَا",
            "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Sulaiman] dari [Abu Utsman] ia berkata; [Umar] berkata; Sedekah dan sa`ibah diberikan pada harinya."
        },
        {
            "number": 2991,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا زَكَرِيَّا عَنْ عَامِرٍ قَالَ سُئِلَ عَامِرٌ عَنْ الْمَمْلُوكِ يُعْتَقُ سَائِبَةً لِمَنْ وَلَاؤُهُ قَالَ لِلَّذِي أَعْتَقَهُ",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Zakariya] dari [Amir] ia berkata; Ketika Amir ditanya tentang budak yang dimerdekakan dengan status Sa`ibah, kepada siapakah perwaliannya? Ia menjawab; Untuk orang yang memerdekakannya."
        },
        {
            "number": 2992,
            "arab": " حَدَّثَنَا أَبُو حَاتِمٍ الْبَصْرِيُّ هُوَ رَوْحُ بْنُ أَسْلَمَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِسْحَقَ عَنْ أَبِيهِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَمْرٍو قَالَ مَاتَ مَوْلًى عَلَى عَهْدِ عُثْمَانَ وَلَيْسَ لَهُ وَالٍ فَأَمَرَ بِمَالِهِ فَأُدْخِلَ بَيْتَ الْمَالِ",
            "id": "Telah menceritakan kepada kami [Abu Hatim Al Bashri] ia adalah Rauh bin Aslam, telah menceritakan kepada kami [Bisyr bin Al Mufadldlal] telah menceritakan kepada kami [Abdurrahman bin Ishaq] dari [ayahnya] dari [Abdurrahman bin Amr] ia berkata; Pada masa pemerintahan [Utsman] ada seorang budak yang tidak memiliki wali meninggal dunia, lalu ia memerintahkan untuk mengambil hartanya dan diserahkan ke Baitul Mal."
        },
        {
            "number": 2993,
            "arab": " حَدَّثَنَا يَعْلَى حَدَّثَنَا إِسْمَعِيلُ عَنْ عَامِرٍ عَنْ مَسْرُوقٍ فِي رَجُلٍ مَاتَ وَلَمْ يَكُنْ لَهُ مَوْلَى عَتَاقَةٍ قَالَ مَالُهُ حَيْثُ أَوْصَى بِهِ فَإِنْ لَمْ يَكُنْ أَوْصَى فَهُوَ فِي بَيْتِ الْمَالِ",
            "id": "Telah menceritakan kepada kami [Ya'la] telah menceritakan kepada kami [Isma'il] dari [Amir] dari [Masruq] tentang seseorang yang meninggal dunia namun tidak memiliki majikan yang memerdekakan, ia menjawab; Hartanya tergantung dengan wasiatnya, jika ia tidak berwasiat maka harta itu diserahkan ke Baitul Mal."
        },
        {
            "number": 2994,
            "arab": " حَدَّثَنَا أَبُو سَعِيدِ بْنُ عَمْرٍو عَنْ أَبِي بَكْرِ بْنِ أَبِي مَرْيَمَ عَنْ ضَمْرَةَ وَرَاشِدِ بْنِ سَعْدٍ وَغَيْرِهِمَا قَالُوا فِيمَنْ أُعْتِقَ سَائِبَةً إِنَّ وَلَاءَهُ لِمَنْ أَعْتَقَهُ إِنَّمَا سَيَّبَهُ مِنْ الرِّقِّ وَلَمْ يُسَيِّبْهُ مِنْ الْوَلَاءِ",
            "id": "Telah menceritakan kepada kami [Abu Sa'id bin Amr] dari [Abu Abu Bakr bin Abu Maryam] dari [Dlamrah], [Rasyid bin Sa'd] dan selain keduanya, mereka berkata tentang budak yang dimerdekakan dengan status sa`ibah; Sesungguhnya hak perwaliannya diberikan kepada orang yang memerdekakannya. Karena sesungguhnya ia hanya dibebaskan dari perbudakan namun tidak dibebaskan dari hak perwalian."
        },
        {
            "number": 2995,
            "arab": " حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو دَاوُدَ عَنْ شُعْبَةَ قَالَ أَخْبَرَنِي مَنْصُورٌ عَنْ إِبْرَاهِيمَ وَالشَّعْبِيِّ قَالَا لَا بَأْسَ بِبَيْعِ وَلَاءِ السَّائِبَةِ وَهِبَتِهِ",
            "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Abu Dawud] dari [Syu'bah] ia berkata; Telah mengabarkan kepadaku [Manshur] dari [Ibrahim] dan [Asy Sya'bi] keduanya berkata; Tidak apa-apa untuk menjual perwalian budak sa`ibah dan pemberiannya."
        },
        {
            "number": 2996,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا الْمَسْعُودِيُّ عَنْ الْقَاسِمِ قَالَ أَعْتَقَ رَجُلٌ غُلَامًا سَائِبَةً فَأَتَى عَبْدَ اللَّهِ وَقَالَ إِنِّي أَعْتَقْتُ غُلَامًا لِي سَائِبَةً وَهَذِهِ تَرِكَتُهُ قَالَ هِيَ لَكَ قَالَ لَا حَاجَةَ لِي فِيهَا قَالَ فَضَعْهَا فَإِنَّ هَا هُنَا وَارِثًا كَثِيرًا",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Al Mas'udi] dari [Al Qasim] ia berkata; Ada seseorang yang memerdekakan seorang anak dengan status Sa`ibah, lalu ia mendatangi [Abdullah] dan berkata; Sesungguhnya aku telah memerdekakan seorang anak milikku dengan status sa`ibah dan ini adalah harta yang ditinggalkannya. Ia berkata; Ia menjadi milikmu. Orang itu berkata lagi; Namun aku tidak membutuhkannya. Ia berkata; Kalau begitu biarkanlah ia, karena di sini masih banyak ahli warisnya."
        },
        {
            "number": 2997,
            "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا الْأَشْعَثُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ إِذَا اسْتَهَلَّ الصَّبِيُّ وُرِّثَ وَصُلِّيَ عَلَيْهِ",
            "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Al Asy'ats] dari [Abu Az Zubair] dari [Jabir bin Abdullah] ia berkata; Jika seorang terlahir dalam keadaan menangis, maka ia mendapat warisan dan dishalati."
        },
        {
            "number": 2998,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا شَرِيكٌ عَنْ أَبِي إِسْحَقَ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ قَالَ إِذَا اسْتَهَلَّ الصَّبِيُّ وَرِثَ وَوُرِثَ وَصُلِّيَ عَلَيْهِ",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Syarik] dari [Abu Ishaq] dari ['Atha`] dari [Ibnu Abbas] ia berkata; Jika seorang terlahir dalam keadaan menangis maka ia mewarisi, mewariskan dan dishalati."
        },
        {
            "number": 2999,
            "arab": " حَدَّثَنَا مَالِكُ بْنُ إِسْمَعِيلَ حَدَّثَنَا إِسْرَائِيلُ عَنْ سِمَاكٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ لَيْسَ مِنْ مَوْلُودٍ إِلَّا يَسْتَهِلُّ وَاسْتِهْلَالُهُ يَعْصِرُ الشَّيْطَانُ بَطْنَهُ فَيَصِيحُ إِلَّا عِيسَى ابْنَ مَرْيَمَ",
            "id": "Telah menceritakan kepada kami [Malik bin Isma'il] telah menceritakan kepada kami [Isra`il] dari [Simak] dari [Ikrimah] dari [Ibnu Abbas] ia berkata; Tidaklah seorang anak yang lahir kecuali dalam keadaan menangis, dan tangisannya itu karena setan menekan (mencubit) perutnya sehingga ia menangis dengan berteriak kecuali Isa bin Maryam."
        },
        {
            "number": 3000,
            "arab": " حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا يَحْيَى هُوَ ابْنُ حَمْزَةَ عَنْ زَيْدِ بْنِ وَاقِدٍ عَنْ مَكْحُولٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَرِثُ الْمَوْلُودُ حَتَّى يَسْتَهِلَّ صَارِخًا وَإِنْ وَقَعَ حَيًّا",
            "id": "Telah menceritakan kepada kami [Yahya bin Hassan] telah menceritakan kepada kami [Yahya] ia adalah Ibnu Hamzah, dari [Zaid bin Waqid] dari [Makhul] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang anak yang lahir tidak mendapat warisan hingga ia menangis dengan berteriak (menjerit) dan jika ia lahir dalam keadaan hidup.\""
        },
        {
            "number": 3001,
            "arab": " حَدَّثَنَا يَعْلَى حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ عَطَاءٍ عَنْ جَابِرٍ قَالَ إِذَا اسْتَهَلَّ الْمَوْلُودُ صُلِّيَ عَلَيْهِ وَوُرِثَ",
            "id": "Telah menceritakan kepada kami [Ya'la] telah menceritakan kepada kami [Muhammad bin Ishaq] dari ['Atha`] dari [Jabir] ia berkata; Jika seorang anak terlahir dalam keadaan menangis, maka ia berhak dishalati dan mendapat warisan."
        },
        {
            "number": 3002,
            "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ حَدَّثَنَا مَعْنٌ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ الزُّهْرِيِّ قَالَ أَرَى الْعُطَاسَ اسْتِهْلَالًا",
            "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad] telah menceritakan kepada kami [Ma'an] dari [Ibnu Abu Dzi`b] dari [Az Zuhri] ia berkata; Aku berpendapat bahwa bersin sebagai tanda anak terlahir dalam keadaan menangis."
        },
        {
            "number": 3003,
            "arab": " حَدَّثَنَا أَبُو النُّعْمَانِ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ مُغِيرَةَ عَنْ إِبْرَاهِيمَ قَالَ لَا يُوَرَّثُ الْمَوْلُودُ حَتَّى يَسْتَهِلَّ وَلَا يُصَلَّى عَلَيْهِ حَتَّى يَسْتَهِلَّ فَإِذَا اسْتَهَلَّ صُلِّيَ عَلَيْهِ وَوُرِّثَ وَكُمِّلَتْ الدِّيَةُ",
            "id": "Telah menceritakan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Abu 'Awanah] dari [Mughirah] dari [Ibrahim] ia berkata; Anak yang terlahir tidak mendapat warisan hingga ia terlahir dalam keadaan menangis, tidak dishalati hingga ia terlahir dalam keadaan menangis. Maka, jika ia terlahir dalam keadaan menangis, ia berhak dishalati, mendapat warisan, dan diyatnya diberikan secara sempurna."
        },
        {
            "number": 3004,
            "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي اللَّيْثُ حَدَّثَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ وَسَأَلْنَاهُ عَنْ السِّقْطِ فَقَالَ لَا يُصَلَّى عَلَيْهِ وَلَا يُصَلَّى عَلَى مَوْلُودٍ حَتَّى يَسْتَهِلَّ صَارِخًا",
            "id": "Telah menceritakan kepada kami [Abdullah bin Shalih] telah menceritakan kepadaku [Al Laits] telah menceritakan kepadaku [Yunus] dari [Ibnu Syihab] dan kami juga bertanya kepadanya tentang anak yang lahir prematur (keguguran), ia menjawab; Anak itu tidak dishalati, anak yang lahir tidak wajib dishalati hingga ia menangis dengan berteriak."
        },
        {
            "number": 3005,
            "arab": " حَدَّثَنَا هَارُونُ بْنُ مُعَاوِيَةَ عَنْ أَبِي سُفْيَانَ عَنْ مَعْمَرٍ عَنْ قَتَادَةَ قَالَ إِذَا ابْتَاعَ الْمُكَاتَبَانِ أَحَدُهُمَا الْآخَرَ هَذَا هَذَا مِنْ سَيِّدِهِ وَهَذَا هَذَا مِنْ سَيِّدِهِ فَالْبَيْعُ لِلْأَوَّلِ وَيَقُولُ أَهْلُ الْمَدِينَةِ الْوَلَاءُ لِسَيِّدِ الْبَائِعِ وَيَقُولُونَ إِنَّمَا ابْتَاعَ هَذَا مَا عَلَى الْمُكَاتَبِ فَالْوَلَاءُ لِلسَّيِّدِ",
            "id": "Telah menceritakan kepada kami [Harun bin Mu'awiyah] dari [Abu Sufyan] dari [Ma'mar] dari [Qatadah] ia berkata; Jika dua orang budak mukatab saling membeli satu sama lain, budak ini membeli budak itu dari tuannya dan budak itu membeli budak ini dari tuannya maka jual beli adalah yang pertama. Penduduk Madinah berkata; Wala` tetap untuk majikan yang menjual. Mereka berkata; Sesungguhnya budak ini membeli apa yang wajib dilunasi oleh mukatab. Oleh karena itu wala` tetap untuk majikan. "
        },
        {
            "number": 3006,
            "arab": " حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا يَحْيَى عَنْ سَعِيدٍ أَنَّ عُمَرَ قَالَ أَيُّمَا حُرٍّ تَزَوَّجَ أَمَةً فَقَدْ أَرَقَّ نِصْفَهُ وَأَيُّمَا عَبْدٍ تَزَوَّجَ حُرَّةً فَقَدْ أَعْتَقَ نِصْفَهُ قَالَ أَبُو مُحَمَّد يَعْنِي الْوَلَدَ",
            "id": "Telah menceritakan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Yahya] dari [Sa'id] bahwa [Umar] berkata; Laki-laki merdeka manapun yang menikahi budak perempuan maka ia telah memerdekakannya setengah. Dan budak manapun yang menikahi perempuan merdeka maka ia telah memerdekakannya setengah. Abu Muhammad berkata; Yakni pada status anaknya."
        },
        {
            "number": 3007,
            "arab": " حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَبُو شِهَابٍ عَنْ الشَّيْبَانِيِّ عَنْ الشَّعْبِيِّ فِي الْعَبْدِ يَتَزَوَّجُ الْمَرْأَةَ ثُمَّ يُطَلِّقُهَا وَلَهُ مِنْهَا وَلَدٌ قَالَ إِنْ كَانَتْ حُرَّةً فَالنَّفَقَةُ عَلَى أُمِّهِ وَإِنْ كَانَ عَبْدًا يَعْنِي الصَّبِيَّ فَعَلَى مُوَالِيهِ",
            "id": "Telah menceritakan kepada kami [Ahmad bin Abdullah] telah menceritakan kepada kami [Abu Syihab] dari [Asy Syaibani] dari [Asy Sya'bi] tentang seorang budak yang menikahi seorang perempuan kemudian menceraikannya sedangkan ia melahirkan anak untuknya. Ia berkata; Jika anak itu perempuan merdeka maka nafkah atas ibunya, dan jika anak itu seorang budak maksudnya budak kecil maka nafkah atas para majikannya."
        },
        {
            "number": 3008,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا هُشَيْمٌ حَدَّثَنَا زَكَرِيَّا عَنْ عَامِرٍ ح و حَدَّثَنَا جَرِيرٌ عَنْ مُغِيرَةَ عَنْ إِبْرَاهِيمَ أَنَّهُمَا قَالَا وَلَاؤُهُ لِمَنْ بَدَأَ بِالْعِتْقِ أَوَّلَ مَرَّةٍ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Husyaim] telah menceritakan kepada kami [Zakariya] dari [Amir], dalam riwayat hadits lain; Telah menceritakan kepada kami [Jarir] dari [Mughirah] dari [Ibrahim] bahwa mereka berdua berkata; Wala`nya jatuh pada orang yang pertama kali memerdekakan."
        },
        {
            "number": 3009,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا يُونُسُ عَنْ الْحَسَنِ ح و حَدَّثَنَا جَرِيرٌ عَنْ أَبَانَ بْنِ تَغْلِبَ عَنْ الْحَكَمِ عَنْ إِبْرَاهِيمَ أَنَّهُمَا قَالَا إِنْ ضَمِنَ كَانَ الْوَلَاءُ لَهُ وَإِنْ اسْتَسْعَى الْعَبْدُ كَانَ الْوَلَاءُ بَيْنَهُمْ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Yunus] dari [Al Hasan], dalam riwayat hadits lain; Telah menceritakan kepada kami [Jarir] dari [Aban bin Taghlib] dari [Al Hakam] dari [Ibrahim] bahwa mereka berdua berkata; Jika ia menjamin maka wala` untuknya, dan jika ia mempekerjakan budak itu maka wala` dibagi di antara mereka."
        },
        {
            "number": 3010,
            "arab": " حَدَّثَنَا يَعْلَى وَأَبُو نُعَيْمٍ قَالَا حَدَّثَنَا زَكَرِيَّا عَنْ عَامِرٍ فِي عَبْدٍ بَيْنَ رَجُلَيْنِ أَعْتَقَ أَحَدُهُمَا نَصِيبَهُ قَالَ يُتَمَّمُ عِتْقُهُ فَإِنْ لَمْ يَكُنْ لَهُ مَالٌ اسْتُسْعِيَ الْعَبْدُ فِي النِّصْفِ بِقِيمَةِ عَدْلٍ وَالْوَلَاءُ لِمَنْ أَعْتَقَ",
            "id": "Telah menceritakan kepada kami [Ya'la] dan [Abu Nu'aim] keduanya berkata; Telah menceritakan kepada kami [Zakariya] dari [Amir] tentang seorang budak yang dimiliki dua orang di mana salah satunya memerdekakan bagiannya, ia berkata; Ia harus menyempurnakan kemerdekaannya. Jika ia tidak memiliki harta maka budak itu harus berusaha untuk menyempurnakan setengahnya dengan nilai (harga) yang adil. Sedangkan wala` untuk orang yang memerdekakan."
        },
        {
            "number": 3011,
            "arab": " حَدَّثَنَا هَارُونُ بْنُ مُعَاوِيَةَ عَنْ أَبِي سُفْيَانَ الْمَعْمَرِيِّ عَنْ مَعْمَرٍ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ فِي عَبْدٍ بَيْنَ رَجُلَيْنِ أَعْتَقَ أَحَدَهُمَا نَصِيبَهُ وَأَمْسَكَهُ الْآخَرُ قَالَ مِيرَاثُهُ بَيْنَهُمَا",
            "id": "Telah menceritakan kepada kami [Harun bin Mu'awiyah] dari [Abu Sufyan Al Ma'mari] dari [Ma'mar] dari [Ibnu Thawus] dari [ayahnya] tentang seorang budak yang dimliki oleh dua orang, lalu salah satunya memerdekakan bagiannya dan yang lain tidak, ia berkata; Warisan budak itu dibagi untuk mereka berdua."
        },
        {
            "number": 3012,
            "arab": " حَدَّثَنَا هَارُونُ عَنْ أَبِي سُفْيَانَ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ قَالَ مِيرَاثُهُ لِلَّذِي أَمْسَكَهُ و قَالَ قَتَادَةُ هُوَ لِلْمُعْتِقِ كُلُّهُ وَثَمَنُهُ عَلَيْهِ وَيَقُولُهُ أَهْلُ الْكُوفَةِ",
            "id": "Telah menceritakan kepada kami [Harun] dari [Abu Sufyan] dari [Ma'mar] dari [Az Zuhri] ia berkata; Warisannya untuk orang yang tidak memerdekakan. [Qatadah] berkata; Seluruh warisan untuk orang yang memerdekakan dan biaya untuk memerdekakannya. Demikian pula yang dikatakan oleh penduduk Kufah."
        },
        {
            "number": 3013,
            "arab": " حَدَّثَنَا يَعْلَى بْنُ عُبَيْدٍ حَدَّثَنَا عَبْدُ الْمَلِكِ عَنْ عَطَاءٍ فِي الرَّجُلِ يَمُوتُ وَيَتْرُكُ مُكَاتَبًا وَلَهُ بَنُونَ وَبَنَاتٌ أَيَكُونُ لِلنِّسَاءِ مِنْ الْوَلَاءِ شَيْءٌ قَالَ تَرِثُ النِّسَاءُ مِمَّا عَلَى ظَهْرِهِ مِنْ مُكَاتَبَتِهِ وَيَكُونُ الْوَلَاءُ لِلرِّجَالِ دُونَ النِّسَاءِ إِلَّا مَا كَاتَبْنَ أَوْ أَعْتَقْنَ",
            "id": "Telah menceritakan kepada kami [Ya'la bin Ubaid] telah menceritakan kepada kami [Abdul Malik] dari ['Atha`] tentang seseorang yang meninggal dunia dan meninggalkan seorang budak mukatab, ia juga memiliki beberapa anak laki-laki dan perempuan, adakah kaum perempuan mendapat wala`, ia menjawab; Kaum perempuan hanya dapat mewarisi apa yang wajib dilunasi budak dari syarat pemerdekaannya. Sementara wala' hanya untuk kaum laki-laki tidak untuk kaum perempuan, kecuali mereka yang memberikan janji pemerdekaan bersyarat atau mereka yang memerdekakan."
        },
        {
            "number": 3014,
            "arab": "حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا شَرِيكٌ عَنْ لَيْثٍ عَنْ طَاوُسٍ قَالَ لَا تَرِثُ النِّسَاءُ مِنْ الْوَلَاءِ إِلَّا مَا أَعْتَقْنَ أَوْ أَعْتَقَ مَنْ أَعْتَقْنَ",
            "id": "Telah menceritakan kepada kami Abu Nu'aim telah menceritakan kepada kami Syarik dari Laits dari Thawus ia berkata; Kaum perempuan tidak mewarisi wala` kecuali mereka yang memberi janji pemerdekaan atau yang memerdekakan."
        },
        {
            "number": 3015,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا أَبُو سُفْيَانَ عَنْ مَعْمَرٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ قَالَ تُوُفِّيَ رَجُلٌ وَتَرَكَ مُكَاتَبًا ثُمَّ مَاتَ الْمُكَاتَبُ وَتَرَكَ مَالًا فَجَعَلَ ابْنُ الْمُسَيَّبِ وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ مَا بَقِيَ مِنْ مُكَاتَبَتِهِ بَيْنَ بَنِي مَوْلَاهُ الرِّجَالُ وَالنِّسَاءُ عَلَى مِيرَاثِهِمْ وَمَا فَضَلَ مِنْ الْمَالِ بَعْدَ كِتَابَتِهِ فَلِلرِّجَالِ مِنْهُمْ مِنْ بَنِي مَوْلَاهُ دُونَ النِّسَاءِ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Abu Sufyan] dari [Ma'mar] dari [Yahya bin Abu Katsir] ia berkata; Seorang laki-laki meninggal dunia dan meninggalkan seorang budak mukatab, kemudian budak mukatab itu meninggal dunia dan meninggalkan harta. Ibnu Al Musayyab dan Abu Salamah bin Abdurrahman memberikan apa yang tersisa dari syarat pemerdekaannya kepada anak-anak majikannya. Kaum laki-laki dan kaum perempuan berhak atas warisan tersebut, sedangkan apa yang tersisa dari harta setelah pelunasannya, diberikan kepada kaum laki-laki dari anak-anak majikannya dan tidak untuk kaum perempuan dari anak-anak majikannya."
        },
        {
            "number": 3016,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ حَرْبٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عُمَرَ وَعَلِيٍّ وَزَيْدٍ أَنَّهُمْ قَالُوا الْوَلَاءُ لِلْكُبْرِ وَلَا يَرِثُونَ النِّسَاءَ مِنْ الْوَلَاءِ إِلَّا مَا أَعْتَقْنَ أَوْ كَاتَبْنَ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Abdus Salam bin Harb] dari [Al A'masy] dari [Ibrahim] dari [Umar], [Ali] dan [Zaid] bahwa mereka berkata; Wala` untuk yang lebih tua. Mereka tidak mewariskan wala` kepada kaum perempuan kecuali jika mereka memerdekakan atau memberi janji pemerdekaan."
        },
        {
            "number": 3017,
            "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ خَالِدٍ عَنْ أَبِي قِلَابَةَ ح و حَدَّثَنَا ابْنُ وَهْبٍ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ ح و حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ عَنْ أَبِيهِ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ أَنَّهُمْ قَالُوا لَا تَرِثُ النِّسَاءُ مِنْ الْوَلَاءِ إِلَّا مَا أَعْتَقْنَ أَوْ كَاتَبْنَ",
            "id": "Telah menceritakan kepada kami Muhammad bin Isa telah menceritakan kepada kami Isma'il bin Ibrahim dari Khalid dari Abu Qilabah, dan telah diriwayatkan dari jalur lain; Telah menceritakan kepada kami Ibnu Wahb dari Yunus dari Az Zuhri dari Sa'id bin Al Musayyab, dan telah diriwayatkan dari jalur lain; Telah menceritakan kepada kami Ibnu Abu Az Zinad dari ayahnya dari Sulaiman bin Yasar bahwa mereka berkata; Kaum perempuan tidak dapat mewarisi wala` kecuali jika mereka yang memerdekakan atau yang memberi janji pemerdekaan."
        },
        {
            "number": 3018,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا مُعَاذٌ عَنْ أَشْعَثَ عَنْ الْحَسَنِ قَالَ لَا تَرِثُ النِّسَاءُ مِنْ الْوَلَاءِ إِلَّا مَا أَعْتَقْنَ أَوْ أَعْتَقَ مَنْ أَعْتَقْنَ إِلَّا الْمُلَاعَنَةُ فَإِنَّهَا تَرِثُ مَنْ أَعْتَقَ ابْنُهَا وَالَّذِي انْتَفَى مِنْهُ أَبُوهُ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Mu'adz] dari [Asy'ats] dari [Al Hasan] ia berkata; Kaum perempuan tidak dapat mewarisi wala` kecuali jika mereka yang memerdekakan atau ia memerdekakan siapa yang mereka merdekakan kecuali anak seorang wanita yang terkena li'an, maka perempuan itu dapat mewarisi orang yang memerdekakan anaknya dan orang yang tidak diakui oleh ayahnya."
        },
        {
            "number": 3019,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا ابْنُ وَهْبٍ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ أَنَّهُ كَانَ يَرِثُ مَوَالِيَ عُمَرَ دُونَ بَنَاتِ عُمَرَ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Ibnu Wahb] dari [Yunus] dari [Az Zuhri] dari [Salim] dari [ayahnya] bahwa ia pernah memberikan warisan kepada para mantan budak Umar dan tidak diberikan kepada anak-anak perempuan Umar."
        },
        {
            "number": 3020,
            "arab": " أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ عَنْ خَالِدِ بْنِ عَبْدِ اللَّهِ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي قِلَابَةَ فِي امْرَأَةٍ مَاتَتْ وَتَرَكَتْ بَنِيهَا فَوَرِثُوهَا مَالًا وَمَوَالِيَ ثُمَّ مَاتَ بَنُوهَا قَالَ يَرْجِعُ الْوَلَاءُ إِلَى عَصَبَةِ الْمَرْأَةِ",
            "id": "Telah mengabarkan kepada kami [Amr bin 'Aun] dari [Khalid bin Abdullah] dari [Khalid Al Hadza`] dari [Abu Qilabah] tentang seorang perempuan yang meninggal dunia dan meninggalkan beberapa anak laki-laki, maka mereka mewarisi hartanya dan para budak ibunya, kemudian anak-anaknya meninggal dunia. Ia berkata; Wala` kembali kepada ashabah perempuan tersebut."
        },
        {
            "number": 3021,
            "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ إِسْرَائِيلَ عَنْ مَنْصُورٍ قَالَ سَأَلْتُ إِبْرَاهِيمَ عَنْ رَجُلٍ كَاتَبَ عَبْدًا لَهُ ثُمَّ مَاتَ وَتَرَكَ وَلَدًا رِجَالًا وَنِسَاءً قَالَ لِلذُّكُورِ دُونَ الْإِنَاثِ",
            "id": "Telah menceritakan kepada kami Ubaidullah dari Isra`il dari Manshur ia berkata; Aku pernah bertanya kepada Ibrahim tentang seorang laki-laki yang memberi janji pemerdekaan bersyarat kepada seorang budak miliknya, kemudian ia meninggal dunia dan meninggalkan beberapa anak laki-laki dan perempuan. Ia menjawab; Wala` hanya untuk kaum laki-laki dan tidak untuk kaum perempuan."
        },
        {
            "number": 3022,
            "arab": " حَدَّثَنَا أَبُو النُّعْمَانِ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا يُونُسُ عَنْ الْحَسَنِ أَنَّهُ كَانَ يَقُولُ فِي امْرَأَةٍ مَاتَتْ وَتَرَكَتْ مَوْلًى قَالَ الْوَلَاءُ لِبَنِيهَا فَإِذَا مَاتُوا رَجَعَ إِلَى عَصَبَتِهَا",
            "id": "Telah menceritakan kepada kami [Abu An Nu'man] telah menceritaan kepada kami [Wuhaib] telah menceritakan kepada kami [Yunus] dari [Al Hasan] bahwa ia pernah berkata tentang seorang perempuan yang meninggal dunia dan meninggalkan mantan budaknya, ia berkata; Wala` untuk anak laki-lakinya, namun jika mereka meninggal dunia maka wala` kembali kepada ashabah perempuan tersebut."
        },
        {
            "number": 3023,
            "arab": " حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ أَخْبَرَنَا شُعْبَةُ عَنْ مُغِيرَةَ عَنْ إِبْرَاهِيمَ قَالَ لَيْسَ لِلنِّسَاءِ مِنْ الْوَلَاءِ شَيْءٌ إِلَّا مَا أَعْتَقَتْ هِيَ بِنَفْسِهَا",
            "id": "Telah menceritakan kepada kami [Sa'id bin Amir] telah mengabarkan kepada kami [Syu'bah] dari [Mughirah] dari [Ibrahim] ia berkata; Kaum perempuan tidak mendapatkan hak wala` sedikit pun kecuali yang dimerdekakannya sendiri."
        },
        {
            "number": 3024,
            "arab": "حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ ابْنِ عَوْنٍ عَنْ مُحَمَّدٍ قَالَ مَاتَ مَوْلًى لِعُمَرَ فَسَأَلَ ابْنُ عُمَرَ زَيْدَ بْنَ ثَابِتٍ فَقَالَ هَلْ لِبَنَاتِ عُمَرَ مِنْ مِيرَاثِهِ شَيْءٌ قَالَ مَا أَرَى لَهُنَّ شَيْئًا وَإِنْ شِئْتَ أَنْ تُعْطِيَهُنَّ أَعْطَيْتَهُنَّ",
            "id": "Telah menceritakan kepada kami Sa'id bin Amir dari Ibnu 'Aun dari Muhammad ia berkata; Seorang mantan budak Umar meninggal dunia. Maka Ibnu Umar bertanya kepada Zaid bin Tsabit seraya berkata; Apakah anak perempuan Umar memiliki hak dari warisannya? Ia menjawab; Aku tidak melihat mereka memilikinya (hak warisan). Jika engkau ingin memberikan kepada mereka, silahkan engkau memberikannya."
        },
        {
            "number": 3025,
            "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامٍ عَنْ أَبِيهِ قَالَ يُحْرِزُ الْوَلَاءَ مَنْ يُحْرِزُ الْمِيرَاثَ",
            "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami [Abu Usamah] dari [Hisyam] dari [ayahnya] ia berkata; Wala` berhak dimiliki orang yang mendapat hak waris."
        },
        {
            "number": 3026,
            "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو خَالِدٍ حَدَّثَنَا يَحْيَى عَنْ أَبِي بَكْرِ بْنِ عَمْرِو بْنِ حَزْمٍ أَنَّ امْرَأَةً مِنْ مُحَارِبٍ وَهَبَتْ وَلَاءَ عَبْدِهَا لِنَفْسِهِ فَأَعْتَقَتْهُ فَوَهَبَ وَلَاءَ نَفْسِهِ لِعَبْدِ الرَّحْمَنِ بْنِ عَمْرِو بْنِ حَزْمٍ وَمَاتَتْ فَخَاصَمَتْ الْمَوَالِي إِلَى عُثْمَانَ فَدَعَا عُثْمَانُ الْبَيِّنَةَ عَلَى مَا قَالَ قَالَ فَأَتَى الْبَيِّنَةُ فَقَالَ لَهُ عُثْمَانُ اذْهَبْ فَوَالِ مَنْ شِئْتَ قَالَ أَبُو بَكْرٍ فَوَالَى عَبْدَ الرَّحْمَنِ بْنَ عَمْرِو بْنِ حَزْمٍ",
            "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami [Abu Khalid] telah menceritakan kepada kami [Yahya] dari [Abu Bakr bin Amr bin Hazm] bahwa seorang perempuan dari Muharib memberikan wala` budaknya kepada diri budak tersebut. Lalu perempuan itu memerdekakannya dan budak itu pun memberikan wala` dirinya kepada Abdurrahman bin Amr bin Hazm, sementara perempuan itu meninggal dunia. Para budak lain mengadukan masalah ini kepada Utsman. Maka Utsman meminta bukti atas apa yang ia katakan. (Abu Bakr) berkata; Lalu budak itu menghadirkan bukti. Maka [Utsman] berkata kepadanya; Pergilah dan berikan wala`mu kepada orang yang kamu kehendaki. Abu Bakr berkata; Maka ia menjadikan Abdurrahman bin Amr bin Hazm sebagai wala`nya."
        },
        {
            "number": 3027,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الْوَلَاءِ وَعَنْ هِبَتِهِ",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Abdullah bin Dinar] dari [Ibnu Umar] ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang menjual wala` dan menghibahkannya."
        },
        {
            "number": 3028,
            "arab": " حَدَّثَنَا مُسْلِمٌ حَدَّثَنَا شُعْبَةُ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الْوَلَاءِ وَعَنْ هِبَتِهِ",
            "id": "Telah menceritakan kepada kami [Muslim] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami [Abdullah bin Dinar] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam melarang menjual wala` dan menghibahkannya."
        },
        {
            "number": 3029,
            "arab": " حَدَّثَنَا يَعْلَى حَدَّثَنَا عَبْدُ الْمَلِكِ عَنْ عَطَاءٍ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ لَا يُبَاعُ الْوَلَاءُ وَلَا يُوهَبُ وَالْوَلَاءُ لِمَنْ أَعْتَقَ",
            "id": "Telah menceritakan kepada kami [Ya'la] telah menceritakan kepada kami [Abdul Malik] dari ['Atha`] ia berkata; Aku mendengar [Ibnu Abbas] berkata; Wala` tidak boleh dijual dan tidak boleh juga dihibahkan, tetapi wala` itu diberikan kepada orang yang memerdekakan."
        },
        {
            "number": 3030,
            "arab": " حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ عَنْ سَعِيدٍ عَنْ أَبِي مَعْشَرٍ عَنْ إِبْرَاهِيمَ قَالَ قَالَ عَبْدُ اللَّهِ الْوَلَاءُ لُحْمَةٌ كَلُحْمَةِ النَّسَبِ لَا يُبَاعُ وَلَا يُوهَبُ",
            "id": "Telah menceritakan kepada kami [Ja'far bin 'Aun] dari [Sa'id] dari [Abu Ma'syar] dari [Ibrahim] ia berkata; [Abdullah] berkata; Wala` seperti satu keturunan, tidak boleh dijual atau dihibahkan."
        },
        {
            "number": 3031,
            "arab": " حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ الْحَسَنِ وَسَعِيدِ بْنِ الْمُسَيَّبِ أَنَّهُمَا كَرِهَا بَيْعَ الْوَلَاءِ",
            "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami [Qatadah] dari [Al Hasan] dan [Sa'ib bin Al Musayyab] bahwa keduanya memakruhkan menjual wala`."
        },
        {
            "number": 3032,
            "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ قَالَ قَالَ ابْنُ عَبَّاسٍ لَا يُبَاعُ الْوَلَاءُ أَيُؤْكَلُ بِرَقَبَةِ رَجُلٍ مَرَّتَيْنِ",
            "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami [Ibnu Idris] dari [Ibnu Juraij] dari ['Atha`] ia berkata; [Ibnu Abbas] berkata; Wala` tidak boleh dijual. Apakah layak seseorang diberi makan budak dua kali? "
        },
        {
            "number": 3033,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ قَالَ الْفَرَائِضُ مِنْ سِتَّةٍ لَا نُعِيلُهَا",
            "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Ibnu Juraij] dari ['Atha`] dari [Ibnu Abbas] ia berkata; Pembagian harta waris dari enam tidak kami jadikan sebagai 'aul. "
        },
        {
            "number": 3034,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِمْرَانَ عَنْ مُعَاوِيَةَ بْنِ مَيْسَرَةَ بْنِ شُرَيْحٍ عَنْ أَيُّوبَ بْنِ الْحَارِثِ قَالَ اخْتُصِمَ إِلَى شُرَيْحٍ فِي بِنْتَيْنِ وَأَبَوَيْنِ وَزَوْجٍ فَقَضَى فِيهَا فَأَقْبَلَ الزَّوْجُ يَشْكُوهُ فِي الْمَسْجِدِ فَأَرْسَلَ إِلَيْهِ عَبْدَ اللَّهِ بْنَ رَبَاحٍ فَأَخَذَهُ وَبَعَثَ إِلَى شُرَيْحٍ فَقَالَ مَا يَقُولُ هَذَا قَالَ هَذَا يَخَالُنِي امْرَأً جَائِرًا وَأَنَا إِخَالُهُ امْرَأً فَاجِرًا يُظْهِرُ الشَّكْوَى وَيَكْتُمُ قَضَاءً سَائِرًا فَقَالَ لَهُ الرَّجُلُ مَا تَقُولُ فِي بِنْتَيْنِ وَأَبَوَيْنِ وَزَوْجٍ فَقَالَ لِلزَّوْجِ الرُّبُعُ مِنْ جَمِيعِ الْمَالِ وَلِلْأَبَوَيْنِ السُّدُسَانِ وَمَا بَقِيَ فَلِلِابْنَتَيْنِ قَالَ فَلِأَيِّ شَيْءٍ نَقَصْتَنِي قَالَ لَيْسَ أَنَا نَقَصْتُكَ اللَّهُ نَقَصَكَ لِلِابْنَتَيْنِ الثُّلُثَانِ وَلِلْأَبَوَيْنِ السُّدُسَانِ وَلِلزَّوْجِ الرُّبُعُ فَهِيَ مِنْ سَبْعَةٍ وَنِصْفٍ فَرِيضَةً فَرِيضَتُكَ عَائِلَةٌ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Imran] dari [Mu'awiyah bin Maisarah bin Syuraih] dari [Ayyub bin Al Harits] ia berkata; Syuraih pernah mendapat pengaduan tentang dua anak perempuan, dua orang tua dan suami. Maka ia memutuskan dalam masalah ini. Lalu sang suami datang dan mengadukannya di dalam masjid. Maka ia mengutus Abdullah bin Rabah, ia pun segera menjemput dan mengantarkan kepada Syuraih. (Syuraih) pun bertanya; Apa yang dikatakan orang ini? ' Syuraih berkata, 'Dia menyangka aku adalah orang yang zhalim, sedangkan aku menyangkanya seorang yang jahat. Dia mengumbar ketidakpuasan dan menyembunyikan keputusan yang berlaku.' Lalu laki-laki itu (suami) berkata kepada Syuraih, 'Apa yang kamu katakan tentang dua anak perempuan.' Laki-laki itu berkata, 'Kenapa kamu mengurangi bagianmu. Allah yang mengurangi bagianmu. Untuk dua anak perempuan dua pertiga, untuk kedua orang tua dua perenam dan untuk suami seperempat. Masalah ini dari tujuh setengah sebagai bagian wajib dan bagiannya dikalikan sebagai Aul.\""
        },
        {
            "number": 3035,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ عَنْ عَلِيِّ بْنِ مُسْهِرٍ عَنْ أَشْعَثَ عَنْ الشَّعْبِيِّ عَنْ عَلِيٍّ وَعُمَرَ وَزَيْدٍ قَالُوا الْوَالِدُ يَجُرُّ وَلَاءَ وَلَدِهِ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Uyainah] dari [Ali bin Mushir] dari [Asy'ats] dari [Asy Sya'bi] dari [Ali], [Umar] dan [Zaid], mereka berkata, Bapak berhak mengambil wala` anaknya."
        },
        {
            "number": 3036,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ عَنْ عَلِيِّ بْنِ مُسْهِرٍ عَنْ أَشْعَثَ عَنْ الشَّعْبِيِّ قَالَ الْجَدُّ يَجُرُّ الْوَلَاءَ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Uyainah] dari [Ali bin Mushir] dari [Asy'ats] dari [Asy Sya'bi] ia berkata; Kakek berhak mengambil wala`."
        },
        {
            "number": 3037,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ عَنْ عَلِيِّ بْنِ مُسْهِرٍ عَنْ أَشْعَثَ عَنْ ابْنِ سِيرِينَ عَنْ شُرَيْحٍ قَالَ الْوَالِدُ يَجُرُّ وَلَاءَ وَلَدِهِ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Uyainah] dari [Ali bin Mushir] dari [Asy'ats] dari [Ibnu Sirin] dari [Syuraih] ia berkata; Bapak berhak mengambil wala` anaknya."
        },
        {
            "number": 3038,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا زَكَرِيَّا عَنْ عَامِرٍ فِي مَمْلُوكٍ تُوُفِّيَ وَلَهُ أَبٌ حُرٌّ وَلَهُ بَنُونَ مِنْ امْرَأَةٍ حُرَّةٍ لِمَنْ وَلَاءُ وَلَدِهِ قَالَ لِمَوَالِي الْجَدِّ",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Zakariya] dari [Amir] tentang seorang budak yang meninggal dunia dan meninggalkan ayah yang merdeka dan beberapa anak laki-laki dari isteri yang merdeka, Untuk siapakah wala` anaknya? Ia menjawab; Untuk para mantan budak kakek."
        },
        {
            "number": 3039,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا إِسْرَائِيلُ عَنْ مُغِيرَةَ عَنْ إِبْرَاهِيمَ فِي مُكَاتَبٍ مَاتَ وَقَدْ أَدَّى نِصْفَ مُكَاتَبَتِهِ وَلَهُ وَلَدٌ مِنْ امْرَأَةٍ أَحْرَارٌ قَالَ مَا أُرَاهُ إِلَّا قَدْ جَرَّ وَلَاءَ وَلَدِهِ",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Isra`il] dari [Mughirah] dari [Ibrahim] tentang budak mukatab yang meninggal dunia dan meninggalkan seorang anak dari isteri yang merdeka, ia berkata; Tidaklah aku berpendapat kecuali ia berhak mengambil wala` anaknya."
        },
        {
            "number": 3040,
            "arab": " حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ إِبْرَاهِيمَ قَالَ كَانَ شُرَيْحٌ لَا يَرْجِعُ عَنْ قَضَاءٍ يَقْضِي بِهِ فَحَدَّثَهُ الْأَسْوَدُ أَنَّ عُمَرَ قَالَ إِذَا تَزَوَّجَ الْمَمْلُوكُ الْحُرَّةَ فَوَلَدَتْ أَوْلَادًا أَحْرَارًا ثُمَّ عُتِقَ بَعْدَ ذَلِكَ رَجَعَ الْوَلَاءُ لِمَوَالِي أَبِيهِمْ فَأَخَذَ بِهِ شُرَيْحٌ",
            "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Syu'bah] dari [Al Hakam] dari [Ibrahim] ia berkata; [Syuraih] tidak pernah menarik keputusannya yang telah dia putuskan. Lalu [Al Aswad] menceritakan kepadanya bahwa Umar pernah berkata; Jika seorang budak menikah dengan seorang perempuan yang merdeka lalu melahirkan anak-anak dalam keadaan merdeka kemudian setelah itu ia dimerdekakan, maka wala` kembali kepada orang yang memerdekakan ayah mereka. Lalu Syuraih pun memegang riwayat ini."
        },
        {
            "number": 3041,
            "arab": " حَدَّثَنَا يَعْلَى عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ قَالَ قَالَ عُمَرُ فِي الْمَمْلُوكِ يَكُونُ تَحْتَهُ الْحُرَّةُ يُعْتَقُ الْوَلَدُ بِعِتْقِ أُمِّهِ فَإِذَا عُتِقَ الْأَبُ جَرَّ الْوَلَاءَ",
            "id": "Telah menceritakan kepada kami [Ya'la] dari [Al A'masy] dari [Ibrahim] ia berkata; [Umar] berkata tentang seorang budak yang memiliki isteri yang merdeka; Anaknya dimerdekakan karena status ibunya yang merdeka. Jika ayah dimerdekakan, maka wala` berhak diambil oleh orang yang memerdekakannya."
        },
        {
            "number": 3042,
            "arab": " حَدَّثَنَا مُسْلِمٌ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ كَثِيرِ بْنِ شِنْظِيرٍ عَنْ عَطَاءٍ فِي الْحُرَّةِ تَحْتَ الْعَبْدِ قَالَ أَمَّا مَا وَلَدَتْ مِنْهُ وَهُوَ عَبْدٌ فَوَلَاؤُهُمْ لِأَهْلِ نِعْمَتِهَا وَمَا وَلَدَتْ مِنْهُ وَهُوَ حُرٌّ فَوَلَاؤُهُمْ لِأَهْلِ نِعْمَتِهِ",
            "id": "Telah menceritakan kepada kami [Muslim] telah menceritakan kepada kami [Abdul Warits] dari [Katsir bin Syinzhir] dari ['Atha`] tentang seorang perempuan merdeka yang menjadi isteri seorang budak, ia berkata; Jika yang dilahirkan adalah seorang budak maka wala` mereka jatuh kepada para wali dari ibunya, sedangkan jika yang dilahirkan adalah anak yang merdeka maka wala` mereka jatuh kepada orang-orang yang memerdekakan ayahnya."
        },
        {
            "number": 3043,
            "arab": " حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ قَالَ قَالَ عُمَرُ إِذَا كَانَتْ الْحُرَّةُ تَحْتَ الْمَمْلُوكِ فَوَلَدَتْ لَهُ غُلَامًا فَإِنَّهُ يُعْتَقُ بِعِتْقِ أُمِّهِ وَوَلَاؤُهُ لِمَوَالِي أُمِّهِ فَإِذَا أُعْتِقَ الْأَبُ جَرَّ الْوَلَاءَ إِلَى مَوَالِي أَبِيهِ",
            "id": "Telah menceritakan kepada kami [Ja'far bin 'Aun] dari [Al A'masy] dari [Ibrahim] ia berkata; [Umar] berkata; Jika seorang perempuan merdeka menjadi isteri seorang budak, lalu melahirkan seorang anak maka anaknya dimerdekakan karena status ibunya yang merdeka dan wala'nya jatuh kepada para wali dari ibunya dan jika sang ayah telah dimerdekakan maka wala`nya jatuh kepada para wali dari ayahnya."
        },
        {
            "number": 3044,
            "arab": " حَدَّثَنَا الْحَكَمُ بْنُ الْمُبَارَكِ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ ابْنِ إِسْحَقَ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ قَالَ كَانَتْ أُمِّي مَوْلَاةً لِلْحُرَقَةِ وَكَانَ أَبِي يَعْقُوبُ مُكَاتَبًا لِمَالِكِ بْنِ أَوْسِ بْنِ الْحَدَثَانِ النَّصْرِيِّ ثُمَّ إِنَّ أَبِي أَدَّى كِتَابَتَهُ فَدَخَلَ الْحُرَقِيُّ عَلَى عُثْمَانَ يَسْأَلُ الْحَقَّ يَعْنِي الْعَطَاءَ وَعِنْدَهُ مَالِكُ بْنُ أَوْسٍ فَقَالَ ذَاكَ مَوْلَايَ فَاخْتَصَمَا إِلَى عُثْمَانَ فَقَضَى بِهِ لِلْحُرَقِيِّ",
            "id": "Telah menceritakan kepada kami [Al Hakam bin Al Mubarak] telah menceritakan kepada kami [Muhammad bin Salamah] dari [Ibnu Ishaq] dari [Al 'Ala` bin Abdurrahman] dari [ayahnya] ia berkata; Ibuku adalah mantan budak milik Huraqah sedangkan ayahku, Ya'qub adalah seorang budak mukatab milik Malik bin Aus bin Al Hadatsan An Nashri, kemudian ayahku telah melunasi mukatabahnya. Maka Al Huraqi menemui Utsman untuk memintakan hak, yakni pemberian, saat itu Malik bin Aus ada di sampingnya, ia berkata; Ia adalah mantan budakku. Lalu keduanya mengadukan hal itu kepada Utsman, lalu [Utsman] pun memutuskan wala`ku untuk Al Huraqi."
        },
        {
            "number": 3045,
            "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ حَدَّثَنَا حَيْوَةُ أَخْبَرَنِي سَهْمُ بْنُ يَزِيدَ الْحَمْرَاوِيُّ أَنَّ رَجُلًا تُوُفِّيَ وَلَيْسَ لَهُ وَارِثٌ فَكُتِبَ فِيهِ إِلَى عُمَرَ بْنِ عَبْدِ الْعَزِيزِ وَهُوَ خَلِيفَةٌ فَكَتَبَ أَنْ اقْتَسِمُوا مِيرَاثَهُ عَلَى مَنْ كَانَ يَأْخُذُ مَعَهُمْ الْعَطَاءَ فَقُسِمَ مِيرَاثُهُ عَلَى مَنْ كَانَ يَأْخُذُ مَعَهُمْ الْعَطَاءَ فِي عِرَافَتِهِ",
            "id": "Telah menceritakan kepada kami [Abdullah bin Yazid] telah menceritakan kepada kami [Haiwah] telah mengabarkan kepadaku [Sahm bin Yazid Al Hamrawi] bahwa seseorang telah meninggal dunia namun ia tidak memiliki seorang ahli waris pun. Maka dikirimkan surat kepada [Umar bin Abdul Aziz], saat itu ia menjabat sebagai khalifah, lalu ia membalas surat itu; Hendaklah kalian membagikan warisannya kepada orang yang berhak mengambil pemberian bersama mereka. Maka warisan itu pun dibagikan kepada orang-orang yang berhak mengambil pemberian bersama mereka dalam pekerjaannya."
        }
    ]
}