{
    "kategori": "Kitab Hukuman",
    "hadits": [
        {
            "number": 2194,
            "arab": " أَخْبَرَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ حَدَّثَنَا حَمَّادٌ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رُفِعَ الْقَلَمُ عَنْ ثَلَاثَةٍ عَنْ النَّائِمِ حَتَّى يَسْتَيْقِظَ وَعَنْ الصَّغِيرِ حَتَّى يَحْتَلِمَ وَعَنْ الْمَجْنُونِ حَتَّى يَعْقِلَ وَقَدْ قَالَ حَمَّادٌ أَيْضًا وَعَنْ الْمَعْتُوهِ حَتَّى يَعْقِلَ",
            "id": "Telah mengabarkan kepada kami ['Affan] telah menceritakan kepada kami [Hammad bin Salamah] telah menceritakan kepada kami [Hammad] dari [Ibrahim] dari [Al Aswad] dari ['Aisyah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Pena diangkat dari tiga orang, yaitu; orang yang tidur hingga terbangun, orang yang masih kecil hingga ia dapat bermimpi (baligh), dan dari orang yang gila hingga berakal.\" Hammad berkata; \"Juga dari orang yang kurang akal hingga ia berakal.\""
        },
        {
            "number": 2195,
            "arab": " أَخْبَرَنَا أَبُو النُّعْمَانِ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ عَنْ عُثْمَانَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ إِلَّا بِإِحْدَى ثَلَاثٍ بِكُفْرٍ بَعْدَ إِيمَانٍ أَوْ بِزِنًى بَعْدَ إِحْصَانٍ أَوْ يَقْتُلُ نَفْسًا بِغَيْرِ نَفْسٍ فَيُقْتَلُ",
            "id": "Telah mengabarkan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Hammad bin Zaid] dari [Yahya bin Sa'id] dari [Abu Umamah bin Sahl bin Hani] dari [Utsman], ia berkata; aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal darah seorang muslim kecuali dengan tiga perkara, yaitu; kafir setelah beriman (murtad), berzina setelah menikah, atau membunuh jiwa bukan karena hak, sehingga ia dibunuh.\""
        },
        {
            "number": 2196,
            "arab": " حَدَّثَنَا يَعْلَى حَدَّثَنَا الْأَعْمَشُ عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَحِلُّ دَمُ رَجُلٍ يَشْهَدُ أَنَّ لَا إِلَهَ إِلَّا اللَّهُ وَأَنِّي رَسُولُ اللَّهِ إِلَّا أَحَدَ ثَلَاثَةِ نَفَرٍ النَّفْسُ بِالنَّفْسِ وَالثَّيِّبُ الزَّانِي وَالتَّارِكُ لِدِينِهِ الْمُفَارِقُ لِلْجَمَاعَةِ",
            "id": "Telah menceritakan kepada kami [Ya'la] telah menceritakan kepada kami [Al A'masy] dari [Abdullah bin Murrah] dari [Masruq] dari [Abdullah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal darah seorang wanita yang bersaksi bahwa tidak ada Ilah yang berhak disembah melainkan Allah dan aku adalah Rasulullah, kecuali salah satu dari tiga orang ini, yaitu; jiwa dibalas dengan jiwa (qishahs), janda yang berzina, orang yang meninggalkan agamanya dan memisahkan diri dari jama'ah kaum muslimin.\""
        },
        {
            "number": 2197,
            "arab": " أَخْبَرَنَا سَعْدُ بْنُ حَفْصٍ حَدَّثَنَا شَيْبَانُ عَنْ أَشْعَثَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَ صَفْوَانُ بْنُ أُمَيَّةَ نَائِمًا فِي الْمَسْجِدِ فَأَتَاهُ رَجُلٌ وَهُوَ نَائِمٌ فَاسْتَلَّ رِدَاءَهُ مِنْ تَحْتِ رَأْسِهِ فَنَبِهَ بِهِ فَلَحِقَهُ فَأَخَذَهُ فَانْطَلَقَ بِهِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ كُنْتُ نَائِمًا فِي الْمَسْجِدِ فَأَتَانِي هَذَا فَاسْتَلَّ رِدَائِي مِنْ تَحْتِ رَأْسِي فَلَحِقْتُهُ فَأَخَذْتُهُ فَأَمَرَ بِقَطْعِهِ فَقَالَ لَهُ صَفْوَانُ يَا رَسُولَ اللَّهِ إِنَّ رِدَائِي لَمْ يَبْلُغْ أَنْ يُقْطَعَ فِيهِ هَذَا قَالَ فَهَلَّا قَبْلَ أَنْ تَأْتِيَنِي بِهِ",
            "id": "Telah mengabarkan kepada kami [Sa'd bin Hafsh] telah menceritakan kepada kami [Syaiban] dari [Asy'ats] dari [Ikrimah] dari [Ibnu Abbas], ia berkata; Shafwan bin Umayyah pernah tidur di masjid, kemudian seorang laki-laki datang kepadanya sementara ia masih tidur, aki-laki itu lalu mengambil selendangnya dari bawah kepalanya. Katika terjaga, dia langsung mengejar laki-laki itu dan berhasil menangkapnya, setelah itu dia membawanya menghadap kepada Rasulullah shallallahu 'alaihi wasallam seraya berkata; \"Wahai Rasulullah, tadi aku tidur di masjid, kemudian orang ini mendatangiku dan mengambil selendangku dari bawah kepalaku. Lalu aku mengejarnya dan berhasil menangkapnya.\" Kemudian beliau memerintahkan agar tangan laki-laki itu dipotong. Ternyata Shafwan berkata; \"Wahai Rasulullah, sesungguhnya tidak sampai harus dipotong tangannya karena selendangku.\" Beliau bersabda: \"Seandainya kamu mengatakannya sebelum kamu membawanya kepadaku.\""
        },
        {
            "number": 2198,
            "arab": " أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْهَاشِمِيُّ أَخْبَرَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ الزُّهْرِيِّ عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تُقْطَعُ الْيَدُ فِي رُبْعِ دِينَارٍ فَصَاعِدًا",
            "id": "Telah mengabarkan kepada kami [Sulaiman bin Daud Al Hasyimi] telah mengabarkan kepada kami [Ibrahim bin Sa'd] dari [Az Zuhri] dari ['Amrah binti Abdurrahman] dari ['Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tangan dipotong karena mengambil sesuatu yang nilainya seperempat dinar atau lebih.\""
        },
        {
            "number": 2199,
            "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ وَإِسْمَعِيلَ بْنِ أُمَيَّةَ وَعُبَيْدِ اللَّهِ وَمُوسَى بْنِ عُقْبَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَطَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مِجَنٍّ قِيمَتُهُ ثَلَاثَةُ دَرَاهِمَ",
            "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Ayyub] dan [Isma'il bin Umayyah] dan ['Ubaidullah] serta [Musa bin 'Uqbah] dari [Nafi'] dari [Ibnu Umar], ia berkata; Rasulullah shallallahu 'alaihi wasallam memotong tangan pencuri tameng yang nilainya sebesar tiga dirham.\""
        },
        {
            "number": 2200,
            "arab": " أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ أَنَّ قُرَيْشًا أَهَمَّهُمْ شَأْنُ الْمَرْأَةِ الْمَخْزُومِيَّةِ الَّتِي سَرَقَتْ فَقَالُوا مَنْ يُكَلِّمُ فِيهَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالُوا وَمَنْ يَجْتَرِئُ عَلَيْهِ إِلَّا أُسَامَةُ بْنُ زَيْدٍ حِبُّ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَلَّمَهُ أُسَامَةُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَشْفَعُ فِي حَدٍّ مِنْ حُدُودِ اللَّهِ ثُمَّ قَامَ فَاخْتَطَبَ فَقَالَ إِنَّمَا هَلَكَ الَّذِينَ قَبْلَكُمْ أَنَّهُمْ كَانُوا إِذَا سَرَقَ فِيهِمْ الشَّرِيفُ تَرَكُوهُ وَإِذَا سَرَقَ فِيهِمْ الضَّعِيفُ أَقَامُوا عَلَيْهِ الْحَدَّ وَايْمُ اللَّهِ لَوْ أَنَّ فَاطِمَةَ بِنْتَ مُحَمَّدٍ سَرَقَتْ لَقَطَعْتُ يَدَهَا",
            "id": "Telah mengabarkan kepada kami [Ahmad bin Abdullah] telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] dari ['Urwah bin Az Zubair] dari ['Aisyah] bahwa orang-orang Quraisy disibukkan oleh perkara wanita Makhzum yang mencuri, kemudian mereka berkata; \"Siapakah yang akan menjadi jubir kepada Rasulullah shallallahu 'alaihi wasallam mengenai wanita tersebut?\" Orang-orang yang lain mengatakan; \"Sepertinya tidak ada yang berani kecuali Usamah bin Zaid, orang yang dicintai Rasulullah shallallahu 'alaihi wasallam.\" Kemudian Usamah berbicara kepada beliau. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah engkau akan memberikan pertolongan dalam perkara had diantara had-had Allah?\" kemudian beliau berdiri dan berkhutbah, beliau bersabda: 'Sesungguhnya orang-orang sebelum kalian binasa, bahwa jika terdapat orang mulia diantara mereka mencuri, maka mereka membiarkannya dan jika terdapat orang yang lemah diantara mereka mencuri, maka mereka menegakkan hukuman atasnya. Demi Allah apabila Fathimah binti Muhammad mencuri, niscaya aku akan potong tangannya.\""
        },
        {
            "number": 2201,
            "arab": " أَخْبَرَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَبِي الْمُنْذِرِ مَوْلَى أَبِي ذَرٍّ عَنْ أَبِي أُمَيَّةَ الْمَخْزُومِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِسَارِقٍ اعْتَرَفَ اعْتِرَافًا لَمْ يُوجَدْ مَعَهُ مَتَاعٌ فَقَالَ مَا إِخَالُكَ سَرَقْتَ قَالَ بَلَى قَالَ مَا إِخَالُكَ سَرَقْتَ قَالَ بَلَى قَالَ فَاذْهَبُوا فَاقْطَعُوا يَدَهُ ثُمَّ جِيئُوا بِهِ فَقَطَعُوا يَدَهُ ثُمَّ جَاءُوا بِهِ فَقَالَ اسْتَغْفِرْ اللَّهَ وَتُبْ إِلَيْهِ فَقَالَ أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ فَقَالَ اللَّهُمَّ تُبْ عَلَيْهِ اللَّهُمَّ تُبْ عَلَيْهِ",
            "id": "Telah mengabarkan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Hammad bin Salamah] dari [Ishaq bin Abdullah bin Abu Thalhah] dari [Abu Al Mundzir] mantan budak Abu Dzar dari [Abu Umayyah Al Makhzumi] bahwa seorang pencuri yang mengaku telah mencuri dihadapakan kepada Rasulullah shallallahu 'alaihi wasallam, namun tidak didapatkan barang padanya. Kemudian beliau bersabda: \"Aku tidak menyangka engkau mencuri.\" Ia berkata; \"Benar.\" Beliau bersabda: \"Aku tidak menyangka engkau mencuri.\" Ia berkata; \"Benar.\" Beliau bersabda (kepada para sahabatnya): \"Pergilah kalian dan potonglah tangannya, setelah itu bawalah dia kemari.\" Kemudian mereka memotongnya setelah itu mereka membawanya (menghadap beliau), lalu beliau bersabda kepadanya: \"Mohonlah ampunan kepada Allah dan bertaubatlah kepadaNya.\" Orang itu pun mengatakan; \"Aku mohon ampun kepada Allah dan bertaubat kepadaNya.\" Beliau bersabda: \"Ya Allah, terimalah taubatnya, ya Allah, terimalah taubatnya.\""
        },
        {
            "number": 2202,
            "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا يَحْيَى هُوَ ابْنُ سَعِيدٍ أَنَّ مُحَمَّدَ بْنَ يَحْيَى بْنِ حَبَّانَ أَخْبَرَهُ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا قَطْعَ فِي ثَمَرٍ وَلَا كَثَرٍ",
            "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Yahya yaitu Ibnu Sa'id] bahwa [Muhammad bin Yahya bin Habban] telah mengabarkan kepadanya dari [Rafi' bin Khadij] ia berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada had potong tangan karena mengambil buah dan mayang (kurma).\""
        },
        {
            "number": 2203,
            "arab": " حَدَّثَنَا الْحُسَيْنُ بْنُ مَنْصُورٍ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ رَجُلٍ مِنْ قَوْمِهِ عَنْ رَافِعِ بْنِ خَدِيجٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا قَطْعَ فِي ثَمَرٍ وَلَا كَثَرٍ",
            "id": "Telah menceritakan kepada kami [Al Husain bin Manshur] telah menceritakan kepada kami [Abu Usamah] dari [Yahya bin Sa'id] dari [Muhammad bin Yahnya bin Hibban] dari [seorang laki-laki] dari kaumnya dari [Rafi' bin Khadij] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Tidak ada had potong tangan karena mengambil buah dan mayang (kurma).\""
        },
        {
            "number": 2204,
            "arab": " أَخْبَرَنَا إِسْحَقُ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ عَمِّهِ وَاسِعِ بْنِ حَبَّانَ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا قَطْعَ فِي ثَمَرٍ وَلَا كَثَرٍ حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ رَافِعِ بْنِ خَدِيجٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
            "id": "Telah mengabarkan kepada kami [Ishaq] telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Yahya bin Sa'id] dari [Muhammad bin Yahya bin Habban] dari pamannya yaitu [Wasi' bin Habban] dari [Rafi' bin Khadij], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada had potong tangan karena mengambil buah dan mayang (kurma).\" Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Yahya bin Sa'id] dari [Muhammad bin Yahya bin Habban] dari [Rafi' bin Khadij] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas."
        },
        {
            "number": 2205,
            "arab": " أَخْبَرَنَا إِسْحَقُ حَدَّثَنَا جَرِيرٌ وَالثَّقَفِيُّ عَنْ يَحْيَى بْنِ سَعِيدٍ أَخْبَرَنِي مُحَمَّدُ بْنُ يَحْيَى بْنِ حَبَّانَ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا قَطْعَ فِي ثَمَرٍ وَلَا كَثَرٍ قَالَ وَهُوَ شَحْمُ النَّخْلِ وَالْكَثَرُ الْجُمَّارُ",
            "id": "Telah mengabarkan kepada kami [Ishaq] telah menceritakan kepadaku [Jarir] serta [Ats Tsaqafi] dari [Yahya bin Sa'id] telah mengabarkan kepadaku [Muhammad bin Yahya bin Habban] dari [Rafi' bin Khadij], ia berkata; Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak ada had potong tangan karena mengambil buah dan mayang (kurma).\" Rafi' berkata; \"Yaitu kurma yang paling lunak, sedangkan katsar adalah mayang (kurma).\""
        },
        {
            "number": 2206,
            "arab": " أَخْبَرَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ أَبِي مَيْمُونٍ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا قَطْعَ فِي كَثَرٍ قَالَ أَبُو مُحَمَّد الْقَوْلُ مَا قَالَ أَبُو أُسَامَةَ",
            "id": "Telah mengabarkan kepada kami [Sa'id bin Manshur] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Yahya bin Sa'id] dari [Muhammad bin Yahya bin Habban] dari [Abu Maimun] dari [Rafi' bin Khadij] ia berkata; aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak ada had potong tangan karena mengambil mayang (kurma).\" Abu Muhammad berkata; \"Perkataan yang benar adalah yang dikatakan oleh Abu Usamah.\""
        },
        {
            "number": 2207,
            "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ قَالَ قَالَ أَبُو الزُّبَيْرِ قَالَ جَابِرٌ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ عَلَى الْمُنْتَهِبِ وَلَا عَلَى الْمُخْتَلِسِ وَلَا عَلَى الْخَائِنِ قَطْعٌ",
            "id": "Telah mengabarkan kepada kami [Abu 'Ashim] dari [Ibnu Juraij] ia berkata; [Abu Az Zubair] berkata; [Jabir] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang merampas dan yang menggelapkan harta serta orang yang berkhianat tidak dipotong tangannya.\""
        },
        {
            "number": 2208,
            "arab": " حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِرَجُلٍ قَدْ شَرِبَ خَمْرًا فَضَرَبَهُ بِجَرِيدَتَيْنِ ثُمَّ فَعَلَ أَبُو بَكْرٍ مِثْلَ ذَلِكَ فَلَمَّا كَانَ عُمَرُ اسْتَشَارَ النَّاسَ فَقَالَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ أَخَفُّ الْحُدُودِ ثَمَانِينَ قَالَ فَفَعَلَ",
            "id": "Telah menceritakan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Anas] bahwa seorang laki-laki yang meminum khamer dihadapkan kepada Nabi shallallahu 'alaihi wasallam, kemudian beliau mencambuknya dengan dua pelepah kurma, Abu Bakr juga melakukan seperti itu. Setelah Umar berkuasa, maka ia meminta pendapat orang-orang, kemudian Abdurrahman bin 'Auf berkata; \"Had (hukuman) yang paling ringan adalah delapan puluh kali cambukan.\" Anas berkata; \"Kemudian Umar melakukannya hal itu.\""
        },
        {
            "number": 2209,
            "arab": " حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُخْتَارِ حَدَّثَنَا عَبْدُ اللَّهِ الدَّانَاجُ حَدَّثَنَا حُضَيْنُ بْنُ الْمُنْذِرِ الرَّقَاشِيُّ قَالَ شَهِدْتُ عُثْمَانَ بْنَ عَفَّانَ وَأُتِيَ بِالْوَلِيدِ بْنِ عُقْبَةَ فَقَالَ عَلِيٌّ جَلَدَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعِينَ وَجَلَدَ أَبُو بَكْرٍ أَرْبَعِينَ وَعُمَرُ ثَمَانِينَ وَكُلٌّ سُنَّةٌ",
            "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah mengabarkan kepada kami [Abdul Aziz bin Al Mukhtar] telah menceritakan kepada kami [Abdullah Ad Danaj] telah menceritakan kepada kami [Hudhain bin Al Mundzir Ar Raqasyi], ia berkata; aku menyaksikan Utsman bin 'Affan dan dihadapkan kepadanya Al Walid bin 'Uqbah, kemudian [Ali] berkata; \"Nabi shallallahu 'alaihi wasallam pernah mencambuknya empat puluh kali dan Abu Bakr juga empat puluh kali sementara Umar delapan puluh kali, dan semuanya adalah sunnah.\""
        },
        {
            "number": 2210,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرَّقَاشِيُّ حَدَّثَنَا يَزِيدُ هُوَ ابْنُ زُرَيْعٍ حَدَّثَنَا مُحَمَّدٌ هُوَ ابْنُ إِسْحَقَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُتْبَةَ بْنِ عُرْوَةَ بْنِ مَسْعُودٍ الثَّقَفِيُّ عَنْ عَمْرِو بْنِ الشَّرِيدِ عَنْ أَبِيهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا شَرِبَ أَحَدُكُمْ فَاضْرِبُوهُ ثُمَّ إِنْ عَادَ فَاضْرِبُوهُ ثُمَّ إِنْ عَادَ فَاضْرِبُوهُ ثُمَّ إِنْ عَادَ الرَّابِعَةَ فَاقْتُلُوهُ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah Ar Raqasyi] telah menceritakan kepada kami [Yazid yaitu Ibnu Zurai'] telah menceritakan kepada kami [Muhammad yaitu Ibnu Ishaq] telah menceritakan kepada kami [Abdullah bin 'Utbah bin 'Urwah bin Mas'ud Ats Tsaqafi] dari ['Amr bin Asy Syarid] dari [Ayahnya] ia berkata; aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian minum khamer, maka cambuklah dia, apabila ia mengulangi, maka cambuklah dia, apabila ia masih mengulangi, maka cambuklah dia, dan apabila ia tetap mengulangi yang keempat kalinya, maka bunuhlah dia.\""
        },
        {
            "number": 2211,
            "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ حَدَّثَنَا سَعِيدٌ هُوَ ابْنُ أَبِي أَيُّوبَ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عَبْدِ الرَّحْمَنِ هُوَ ابْنُ جَابِرٍ عَنْ أَبِي بُرْدَةَ بْنِ نِيَارٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَحِلُّ لِأَحَدٍ أَنْ يَضْرِبَ أَحَدًا فَوْقَ عَشَرَةِ أَسْوَاطٍ إِلَّا فِي حَدٍّ مِنْ حُدُودِ اللَّهِ",
            "id": "Telah mengabarkan kepada kami [Abdullah bin Yazid] telah menceritakan kepada kami [Sa'id bin Abu Ayyub] telah menceritakan kepadaku [Yazid bin Abu Habib] dari [Bukair bin Abdullah bin Al Asyaj] dari [Sulaiman bin Yasar] dari [Abdurrahman yaitu Ibnu Jabir] dari [Abu Burdah bin Niyar], ia berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal bagi seseorang untuk mencambuk orang lain lebih dari sepuluh kali, kecuali dalam hukuman diantara hukuman-hukuman (yang ditetapkan) Allah.\""
        },
        {
            "number": 2212,
            "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ حَدَّثَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي ابْنُ شِهَابٍ عَنْ أَبِي سَلَمَةَ عَنْ جَابِرٍ أَنَّ رَجُلًا مِنْ أَسْلَمَ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحَدَّثَهُ أَنَّهُ زَنَى فَشَهِدَ عَلَى نَفْسِهِ أَنَّهُ زَنَى أَرْبَعًا فَأَمَرَ بِرَجْمِهِ وَكَانَ قَدْ أُحْصِنَ",
            "id": "Telah mengabarkan kepada kami [Abu 'Ashim] telah menceritakan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Ibnu Syihab] dari [Abu Salamah] dari [Jabir] bahwa seorang laki-laki dari Aslam datang kepada Nabi shallallahu 'alaihi wasallam, dia lalu menceritakan kepadanya bahwa dia telah berzina. Kemudian ia bersumpah atas dirinya sebanyak empat kali bahwa dirinya telah berzina. Kemudian beliau memerintahkan agar laki-laki itu dirajam, sementara laki-laki itu adalah orang yang telah menikah.\""
        },
        {
            "number": 2213,
            "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ إِسْرَائِيلَ عَنْ سِمَاكٍ أَنَّهُ سَمِعَ جَابِرَ بْنَ سَمُرَةَ يَقُولُ أُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَاعِزِ بْنِ مَالِكٍ رَجُلٍ قَصِيرٍ فِي إِزَارٍ مَا عَلَيْهِ رِدَاءٌ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُتَّكِئٌ عَلَى وِسَادَةٍ عَلَى يَسَارِهِ فَكَلَّمَهُ فَمَا أَدْرِي مَا يُكَلِّمُهُ بِهِ وَأَنَا بَعِيدٌ مِنْهُ بَيْنِي وَبَيْنَهُ الْقَوْمُ ثُمَّ قَالَ اذْهَبُوا بِهِ فَارْجُمُوهُ ثُمَّ قَالَ رُدُّوهُ فَكَلَّمَهُ أَيْضًا وَأَنَا أَسْمَعُ غَيْرَ أَنَّ بَيْنِي وَبَيْنَهُ الْقَوْمَ فَقَالَ اذْهَبُوا بِهِ فَارْجُمُوهُ ثُمَّ قَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَخَطَبَ وَأَنَا أَسْمَعُهُ ثُمَّ قَالَ كُلَّمَا نَفَرْنَا فِي سَبِيلِ اللَّهِ خَلَفَ أَحَدُهُمْ لَهُ نَبِيبٌ كَنَبِيبِ التَّيْسِ يَمْنَحُ إِحْدَاهُنَّ الْكُثْبَةَ مِنْ اللَّبَنِ وَاللَّهِ لَا أَقْدِرُ عَلَى أَحَدٍ مِنْهُمْ إِلَّا نَكَّلْتُ بِهِ",
            "id": "Telah mengabarkan kepada kami ['Ubaidullah bin Musa] dari [Isra`il] dari [Simak] bahwa ia mendengar [Jabir bin Samurah] berkata; Ma'iz bin Malik seorang yang memiliki kain sarung yang pendek dan tidak memakai selendang dihadapkan kepada Nabi shallallahu 'alaihi wasallam, sementara Rasulullah shallallahu 'alaihi wasallam bersandar pada bantal di sisi kirinya. Kemudian beliau berbicara kepadanya, aku tidak tahu apa yang beliau bicarakan, sementara aku jauh darinya, sebab antara diriku dan dirinya terdapat beberapa orang. Kemudian beliau bersabda: \"Bawalah dia pergi dan rajamlah dia! \" Kemudian beliau bersabda: \"Suruhlah dia kembali! \" Kemudian beliau berbicara kepadanya dan aku sempat mendengar, hanya saja antara diriku dan dirinya terdapat beberapa orang, kemudian beliau bersabda: \"Bawalah dia pergi dan rajamlah dia! \" Kemudian Nabi shallallahu 'alaihi wasallam berdiri dan berkhutbah, sementara aku mendengarnya, beliau bersabda: \"Setiap kali kita hendak pergi di jalan Allah, masih saja salah seorang dari mereka tidak ikut serta, lalu dia memberikan sesuatu (kepada istrinya -pent) seperti suara kambing pejantan yang sedang terbakar nafsu birahi, Demi Allah, sekiranya saya di berikan kemungkinan, niscaya saya akan memberikan hukuman kepadanya sebagai suatu pelajaran.\""
        },
        {
            "number": 2214,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ أَبِي هُرَيْرَةَ وَزَيْدِ بْنِ خَالِدٍ وَشِبْلٍ قَالُوا جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَنْشُدُكَ اللَّهَ إِلَّا قَضَيْتَ بَيْنَنَا بِكِتَابِ اللَّهِ فَقَالَ خَصْمُهُ وَكَانَ أَفْقَهَ مِنْهُ صَدَقَ اقْضِ بَيْنَنَا بِكِتَابِ اللَّهِ وَأْذَنْ لِي يَا رَسُولَ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْ فَقَالَ إِنَّ ابْنِي كَانَ عَسِيفًا عَلَى أَهْلِ هَذَا فَزَنَى بِامْرَأَتِهِ فَافْتَدَيْتُ مِنْهُ بِمِائَةِ شَاةٍ وَخَادِمٍ وَإِنِّي سَأَلْتُ رِجَالًا مِنْ أَهْلِ الْعِلْمِ فَأَخْبَرُونِي أَنَّ عَلَى ابْنِي جَلْدَ مِائَةٍ وَتَغْرِيبَ عَامٍ وَأَنَّ عَلَى امْرَأَةِ هَذَا الرَّجْمَ فَقَالَ وَالَّذِي نَفْسِي بِيَدِهِ لَأَقْضِيَنَّ بَيْنَكُمَا بِكِتَابِ اللَّهِ الْمِائَةُ شَاةٍ وَالْخَادِمُ رَدٌّ عَلَيْكَ وَعَلَى ابْنِكَ جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ وَيَا أُنَيْسُ اغْدُ عَلَى امْرَأَةِ هَذَا فَسَلْهَا فَإِنْ اعْتَرَفَتْ فَارْجُمْهَا فَاعْتَرَفَتْ فَرَجَمَهَا",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dari ['Ubaidullah bin Abdullah bin 'Utbah] dari [Abu Hurairah] serta [Zaid bin Khalid] dan [Syibl] mereka berkata; \"Seorang laki-laki datang kepada Rasulullah shallallahu 'alaihi wasallam seraya berkata; \"Aku bersumpah kepadamu atas nama Allah, putuskanlah perkara diantara kami dengan Kitabullah.\" Kemudian lawannya yang lebih faham daripada dirinya berkata; \"Ia benar, berilah keputusan diantara kami dengan Kitabullah, dan izinkan kami berbicara wahai Rasulullah! \" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Katakanlah! \" ia berkata; \"Sesungguhnya anakku adalah pelayan untuk melayani keperluan isteri orang ini. Ternyata ia berzina dengan isterinya itu, kemudian aku menebus darinya dengan seratus ekor unta serta seorang budak. Dan aku bertanya kepada orang-orang yang berilmu, lalu mereka memberitahukan kepadaku bahwa anakku mendapat hukuman cambuk seratus kali dan di asingkan selama satu tahun, sementara isteri orang ini mendapat hukuman rajam.\" Beliau bersabda: \"Demi Dzat yang jiwaku ada di tanganNya. Sungguh aku akan memberikan keputusan dengan Kitabullah. Seratus ekor kambing dan seorang budak dikembalikan kepadamu, dan anakmu mendapatkan hukuman cambuk seratus kali dan di asingkan selama satu tahun. Wahai Unais, pergilah kepada isteri orang ini, dan tanyakan kepadanya! Apabila ia mengaku, maka rajamlah dia.\" Wanita itupun mengakui perbuatannya, maka Unais merajamnya."
        },
        {
            "number": 2215,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرَّقَاشِيُّ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا مُحَمَّدٌ هُوَ ابْنُ إِسْحَقَ بْنِ يَسَارٍ حَدَّثَنَا مُحَمَّدُ بْنُ إِبْرَاهِيمَ التَّيْمِيُّ عَنْ أَبِي الْهَيْثَمِ بْنِ نَصْرِ بْنِ دَهْرٍ الْأَسْلَمِيِّ عَنْ أَبِيهِ قَالَ كُنْتُ فِيمَنْ رَجَمَهُ قَالَ أَبُو مُحَمَّد يَعْنِي مَاعِزَ بْنَ مَالِكٍ فَلَمَّا وَجَدَ مَسَّ الْحِجَارَةِ جَزِعَ جَزَعًا شَدِيدًا قَالَ فَذَكَرْنَا ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَهَلَّا تَرَكْتُمُوهُ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah Ar Raqasyi] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Muhammad bin Ishaq bin Yasar] telah menceritakan kepada kami [Muhammad bin Ibrahim At Taimi] dari [Abu Al Haitsami bin Nashr bin Dahr Al Aslami] dari [Ayahnya] ia berkata; aku termasuk diantara orang yang merajamnya. -Abu Muhammad berkata; yaitu Ma'iz bin Malik- Tatkala dia merasakan lemparan bebatuan, dia sangat gelisah. Nashr bin Dahr Al Aslami berkata; Kemudian kami menyebutkan hal itu kepada Rasulullah shallallahu 'alaihi wasallam. Lalu beliau bersabda: \"Tidakkah kalian meninggalkannya?\""
        },
        {
            "number": 2216,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا يَحْيَى بْنُ أَبِي زَائِدَةَ عَنْ دَاوُدَ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْطَلِقُوا بِمَاعِزِ بْنِ مَالِكٍ فَارْجُمُوهُ فَانْطَلَقْنَا بِهِ إِلَى بَقِيعِ الْغَرْقَدِ فَوَاللَّهِ مَا أَوْثَقْنَاهُ وَلَا حَفَرْنَا لَهُ وَلَكِنْ قَامَ فَرَمَيْنَاهُ بِالْعِظَامِ وَالْخَزَفِ وَالْجَنْدَلِ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Yahya bin Abu Zaidah] dari [Daud] dari [Abu Nadhrah] dari [Abu Sa'id Al Khudri] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pergilah kepada Ma'iz bin Malik, dan rajamlah dia.\" Kemudian kami membawanya pergi ke Baqi' yang banyak pohon Gharqadnya. Demi Allah, kami tidak mengikatnya dan tidak pula menguburnya, akan tetapi ia berdiri, kemudian kami melemparinya dengan tulang, potongan bejana serta bebatuan.\""
        },
        {
            "number": 2217,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا بَشِيرُ بْنُ الْمُهَاجِرِ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ عَنْ أَبِيهِ قَالَ كُنْتُ جَالِسًا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَاءَهُ رَجُلٌ يُقَالُ لَهُ مَاعِزُ بْنُ مَالِكٍ فَاعْتَرَفَ عِنْدَهُ بِالزِّنَا فَرَدَّهُ ثَلَاثَ مَرَّاتٍ ثُمَّ جَاءَ الرَّابِعَةَ فَاعْتَرَفَ فَأَمَرَ بِهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحُفِرَ لَهُ حُفْرَةٌ فَجُعِلَ فِيهَا إِلَى صَدْرِهِ وَأَمَرَ النَّاسَ أَنْ يَرْجُمُوهُ",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Basyir bin Al Muhajir] telah menceritakan kepadaku [Abdullah bin Buraidah] dari [Ayahnya] ia berkata; kami pernah duduk-duduk bersama Nabi shallallahu 'alaihi wasallam, kemudian seorang laki-laki yang bernama Ma'iz bin Malik datang kepada beliau dan mengaku bahwa dirinya telah berzina. Namun beliau berpaling darinya sebanyak tiga kali. Akan tetapi dia tetap datang keempat kalinya sambil mengakui perbuatannya. Akhirnya Nabi shallallahu 'alaihi wasallam memerintahkan agar dibuatkan lubang untuknya, kemudian dia diletakkan pada lobang tersebut hingga dada, dan beliau memerintahkan orang-orang agar melemparinya (dengan batu).\""
        },
        {
            "number": 2218,
            "arab": " أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ الْيَهُودَ جَاءُوا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِرَجُلٍ مِنْهُمْ وَامْرَأَةٍ قَدْ زَنَيَا فَقَالَ كَيْفَ تَفْعَلُونَ بِمَنْ زَنَى مِنْكُمْ قَالُوا لَا نَجِدُ فِيهَا شَيْئًا فَقَالَ لَهُمْ عَبْدُ اللَّهِ بْنُ سَلَامٍ كَذَبْتُمْ فِي التَّوْرَاةِ الرَّجْمُ { فَأْتُوا بِالتَّوْرَاةِ فَاتْلُوهَا إِنْ كُنْتُمْ صَادِقِينَ } فَجَاءُوا بِالتَّوْرَاةِ فَوَضَعَ مِدْرَاسُهَا الَّذِي يَدْرُسُهَا مِنْهُمْ كَفَّهُ عَلَى آيَةِ الرَّجْمِ فَقَالَ مَا هَذِهِ فَلَمَّا رَأَوْا ذَلِكَ قَالُوا هِيَ آيَةُ الرَّجْمِ فَأَمَرَ بِهِمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرُجِمَا قَرِيبًا مِنْ حَيْثُ تُوضَعُ الْجَنَائِزُ عِنْدَ الْمَسْجِدِ قَالَ عَبْدُ اللَّهِ فَرَأَيْتُ صَاحِبَهَا يَجْنَأُ عَلَيْهَا يَقِيهَا الْحِجَارَةَ",
            "id": "Telah mengabarkan kepada kami [Ahmad bin Abdullah] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Musa bin 'Uqbah] dari [Nafi'] dari [Ibnu Umar] bahwa orang-orang Yahudi datang kepada Rasulullah shallallahu 'alaihi wasallam dengan membawa seorang laki-laki dan perempuan dari kalangan mereka yang berzina. Kemudian beliau bersabda: \"Bagaimana kalian berbuat terhadap orang yang berzina dari kalangan kalian?\" Mereka mengatakan; \"Kami tidak mendapatkan dalam Taurat sesuatupun. Kemudian Abdullah bin Salam berkata kepada mereka; \"Kalian telah berdusta. Dalam taurat terdapat rajam. Datangkanlah Taurat kemudian bacalah, apabila kalian adalah orang-orang yang benar.\" Kemudian mereka mendatangkan Taurat, sementara orang yang mempelajari Taurat dari kalangan mereka meletakkan telapak tangannya pada ayat mengenai rajam. Beliau bertanya; \"Apa ini?\" Tatkala mereka melihat hal itu, mereka berkata; \"Itu adalah ayat rajam.\" Rasulullah shallallahu 'alaihi wasallam pun memerintahkan supaya keduanya dirajam, akhirnya keduanya di rajam dekat dari tempat diletakkannya beberapa jenazah di Masjid. Abdullah berkata; \"Aku melihat laki-laki itu membungkuk diatas wanita tersebut untuk melindunginya dari bebatuan.\""
        },
        {
            "number": 2219,
            "arab": " أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ عُمَرُ إِنَّ اللَّهَ تَعَالَى بَعَثَ مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْحَقِّ وَأَنْزَلَ عَلَيْهِ الْكِتَابَ وَكَانَ فِيمَا أَنْزَلَ آيَةُ الرَّجْمِ فَقَرَأْنَاهَا وَوَعَيْنَاهَا وَعَقَلْنَاهَا وَرَجَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَجَمْنَا بَعْدَهُ فَأَخْشَى إِنْ طَالَ بِالنَّاسِ زَمَانٌ أَنْ يَقُولَ الْقَائِلُ لَا نَجِدُ حَدَّ آيَةِ الرَّجْمِ فِي كِتَابِ اللَّهِ وَالرَّجْمُ فِي كِتَابِ اللَّهِ حَقٌّ عَلَى مَنْ زَنَى مِنْ الرِّجَالِ وَالنِّسَاءِ إِذَا أُحْصِنَ إِذَا قَامَتْ عَلَيْهِ الْبَيِّنَةُ أَوْ كَانَ الْحَبَلُ أَوْ الِاعْتِرَافُ",
            "id": "Telah mengabarkan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Az Zuhri] dari ['Ubaidullah bin Abdullah bin 'Utbah] dari [Ibnu Abbas], ia berkata; [Umar] berkata; Sesungguhnya Allah Ta'ala telah mengutus Muhammad shallallahu 'alaihi wasallam dengan membawa kebenaran, dan telah menurunkan kepadanya Al Qur'an. Diantara yang Allah turunkan adalah ayat mengenai rajam. Kemudian kami membacanya dan menghafal serta memahaminya. Rasulullah shallallahu 'alaihi wasallam pernah merajam dan kamipun merajam setelah beliau (wafat). Lalu aku khawatir apabila zaman telah berlalu bagi manusia, maka seseorang akan berkata; \"Kami tidak mendapatkan ayat rajam dalam Kitabullah, sementara rajam dalam Kitabullah adalah benar, yaitu bagi laki-laki dan perempuan yang telah menikah, dan telah cukup bukti atau hamil atau mengaku telah berzina.\""
        },
        {
            "number": 2220,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يَزِيدَ الرِّفَاعِيُّ حَدَّثَنَا الْعَقَدِيُّ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ يُونُسَ بْنِ جُبَيْرٍ يُحَدِّثُ عَنْ كَثِيرِ بْنِ الصَّلْتِ عَنْ زَيْدِ بْنِ ثَابِتٍ قَالَ أَشْهَدُ لَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الشَّيْخُ وَالشَّيْخَةُ إِذَا زَنَيَا فَارْجُمُوهُمَا الْبَتَّةَ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Yazid Ar Rifa'i] telah menceritakan kepada kami [Al 'Aqadi] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Yunus bin Jubair] ia menceritakan dari [Katsir bin Ash Shalt] dari [Zaid bin Tsabit], ia berkata; aku bersaksi telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang laki-laki dan perempuan tua apabila berzina, maka rajamlah dia.\""
        },
        {
            "number": 2221,
            "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا بَشِيرُ بْنُ الْمُهَاجِرِ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ عَنْ أَبِيهِ قَالَ كُنْتُ جَالِسًا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَاءَتْهُ امْرَأَةٌ مِنْ بَنِي غَامِدٍ فَقَالَتْ يَا نَبِيَّ اللَّهِ إِنِّي قَدْ زَنَيْتُ وَإِنِّي أُرِيدُ أَنْ تُطَهِّرَنِي فَقَالَ لَهَا ارْجِعِي فَلَمَّا كَانَ مِنْ الْغَدِ أَتَتْهُ أَيْضًا فَاعْتَرَفَتْ عِنْدَهُ بِالزِّنَا فَقَالَتْ يَا نَبِيَّ اللَّهِ طَهِّرْنِي فَلَعَلَّكَ أَنْ تَرْدُدَنِي كَمَا رَدَدْتَ مَاعِزَ بْنَ مَالِكٍ فَوَاللَّهِ إِنِّي لَحُبْلَى فَقَالَ لَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ارْجِعِي حَتَّى تَلِدِي فَلَمَّا وَلَدَتْ جَاءَتْ بِالصَّبِيِّ تَحْمِلُهُ فِي خِرْقَةٍ فَقَالَتْ يَا نَبِيَّ اللَّهِ هَذَا قَدْ وَلَدْتُ قَالَ فَاذْهَبِي فَأَرْضِعِيهِ ثُمَّ افْطِمِيهِ فَلَمَّا فَطَمَتْهُ جَاءَتْ بِالصَّبِيِّ فِي يَدِهِ كِسْرَةُ خُبْزٍ فَقَالَتْ يَا نَبِيَّ اللَّهِ قَدْ فَطَمْتُهُ فَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالصَّبِيِّ فَدُفِعَ إِلَى رَجُلٍ مِنْ الْمُسْلِمِينَ وَأَمَرَ بِهَا فَحُفِرَ لَهَا حُفْرَةٌ فَجُعِلَتْ فِيهَا إِلَى صَدْرِهَا ثُمَّ أَمَرَ النَّاسَ أَنْ يَرْجُمُوهَا فَأَقْبَلَ خَالِدُ بْنُ الْوَلِيدِ بِحَجَرٍ فَرَمَى رَأْسَهَا فَتَلَطَّخَ الدَّمُ عَلَى وَجْنَةِ خَالِدِ بْنِ الْوَلِيدِ فَسَبَّهَا فَسَمِعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَبَّهُ إِيَّاهَا فَقَالَ مَهْ يَا خَالِدُ لَا تَسُبَّهَا فَوَالَّذِي نَفْسِي بِيَدِهِ لَقَدْ تَابَتْ تَوْبَةً لَوْ تَابَهَا صَاحِبُ مَكْسٍ لَغُفِرَ لَهُ فَأَمَرَ بِهَا فَصُلِّيَ عَلَيْهَا وَدُفِنَتْ",
            "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Basyir bin Al Muhajir] telah menceritakan kepadaku [Abdullah bin Buraidah] dari [Ayahnya] ia berkata; aku duduk di sisi Nabi shallallahu 'alaihi wasallam, tiba-tiba seorang wanita dari Bani Ghamid datang kepada beliau sambil berkata; \"Wahai Nabiyullah, sesungguhnya aku telah berzina, dan aku ingin membersihkan diri.\" Beliau bersabda kepadanya; \"Kembalilah.\" Dihari berikutnya, wanita itu datang lagi sambil mengaku telah berzina, katanya; \"Wahai Nabiyullah, sucikanlah diriku, sepertinya engaku hendak menolakku sebagaimana menolak (pengakuan) Ma'iz bin Malik, demi Allah, sesungguhnya diriku telah hamil (dari perzinahan tersebut).\" Maka Nabi shallallahu 'alaihi wasallam bersabda kepadanya: \"Kembalilah hingga engkau melahirkan.\" Setelah melahirkan, wanita itu datang membawa seorang bayi yang ia gendong dalam sepotong kain, wanita itu berkata; \"Wahai Nabiyullah, kini aku telah melahirkan.\" Beliau bersabda: \"Pergilah dan susui anak itu hingga kamu menyapihnya! \" Tatkala wanita itu selesai menyapih, ia datang dan di tangan anak tersebut terdapat potongan roti. Lalu ia berkata; \"Wahai Nabiyullah, sungguh aku telah menyapihnya.\" Lalu Nabi shallallahu 'alaihi wasallam memerintahkan agar anak tersebut diserahkan kepada seseorang dari kalangan muslimin, lalu beliau memerintahkan supaya wanita itu dibuatkan lubang, akhirnya ia diletakkan di dalam lubang tersebut hingga dada. Lalu beliau memerintahkan orang-orang agar melemparinya. Sesaat kemudian Khalid bin Al Walid datang dengan batu, lalu ia melempar kepala wanita tersebut hingga darah terpancar ke pelipis Khaid bin Al Walid, ia langsung mengumpatnya. Mendengar umpatan itu Nabi shallallahu 'alaihi wasallam bersabda: \"Tahanlah, wahai Khalid, janganlah engkau mengumpatnya. Demi Dzat yang jiwanya ada di tanganNya. Sungguh ia telah bertaubat dengan taubat yang seandainya pemungut pajak, memungut pajak tidak sesuai dengan syari'at (Islam), niscaya pemungut pajak akan mendapatkan ampunan.\" Kemudian beliau memerintahkan agar wanita tersebut dishalatkan dan dikubur."
        },
        {
            "number": 2222,
            "arab": " حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمُهَلَّبِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ أَنَّ امْرَأَةً مِنْ جُهَيْنَةَ أَتَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ حُبْلَى مِنْ الزِّنَا فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي أَصَبْتُ حَدًّا فَأَقِمْهُ عَلَيَّ فَدَعَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلِيَّهَا فَقَالَ اذْهَبْ فَأَحْسِنْ إِلَيْهَا فَإِذَا وَضَعَتْ حَمْلَهَا فَأْتِنِي بِهَا فَفَعَلَ فَأَمَرَ بِهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَشُكَّتْ عَلَيْهَا ثِيَابُهَا ثُمَّ أَمَرَ بِهَا فَرُجِمَتْ ثُمَّ صَلَّى عَلَيْهَا فَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ أَتُصَلِّي عَلَيْهَا وَقَدْ زَنَتْ فَقَالَ لَقَدْ تَابَتْ تَوْبَةً لَوْ قُسِمَتْ بَيْنَ سَبْعِينَ مِنْ أَهْلِ الْمَدِينَةِ لَوَسِعَتْهُمْ وَهَلْ وَجَدْتَ أَفْضَلَ مِنْ أَنْ جَادَتْ بِنَفْسِهَا لِلَّهِ عَزَّ وَجَلَّ",
            "id": "Telah menceritakan kepada kami [Wahb bin Jarir] telah menceritakan kepada kami [Hisyam] dari [Yahya] dari [Abu Qilabah] dari [Abu Al Muhallab] dari [Imran bin Hushain] bahwa seoerang wanita dari Juhainah datang kepada Nabi shallallahu 'alaihi wasallam dalam keadaan hamil karena berzina, dia berkata; \"Wahai Rasulullah, sesungguhnya aku telah melanggar hukum, oleh karena itu tegakkanlah hukuman kepadaku!.\" Rasulullah shallallahu 'alaihi wasallam memanggil walinya dan berkata: \"Pergilah dan uruslah dia dengan baik, apabila telah melahirkan, bawalah ia kepadaku.\" Walinya pun melakukan perintah beliau, setelah itu Rasulullah shallallahu 'alaihi wasallam memerintahkan supaya pakain wanita tersebut diikatkan ke badannya, beliau akhirnya memerintahkan agar wanita tersebut dirajam. Setelah itu beliau menshalatkan jenazah wanita tersebut, Umar berkata; \"Wahai Rasulullah, apakah engkau menshalatkannya, sementara dirinya telah berzina?\" Beliau bersabda: \"Sungguh dirinya telah bertaubat dengan taubat yang seandainya di bagikan diantara tujuh puluh penduduk Madinah, niscaya akan mencukupi mereka semua. Apakah engkau mendapatkan taubat yang lebih baik dari seseorang yang menyerahkan dirinya kepada Allah 'azza wajalla?.\""
        },
        {
            "number": 2223,
            "arab": " حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ وَأَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ الْأَمَةِ تَزْنِي وَلَمْ تُحْصَنْ فَقَالَ إِنْ زَنَتْ فَاجْلِدُوهَا ثُمَّ إِنْ زَنَتْ فَاجْلِدُوهَا ثُمَّ إِنْ زَنَتْ فَاجْلِدُوهَا قَالَ مَا أَدْرِي فِي الثَّالِثَةِ أَوْ فِي الرَّابِعَةِ فَبِيعُوهَا وَلَوْ بِضَفِيرٍ",
            "id": "Telah menceritakan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Ibnu Syihab] dari ['Ubaidullah bin Abdullah bin 'Utbah] dari [Zaid bin Khalid Al Juhani] serta [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam ditanya mengenai seorang budak wanita yang berzina dan belum menikah. Beliau bersabda; \"Apabila ia berzina, maka cambuklah dia, jika masih berzina, maka cambuklah dia, jika masih berzina, maka cambuklah dia.\" Abu Hurairah berkata; Aku tidak tahu beliau mengatakan yang ketiga kali atau keempat kalinya: \"Kemudian juallah dia walaupun hanya senilai tali pelana.\""
        },
        {
            "number": 2224,
            "arab": " أَخْبَرَنَا بِشْرُ بْنُ عُمَرَ الزَّهْرَانِيُّ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ حِطَّانَ بْنِ عَبْدِ اللَّهِ عَنْ عُبَادَةَ بْنِ الصَّامِتِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خُذُوا عَنِّي خُذُوا عَنِّي قَدْ جَعَلَ اللَّهُ لَهُنَّ سَبِيلًا الْبِكْرُ بِالْبِكْرِ وَالثَّيِّبُ بِالثَّيِّبِ الْبِكْرُ جَلْدُ مِائَةٍ وَنَفْيُ سَنَةٍ وَالثَّيِّبُ جَلْدُ مِائَةٍ وَالرَّجْمُ أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا هُشَيْمٌ عَنْ مَنْصُورٍ عَنْ الْحَسَنِ عَنْ حِطَّانَ بْنِ عَبْدِ اللَّهِ عَنْ عُبَادَةَ بْنِ الصَّامِتِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ",
            "id": "Telah mengabarkan kepada kami [Bisyr bin Umar Az Zahrani] telah menceritakan kepada kami [Hammad bin Salamah] dari [Qatadah] dari [Al Hasan] dari [Haththan bin Abdullah] dari ['Ubadah bin Ash Shamit] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ikutilah semua ajaranku, ikutilah semua ajaranku, sungguh Allah telah menetapkan hukuman bagi seorang wanita, hukuman bagi seorang perawan sesuai hukumannya bagi seorang perawan yaitu di cambuk seratus kali dan di asingkan selama setahun, sedangkan seseorang yang telah menikah, hukumannya juga sesuai dengan orang yang telah menikah yaitu di dera seratus kali dan di rajam.\" Telah mengabarkan kepada kami ['Amr bin 'Aun] telah mengabarkan kepada kami [Husyaim] dari [Manshur] dari [Al Hasan] dari [Hiththan bin Abdullah] dari ['Ubadah bin Ash Shamit] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas."
        },
        {
            "number": 2225,
            "arab": " أَخْبَرَنَا يَحْيَى بْنُ حَمَّادٍ حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ عَنْ قَتَادَةَ قَالَ كَتَبَ إِلَيَّ خَالِدُ بْنُ عُرْفُطَةَ عَنْ حَبِيبِ بْنِ سَالِمٍ أَنَّ غُلَامًا كَانَ يُنْبَزُ فُرْفُورًا فَوَقَعَ عَلَى جَارِيَةِ امْرَأَتِهِ فَرُفِعَ إِلَى النُّعْمَانِ بْنِ بَشِيرٍ فَقَالَ لَأَقْضِيَنَّ فِيهِ بِقَضَاءٍ شَافٍ إِنْ كَانَتْ أَحَلَّتْهَا لَهُ جَلَدْتُهُ مِائَةً وَإِنْ كَانَتْ لَمْ تُحِلَّهَا لَهُ رَجَمْتُهُ فَقِيلَ لَهَا زَوْجُكِ فَقَالَتْ إِنِّي قَدْ أَحْلَلْتُهَا لَهُ فَضَرَبَهُ مِائَةً قَالَ يَحْيَى هُوَ مَرْفُوعٌ حَدَّثَنَا صَدَقَةُ بْنُ الْفَضْلِ أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ عَنْ شُعْبَةَ عَنْ أَبِي بِشْرٍ عَنْ خَالِدِ بْنِ عُرْفُطَةَ عَنْ حَبِيبِ بْنِ سَالِمٍ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
            "id": "Telah mengabarkan kepada kami [Yahya bin Hammad] telah menceritakan kepada kami [Aban bin Yazid] dari [Qatadah] ia berkata; [Khalid bin 'Urfuthah] telah menulis surat kepadaku, dari [Habib bin Salim] bahwa seorang pemuda berjulukan Furfur telah menggauli budak wanita isterinya, Ketika hal itu dilaporkan kepada [An Nu'man bin Basyir], dia berkata; \"Sungguh aku akan memberikan keputusan mengenai pemuda tersebut dengan keputusan yang mencakup. Apabila isterinya telah menghalalkan budak tersebut untuknya, maka aku akan mencambuknya sebanyak seratus kali, dan apabila isterinya tidak menghalalkan budak tersebut untuknya, maka aku akan merajamnya.\" Lalu dikatakan kepada isterinya; \"Suamimu tergantung kepadamu.\" Isterinya berkata; \"Aku telah menghalalkan budak itu baginya.\" Kemudian An Nu'man mencambuknya seratus kali.\" Yahya berkata; \"Hadits tersebut marfu'.\" Telah menceritakan kepada kami [Shadaqah bin Al Fadhl] telah mengabarkan kepada kami [Muhammad bin Ja'far] dari [Syu'bah] dari [Abu Bisyr] dari [Khalid bin 'Urfuthah] dari [Habib bin Salim] dari [An Nu'man bin Basyir] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas."
        },
        {
            "number": 2226,
            "arab": " أَخْبَرَنَا مَرْوَانُ بْنُ مُحَمَّدٍ الدِّمَشْقِيُّ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ أُسَامَةَ بْنِ زَيْدٍ عَنْ مُحَمَّدِ بْنِ الْمُنَكْدِرِ عَنْ ابْنِ خُزَيْمَةَ بْنِ ثَابِتٍ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أُقِيمَ عَلَيْهِ حَدٌّ غُفِرَ لَهُ ذَلِكَ الذَّنْبُ",
            "id": "Telah mengabarkan kepada kami [Marwan bin Muhammad Ad Dimasyqi] telah menceritakan kepada kami [Ibnu Wahb] dari [Usamah bin Zaid] dari [Muhammad bin Al Munkadir] dari [Ibnu Khuzaimah bin Tsabit] dari [Ayahnya], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa dirinya dijatuhi hukuman terhadap (dosa yang ia perbuat), maka dosanya tersebut akan diampuni.\""
        }
    ]
}