{
    "kategori": "Kitab Talak",
    "hadits": [
        {
            "number": 2162,
            "arab": " أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّهُ طَلَّقَ امْرَأَتَهُ وَهِيَ حَائِضٌ فَذَكَرَ ذَلِكَ عُمَرُ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مُرْهُ أَنْ يُرَاجِعَهَا وَيُمْسِكَهَا حَتَّى تَطْهُرَ ثُمَّ تَحِيضَ ثُمَّ تَطْهُرَ ثُمَّ إِنْ شَاءَ أَمْسَكَ وَإِنْ شَاءَ طَلَّقَ قَبْلَ أَنْ يَمَسَّ فَتِلْكَ الْعِدَّةُ الَّتِي أَمَرَ اللَّهُ أَنْ يُطَلَّقَ لَهَا النِّسَاءُ",
            "id": "Telah mengabarkan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Nafi'] dari [Ibnu Umar] bahwa dia menceraikan isterinya ketika haid. Kemudian Umar memberitahukan hal itu kepada Nabi shallallahu 'alaihi wasallam, beliau berkata: \"Perintahkan supaya dia kembali, dan merujiknya hingga isterinya suci kemudian haid, kemudian suci, setelah itu jika berkehendak, maka dia boleh menahannya dan jika berkehendak, maka dia boleh mencerai sebelum menggaulinya. Itulah 'iddah yang Allah perintahkan agar wanita dicerai karenanya.\""
        },
        {
            "number": 2163,
            "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى أَخْبَرَنَا سُفْيَانُ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ قَالَ سَمِعْتُ سَالِمًا يَذْكُرُ عَنْ ابْنِ عُمَرَ أَنَّ عُمَرَ قَالَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ طَلَّقَ ابْنُ عُمَرَ امْرَأَتَهُ فَقَالَ مُرْهُ فَلْيُرَاجِعْهَا ثُمَّ لِيُطَلِّقْهَا وَهِيَ طَاهِرٌ قَالَ أَبُو مُحَمَّد رَوَاهُ ابْنُ الْمُبَارَكِ وَوَكِيعٌ أَوْ حَامِلٌ",
            "id": "Telah mengabarkan kepada kami ['Ubaidullah bin Musa] telah mengabarkan kepada kami [Sufyan] dari [Muhammad bin Abdurrahman] ia berkata; aku mendengar [Salim] menyebutkankan dari [Ibnu Umar] bahwa [Umar] berkata kepada Nabi shallallahu 'alaihi wasallam ketika Ibnu Umar menceraikan isterinya. Beliau bersabda: \"Perintahkan supaya dia kembali kepada isterinya, setelah itu dia boleh mencerainya ketika isterinya suci.\" Abu Muhammad berkata; [Ibnu Al Mubarak] serta [Waki'] meriwayatkan; \"Atau dalam keadaan hamil.\""
        },
        {
            "number": 2164,
            "arab": " حَدَّثَنَا إِسْمَعِيلُ بْنُ خَلِيلٍ وَإِسْمَعِيلُ بْنُ أَبَانَ قَالَا حَدَّثَنَا يَحْيَى بْنُ أَبِي زَائِدَةَ عَنْ صَالِحِ بْنِ صَالِحٍ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ عَنْ عُمَرَ قَالَ طَلَّقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَفْصَةَ ثُمَّ رَاجَعَهَا",
            "id": "Telah menceritakan kepada kami [Isma'il bin Khalil] dan [Isma'il bin Aban] keduanya berkata; telah menceritakan kepada kami [Yahya bin Abu Zaidah] dari [Shalih bin Shalih] dari [Salamah bin Kuhail] dari [Sa'id bin Jubair] dari [Ibnu Abbas] dari [Umar], ia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah mencerai Hafshah kemudian merujuknya.\""
        },
        {
            "number": 2165,
            "arab": " أَخْبَرَنَا سَعِيدُ بْنُ سُلَيْمَانَ عَنْ هُشَيْمٍ عَنْ حُمَيْدٍ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَلَّقَ حَفْصَةَ ثُمَّ رَاجَعَهَا قَالَ أَبُو مُحَمَّد كَأَنَّ عَلِيَّ بْنَ الْمَدِينِيِّ أَنْكَرَ هَذَا الْحَدِيثَ وَقَالَ لَيْسَ عِنْدَنَا هَذَا الْحَدِيثُ بِالْبَصْرَةِ عَنْ حُمَيْدٍ",
            "id": "Telah mengabarkan kepada kami [Sa'id bin Sulaiman] dari [Husyaim] dari [Humaid] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam pernah mencerai Hafshah kemudian merujuknya.\" Abu Muhammad berkata; \"Seolah-olah Ali bin Al Madini mengingkari hadits ini dan berkata; \"Kami tidak memiliki hadits ini di Bashrah (yang diriwayatkan) dari Humaid.\""
        },
        {
            "number": 2166,
            "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ مُوسَى حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ حَدَّثَنِي الزُّهْرِيُّ عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ الْحَكَمُ قَالَ لِي يَحْيَى بْنُ حَمْزَةَ أَفْصِلُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ إِلَى أَهْلِ الْيَمَنِ أَنْ لَا يَمَسَّ الْقُرْآنَ إِلَّا طَاهِرٌ وَلَا طَلَاقَ قَبْلَ إِمْلَاكٍ وَلَا عَتَاقَ حَتَّى يَبْتَاعَ قِيلَ لِأَبِي مُحَمَّدٍ مَنْ سُلَيْمَانُ قَالَ أَحْسَبُ كَاتِبًا مِنْ كُتَّابِ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ",
            "id": "Telah menghabarkan kepada kami [Al Hakam bin Musa] telah menceritakan kepada kami [Yahya bin Hamzah] dari [Sulaiman bin Daud] telah menceritakan kepadaku [Az Zuhri] dari [Abu Bakr bin Muhammad bin 'Amr bin Hazm] dari [Ayahnya] dari [Kakeknya] ia berkata; [Al Hakam] berkata; [Yahya bin Hamzah] berkata kepadaku; \"Aku menerangkan bahwa Rasulullah shallallahu 'alaihi wasallam telah menulis surat kepada penduduk Yaman bahwa tidak boleh menyentuh Al Qur'an kecuali orang yang suci, tidak boleh mencerai sebelum menikah dan tidak dapat membebaskan kecuali setelah membeli.\" Abu Muhammad ditanya; \"Siapakah Sulaiman itu?\" Dia menjawab; \"Aku kira ia adalah sekretaris diantara sekretaris Umar bin Abdul Aziz.\""
        },
        {
            "number": 2167,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا ابْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ قَالَ سَمِعْتُ عُرْوَةَ بْنَ الزُّبَيْرِ عَنْ عَائِشَةَ قَالَتْ جَاءَتْ امْرَأَةُ رِفَاعَةَ الْقُرَظِيِّ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعِنْدَهُ أَبُو بَكْرٍ وَخَالِدُ بْنُ سَعِيدِ بْنِ الْعَاصِ عَلَى الْبَابِ يَنْتَظِرُ أَنْ يُؤْذَنَ لَهُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي كُنْتُ عِنْدَ رِفَاعَةَ فَطَلَّقَنِي فَبَتَّ طَلَاقِي قَالَ أَتُرِيدِينَ أَنْ تَرْجِعِي إِلَى رِفَاعَةَ لَا حَتَّى يَذُوقَ عُسَيْلَتَكِ وَتَذُوقِي عُسَيْلَتَهُ فَنَادَى خَالِدُ بْنُ سَعِيدٍ أَبَا بَكْرٍ أَلَا تَرَى مَا تَجْهَرُ بِهِ هَذِهِ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Ibnu 'Uyainah] dari [Az Zuhri] ia berkata; aku mendengar ['Urwah bin Az Zubair] dari ['Aisyah] ia berkata; isteri Rifa'ah Al Qurazhi datang kepada Rasulullah shallallahu 'alaihi wasallam, sedangkan Abu Bakr berada di sisi beliau, sementara Khalid bin Sa'id bin Al 'Ash berada di depan pintu, menunggu hingga di izinkan untuk menemui Rasulullah shallallahu 'alaihi wasallam, kemudian isteri Rifa'ah berkata; \"Wahai Rasulullah, sesungguhnya dahulu aku hidup bersama Rifa'ah, kemudian ia menceraiku dengan talak tiga. Beliau bersabda: \"Apakah engkau ingin kembali kepada Rifa'ah? Tidak boleh, hingga ia (suami yang baru) mencicipi madumu dan engkau mencicipi madunya.\" Kemudian Khalid bin Sa'id memanggil Abu Bakr, ia berkata; \"Tidakkah engkau melihat wanita ini berkata kasar di sisi Rasulullah shallallahu 'alaihi wasallam?.\""
        },
        {
            "number": 2168,
            "arab": " حَدَّثَنَا فَرْوَةُ بْنُ أَبِي الْمَغْرَاءِ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ طَلَّقَ رِفَاعَةُ رَجُلٌ مِنْ بَنِي قُرَيْظَةَ امْرَأَتَهُ فَتَزَوَّجَهَا عَبْدُ الرَّحْمَنِ بْنُ الزُّبَيْرِ فَدَخَلَتْ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ يَا رَسُولَ اللَّهِ وَاللَّهِ إِنْ مَعَهُ إِلَّا مِثْلُ هُدْبَتِي هَذِهِ فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَلَّكِ تُرِيدِينَ أَنْ تَرْجِعِي إِلَى رِفَاعَةَ لَا حَتَّى يَذُوقَ عُسَيْلَتَكِ أَوْ قَالَ تَذُوقِي عُسَيْلَتَهُ",
            "id": "Telah menceritakan kepada kami [Farwah bin Abu Al Maghra`] telah menceritakan kepada kami [Ali bin Mushir] dari [Hisyam bin 'Urwah] dari [Ayahnya] dari ['Aisyah], ia berkata; Rifa'ah seorang laki-laki dari Bani Quraizhah telah mencerai isterinya, kemudian Abdurrahman bin Az Zubair menikahi mantan isteri Rifa'ah, lalu wanita (mantan isteri Rifa'ah) menemui Rasulullah shallallahu 'alaihi wasallam dan berkata; \"Wahai Rasulullah, ia (Abdurrahman bin Zubair) tidak memiliki kemampuan kecuali seperti ujung kainku ini.\" Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Kemungkinan engkau ingin kembali kepada Rifa'ah. Tidak, hingga ia merasakan madumu atau engkau merasakan madunya.\""
        },
        {
            "number": 2169,
            "arab": " أَخْبَرَنَا يَعْلَى حَدَّثَنَا إِسْمَعِيلُ بْنُ أَبِي خَالِدٍ عَنْ الشَّعْبِيِّ عَنْ مَسْرُوقٍ قَالَ سَأَلْتُ عَائِشَةَ عَنْ الْخِيَرَةِ فَقَالَتْ قَدْ خَيَّرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفَكَانَ طَلَاقًا",
            "id": "Telah mengabarkan kepada kami [Ya'la] telah menceritakan kepada kami [Isma'il bin Abu Khalid] dari [Asy Sya'bi] dari [Masruq] ia berkata; aku bertanya kepada ['Aisyah] mengenai khiyarah, 'Aisyah menjawab; \"Rasulullah shallallahu 'alaihi wasallam telah memberikan pilihan kepada kami, namun hal itu tidak dianggap sebagai bentuk talak.\" "
        },
        {
            "number": 2170,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ الْفَضْلِ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي أَسْمَاءَ عَنْ ثَوْبَانَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّمَا امْرَأَةٍ سَأَلَتْ زَوْجَهَا الطَّلَاقَ مِنْ غَيْرِ بَأْسٍ فَحَرَامٌ عَلَيْهَا رَائِحَةُ الْجَنَّةِ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Al Fadhl] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Abu Qilabah] dari [Abu Asma`] dari [Tsauban], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapapun wanita yang meminta cerai suaminya, bukan karena sesuatu yang menyusahkan, maka haram baginya bau Surga.\""
        },
        {
            "number": 2171,
            "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا يَحْيَى هُوَ ابْنُ سَعِيدٍ أَنَّ عَمْرَةَ أَخْبَرَتْهُ أَنَّ حَبِيبَةَ بِنْتَ سَهْلٍ تَزَوَّجَهَا ثَابِتُ بْنُ قَيْسِ بْنِ شَمَّاسٍ فَذَكَرَتْ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ هَمَّ أَنْ يَتَزَوَّجَهَا وَكَانَتْ جَارَةً لَهُ وَأَنَّ ثَابِتًا ضَرَبَهَا فَأَصْبَحَتْ عَلَى بَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْغَلَسِ وَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ فَرَأَى إِنْسَانًا فَقَالَ مَنْ هَذَا قَالَتْ أَنَا حَبِيبَةُ بِنْتُ سَهْلٍ فَقَالَ مَا شَأْنُكِ قَالَتْ لَا أَنَا وَلَا ثَابِتٌ فَأَتَى ثَابِتٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهُ رَسُولُ اللَّهِ خُذْ مِنْهَا وَخَلِّ سَبِيلَهَا فَقَالَتْ يَا رَسُولَ اللَّهِ عِنْدِي كُلُّ شَيْءٍ أَعْطَانِيهِ فَأَخَذَ مِنْهَا وَقَعَدَتْ عِنْدَ أَهْلِهَا",
            "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Yahya yaitu Ibnu Sa'id] bahwa ['Amrah] telah menceritakan bahwa [Habibah binti Sahl] telah dinikahi Tsabit bin Qais bin Syammas, kemudian ia menyebutkan bahwa Rasulullah shallallahu 'alaihi wasallam dahulu berkeinginan untuk menikahinya, dia adalah tetangga beliau. Suatu ketika Tsabit memukulnya, dan di waktu fajar, ia berada di depan pintu Rasulullah shallallahu 'alaihi wasallam dalam kegelapan, Ketika Rasulullah shallallahu 'alaihi wasallam keluar dan melihat ada seseorang, beliau bersabda bersabda; \"Siapakah ini?\" Habibah menjawab; \"Aku Habibah binti Sahl.\" Beliau bersabda; \"Apa keperluanmu?, \" Habibah berkata; \"Tidak mungkin aku dan Tsabit berkumpul.\" Kemudian Tsabit datang kepada Rasulullah shallallahu 'alaihi wasallam, lalu Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Ambillah dari isterimu dan lepaskanlah dia.\" Habibah berkata; \"Wahai Rasulullah, segala yang ia berikan, ada padaku.\" Kemudian Tsabit mengambil darinya, lalu Habibah tinggal bersama keluarganya.\""
        },
        {
            "number": 2172,
            "arab": " حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ عَنْ الزُّبَيْرِ بْنِ سَعِيدٍ رَجُلٍ مِنْ بَنِي عَبْدِ الْمُطَّلِبِ قَالَ بَلَغَنِي حَدِيثٌ عَنْ عَبْدِ اللَّهِ بْنِ عَلِيِّ بْنِ يَزِيدَ بْنِ رُكَانَةَ وَهُوَ فِي قَرْيَةٍ لَهُ فَأَتَيْتُهُ فَسَأَلْتُهُ فَقَالَ حَدَّثَنِي أَبِي عَنْ جَدِّي أَنَّهُ طَلَّقَ امْرَأَتَهُ الْبَتَّةَ فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ فَقَالَ مَا أَرَدْتَ فَقَالَ وَاحِدَةً قَالَ آللَّهِ قَالَ آللَّهِ قَالَ هُوَ مَا نَوَيْتَ",
            "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Jarir bin Hazim] dari [Az Zubair bin Sa'id] seorang laki-laki dari Bani Abdul Muththalib, ia berkata; [telah sampai kepadaku] suatu hadits dari [Abdullah bin Ali bin Yazid bin Rukanah] sementara dirinya berada di desanya, kemudian aku datang kepadanya, ia pun berkata; telah menceritakan kepadaku [Ayahku] dari [kakekku] bahwa ia telah menceraikan isterinya sama sekali (talak tiga), kemudian dia datang kepada Nabi shallallahu 'alaihi wasallam dan menceritakan hal itu. Beliau lalu bertanya: \"Apa yang engkau inginkan?\" dia berkata; \"Cerai satu kali.\" Beliau bersabda: \"Demi Allah?\" Ia berkata; \"Demi Allah.\" Beliau berkata: \"Hal itu seperti apa yang engkau niatkan.\""
        },
        {
            "number": 2173,
            "arab": " حَدَّثَنَا زَكَرِيَّا بْنُ عَدِيٍّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ سَلَمَةَ بْنِ صَخْرٍ الْبَيَاضِيِّ قَالَ كُنْتُ امْرَأً أُصِيبُ مِنْ النِّسَاءِ مَا لَا يُصِيبُ غَيْرِي فَلَمَّا دَخَلَ شَهْرُ رَمَضَانَ خِفْتُ أَنْ أُصِيبَ فِي لَيْلِي شَيْئًا فَيَتَتَابَعَ بِي ذَلِكَ إِلَى أَنْ أُصْبِحَ قَالَ فَتَظَاهَرْتُ إِلَى أَنْ يَنْسَلِخَ فَبَيْنَا هِيَ لَيْلَةً تَخْدُمُنِي إِذْ تَكَشَّفَ لِي مِنْهَا شَيْءٌ فَمَا لَبِثْتُ أَنْ نَزَوْتُ عَلَيْهَا فَلَمَّا أَصْبَحْتُ خَرَجْتُ إِلَى قَوْمِي فَأَخْبَرْتُهُمْ وَقُلْتُ امْشُوا مَعِي إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا لَا وَاللَّهِ لَا نَمْشِي مَعَكَ مَا نَأْمَنُ أَنْ يَنْزِلَ فِيكَ الْقُرْآنُ أَوْ أَنْ يَكُونَ فِيكَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَقَالَةٌ يَلْزَمُنَا عَارُهَا وَلَنُسْلِمَنَّكَ بِجَرِيرَتِكَ فَانْطَلَقْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَصَصْتُ عَلَيْهِ خَبَرِي فَقَالَ يَا سَلَمَةُ أَنْتَ بِذَاكَ قُلْتُ أَنَا بِذَاكَ قَالَ يَا سَلَمَةُ أَنْتَ بِذَاكَ قُلْتُ أَنَا بِذَاكَ قَالَ يَا سَلَمَةُ أَنْتَ بِذَاكَ قُلْتُ أَنَا بِذَاكَ وَهَا أَنَا صَابِرٌ نَفْسِي فَاحْكُمْ فِيَّ مَا أَرَاكَ اللَّهُ قَالَ فَأَعْتِقْ رَقَبَةً قَالَ فَضَرَبْتُ صَفْحَةَ رَقَبَتِي فَقُلْتُ وَالَّذِي بَعَثَكَ بِالْحَقِّ مَا أَصْبَحْتُ أَمْلِكُ رَقَبَةً غَيْرَهَا قَالَ فَصُمْ شَهْرَيْنِ مُتَتَابِعَيْنِ قُلْتُ وَهَلْ أَصَابَنِي الَّذِي أَصَابَنِي إِلَّا فِي الصِّيَامِ قَالَ فَأَطْعِمْ وَسْقًا مِنْ تَمْرٍ سِتِّينَ مِسْكِينًا فَقُلْتُ وَالَّذِي بَعَثَكَ بِالْحَقِّ لَقَدْ بِتْنَا لَيْلَتَنَا وَحْشَى مَا لَنَا طَعَامٌ قَالَ فَانْطَلِقْ إِلَى صَاحِبِ صَدَقَةِ بَنِي زُرَيْقٍ فَلْيَدْفَعْهَا إِلَيْكَ وَأَطْعِمْ سِتِّينَ مِسْكِينًا وَسْقًا مِنْ تَمْرٍ وَكُلْ بَقِيَّتَهُ أَنْتَ وَعِيَالُكَ قَالَ فَأَتَيْتُ قَوْمِي فَقُلْتُ وَجَدْتُ عِنْدَكُمْ الضِّيقَ وَسُوءَ الرَّأْيِ وَوَجَدْتُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ السَّعَةَ وَحُسْنَ الرَّأْيِ وَقَدْ أَمَرَ لِي بِصَدَقَتِكُمْ",
            "id": "Telah menceritakan kepada kami [Zakariya bin 'Adi] telah menceritakan kepada kami [Abdullah bin Idris] dari [Muhammad bin Ishaq] dari [Muhammad bin 'Amr] dari [Sulaiman bin Yasar] dari [Salamah bin Shakhr Al Bayadhi] ia berkata; \"Aku dahulu adalah orang yang sering menggauli isteri tidak seperti orang lain yang menggauli isterinya. Tatkala masuk Bulan Ramadhan, aku sedikit khawatir melakukan jima' pada malam hariku, sehingga hal itu berlanjut hingga pagi hari. Maka aku menzhihar isteriku hingga berlalunya bulan Ramadhan. Pada dustu malam, ia membantuku, tiba-tiba tersingkap sesuatu darinya, tidak lama kemudian aku pun menggaulinya. Pada pagi harinya, aku keluar menuju kepada kaumku dan mengabarkan hal itu kepada mereka, aku berkata; \"Pergilah kalian bersamaku menemui Rasulullah shallallahu 'alaihi wasallam! \" Mereka mengatakan; \"Tidak, demi Allah, kami tidak akan pergi bersamamu. Kami khawatir turun Al Qur'an mengenai dirimu atau terdapat perkataan Rasulullah shallallahu 'alaihi wasallam mengenai dirimu yang aibnya mengenai kami. Sungguh kami menyerahkanmu dengan dosamu sendiri.\" Akhirnya aku pergi menemui Rasulullah shallallahu 'alaihi wasallam dan menceritakan kepada beliau berita mengenaiku. Beliau bersabda: \"Wahai Salamah, apakah engkau melakukan hal ini?\" Aku berkata; \"Aku telah melakukan hal ini.\" Beliau bersabda: \"Wahai Salamah, apakah engkau melakukan hal ini?\" aku menjawab; \"Aku telah melakukan hal ini.\" Beliau bersabda: \"Wahai Salamah, apakah engkau melakukan hal ini?\" Aku menjawab; \"Aku telah melakukan hal ini. Inilah aku yang telah bersabar terhadap diriku, maka putuskanlah terhadap diriku apa yang telah Allah perlihatkan kepada dirimu.\" Beliau bersabda: \"Bebaskanlah budak.\" Salamah berkata; \"Aku menepuk leher belakangku dan berkata; \"Demi Dzat yang mengutusmu dengan kebenaran, tidaklah aku dipagi hari memiliki budak selain dirinya.\" Beliau bersabda: \"Berpuasalah dua bulan berturut-turut! \" Aku berkata; \"Tidaklah aku tertimpa sesuatu yang menimpaku, kecuali ketika aku berpuasa.\" Beliau bersabda: \"Berilah makan satu wasaq kurma enam puluh orang miskin.\" Lalu aku berkata; \"Demi Dzat yang mengutusmu dengan kebenaran, sungguh kami bermalam dalam keadaan tidak memiliki makanan.\" Beliau bersabda: \"Pergilah kepada penjaga Shadaqah Bani Zuraiq, hendaknya ia memberikan kepadamu dan berilah makan enam puluh orang miskin satu wasaq kurma, dan makanlah sisanya bersama keluargamu.\" Salamah berkata; \"Kemudian aku mendatangi kaumku dan berkata; \"Aku dapatkan di sisi kalian kesempitan serta pendapat yang buruk, dan aku dapatkan di sisi Rasulullah shallallahu 'alaihi wasallam kelapangan dan pendapat yang baik, beliau telah memerintahkan agar aku diberi shadaqah kalian.\""
        },
        {
            "number": 2174,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ الشَّعْبِيِّ عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ أَنَّ زَوْجَهَا طَلَّقَهَا ثَلَاثًا فَلَمْ يَجْعَلْ لَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَفَقَةً وَلَا سُكْنَى قَالَ سَلَمَةُ فَذَكَرْتُ ذَلِكَ لِإِبْرَاهِيمَ فَقَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِ لَا نَدَعُ كِتَابَ رَبِّنَا وَسُنَّةَ نَبِيِّهِ بِقَوْلِ امْرَأَةٍ فَجَعَلَ لَهَا السُّكْنَى وَالنَّفَقَةَ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Salamah bin Kuhail] dari [Asy Sya'bi] dari [Fathimah binti Qais] bahwa suaminya telah mencerainya tiga kali dan Nabi shallallahu 'alaihi wasallam tidak memberikan nafkah untuknya dan tidak pula tempat tinggal.\" Salamah berkata; \"Kemudian aku sebutkan hal itu kepada Ibrahim. Dia berkata; \"Umar bin Al Khathab berkata; \"Kami tidak akan meninggalkan Kitab Rabb kami dan Sunnah Nabi kami karena perkataan seorang wanita. Dan ia tetap (berkewajiban) memberikan tempat tinggal dan nafkah.\""
        },
        {
            "number": 2175,
            "arab": " أَخْبَرَنَا يَعْلَى حَدَّثَنَا زَكَرِيَّا عَنْ عَامِرٍ حَدَّثَتْنِي فَاطِمَةُ بِنْتُ قَيْسٍ أَنَّ زَوْجَهَا طَلَّقَهَا ثَلَاثًا فَأَمَرَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تَعْتَدَّ عِنْدَ ابْنِ عَمِّهَا ابْنِ أُمِّ مَكْتُومٍ",
            "id": "Telah mengabarkan kepada kami [Ya'la] telah menceritakan kepada kami [Zakariya] dari [Amir] telah menceritakan kepadaku [Fathimah binti Qais] bahwa suaminya telah menceraikannya tiga kali, kemudian Nabi shallallahu 'alaihi wasallam memerintahakannya agar ber'iddah di rumah Ibnu Ummi Maktum."
        },
        {
            "number": 2176,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ الْأَشْعَثِ عَنْ الْحَكَمِ وَحَمَّادٍ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عُمَرَ قَالَ لَا نَدَعُ كِتَابَ رَبِّنَا وَسُنَّةَ نَبِيِّهِ بِقَوْلِ امْرَأَةٍ الْمُطَلَّقَةُ ثَلَاثًا لَهَا السُّكْنَى وَالنَّفَقَةُ أَخْبَرَنَا طَلْقُ بْنُ غَنَّامٍ عَنْ حَفْصِ بْنِ غِيَاثٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عُمَرَ نَحْوَهُ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Al 'Ala`] telah menceritakan kepada kami [Hafsh bin Ghiyats] dari [Al Asy'ats] dari [Al Hakam] serta [Hammad] dari [Ibrahim] dari [Al Aswad] dari [Umar], ia berkata; \"Kami tidak akan meninggalkan Kitab Rabb kami dan Sunnah NabiNya Karena perkataan seorang wanita. Wanita yang dicerai tiga kali, baginya mendapatkan tempat tinggal dan nafkah.\" Telah mengabarkan kepada kami [Thalq bin Ghannam] dari [Hafsh bin Ghiyats] dari [Al A'masy] dari [Ibrahim] dari [Al Aswad] dari [Umar] seperti hadits di atas."
        },
        {
            "number": 2177,
            "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا حَفْصٌ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ قَالَ قَالَ عُمَرُ لَا نُجِيزُ قَوْلَ امْرَأَةٍ فِي دِينِ اللَّهِ الْمُطَلَّقَةُ ثَلَاثًا لَهَا السُّكْنَى وَالنَّفَقَةُ قَالَ أَبُو مُحَمَّد لَا أَرَى السُّكْنَى وَالنَّفَقَةَ لِلْمُطَلَّقَةِ",
            "id": "Telah mengabarkan kepada kami [Abdullah bin Muhammad], ia berkata; telah menceritakan kepada kami [Hafsh] dari [Al A'masy] dari [Ibrahim] dari [Al Aswad] Ia berkata; [Umar] berkata; \"Kami tidak memperkenankan perkataan seorang wanita dalam agama Allah. Wanita yang dicerai tiga kali, baginya mendapatkan tempat tinggal dan nafkah.\" Abu Muhammad berkata; \"Aku tidak berpendapat tempat tinggal dan nafkah untuk wanita yang dicerai.\""
        },
        {
            "number": 2178,
            "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ أَنَّ سُلَيْمَانَ بْنَ يَسَارٍ أَخْبَرَهُ أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ أَخْبَرَهُ أَنَّهُ اجْتَمَعَ هُوَ وَابْنُ عَبَّاسٍ عِنْدَ أَبِي هُرَيْرَةَ فَذَكَرُوا الرَّجُلَ يُتَوَفَّى عَنْ الْمَرْأَةِ فَتَلِدُ بَعْدَهُ بِلَيَالٍ قَلَائِلَ فَقَالَ ابْنُ عَبَّاسٍ حِلُّهَا آخِرُ الْأَجَلَيْنِ وَقَالَ أَبُو سَلَمَةَ إِذَا وَضَعَتْ فَقَدْ حَلَّتْ فَتَرَاجَعَا فِي ذَلِكَ بَيْنَهُمَا فَقَالَ أَبُو هُرَيْرَةَ أَنَا مَعَ ابْنِ أَخِي يَعْنِي أَبَا سَلَمَةَ فَبَعَثُوا كُرَيْبًا مَوْلَى ابْنِ عَبَّاسٍ إِلَى أُمِّ سَلَمَةَ فَسَأَلَهَا فَذَكَرَتْ أُمُّ سَلَمَةَ أَنَّ سُبَيْعَةَ بِنْتَ الْحَارِثِ الْأَسْلَمِيَّةَ مَاتَ عَنْهَا زَوْجُهَا فَنَفِسَتْ بَعْدَهُ بِلَيَالٍ وَأَنَّ رَجُلًا مِنْ بَنِي عَبْدِ الدَّارِ يُكْنَى أَبَا السَّنَابِلِ خَطَبَهَا وَأَخْبَرَهَا أَنَّهَا قَدْ حَلَّتْ فَأَرَادَتْ أَنْ تَتَزَوَّجَ غَيْرَهُ فَقَالَ لَهَا أَبُو السَّنَابِلِ فَإِنَّكِ لَمْ تَحِلِّينَ فَذَكَرَتْ سُبَيْعَةُ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَهَا أَنْ تَتَزَوَّجَ",
            "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Yahya bin Sa'id] bahwa [Sulaiman bin Yasar] telah mengabarkan kepadanya, bahwa [Abu Salamah bin Abdurrahman] telah mengabarkan kepadanya, bahwa ia dan [Ibnu Abbas] berkumpul di sisi [Abu Hurairah], kemudian mereka menyebutkan seorang laki-laki mati meninggalkan seorang isteri, beberapa malam setelahnya, isterinya melahirkan. Ibnu Abbas berkata; \"Kehalalannya adalah yang paling akhir diantara dua waktu.\" Sementara Abu Salamah berkata; \"Apabila ia melahirkan, maka ia telah halal.\" Dalam hal, mereka berdua saling mendiskusikan. Abu Hurairah berkata; (Dalam masalah ini) aku sependapat dengan anak saudaraku yaitu Abu Salamah.\" Kemudian mereka mengutus [Kuraib] mantan budak Ibnu Abbas kepada Ummu Salamah, lalu ia bertanya kepadanya. [Ummu Salamah] menyebutkan bahwa Subai'ah binti Al Harits Al Aslamiyah ditinggal mati suaminya. Kemudian ia menjalani nifas beberapa malam setelahnya, lalu seorang laki-laki dari Bani Abdud Dar yang dijuluki Abu As Sanabil meminangnya dan mengabarkan kepadanya bahwa ia telah halal. Ternyata Subai'ah ingin menikah dengan selain Abu As Sanabil, Abu As Sanabil berkata kepadanya; \"Sesungguhnya engkau belum halal.\" Kemudian Subai'ah menceritakan hal itu kepada Rasulullah shallallahu 'alaihi wasallam, maka beliau memerintahkannya supaya menikah.\""
        },
        {
            "number": 2179,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ كُرَيْبٍ عَنْ أُمِّ سَلَمَةَ قَالَتْ تُوُفِّيَ زَوْجُ سُبَيْعَةَ بِنْتِ الْحَارِثِ فَوَضَعَتْ بَعْدَ وَفَاةِ زَوْجِهَا بِأَيَّامٍ فَأَمَرَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تَتَزَوَّجَ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Yahya bin Sa'id] dari [Sulaiman bin Yasar] dari [Kuraib] dari [Ummu Salamah], ia berkata; \"Suami Subai'ah binti Al Harits telah meninggal, selang beberapa malam setelah suaminya meninggal, ia melahirkan, maka Rasulullah shallallahu 'alaihi wasallam memerintahkannya supaya menikah.\""
        },
        {
            "number": 2180,
            "arab": " أَخْبَرَنَا بِشْرُ بْنُ عُمَرَ الزَّهْرَانِيُّ حَدَّثَنَا أَبُو الْأَحْوَصِ حَدَّثَنَا مَنْصُورٌ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ أَبِي السَّنَابِلِ قَالَ وَضَعَتْ سُبَيْعَةُ بِنْتُ الْحَارِثِ حَمْلَهَا بَعْدَ وَفَاةِ زَوْجِهَا بِبِضْعٍ وَعِشْرِينَ لَيْلَةً فَلَمَّا تَعَلَّتْ مِنْ نِفَاسِهَا تَشَوَّفَتْ فَعِيبَ ذَلِكَ عَلَيْهَا فَذُكِرَ أَمْرُهَا لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنْ تَفْعَلْ فَقَدْ انْقَضَى أَجَلُهَا",
            "id": "Telah mengabarkan kepada kami [Bisyr bin Umar Az Zahrani] telah menceritakan kepada kami [Abu Al Ahwash] telah menceritakan kepada kami [Manshur] dari [Ibrahim] dari [Al Aswad] dari [Abu As Sanabil] ia berkata; \"Subai'ah binti Al Harits telah melahirkan dua puluh tiga malam setelah suaminya meninggal. Tatkala ia telah suci dari nifasnya, ia menghias diri. Ternyata dirinya dicela karena hal itu, ketika perkaranya diberitahukan kepada Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila ia melakukan, maka sungguh telah selesai masa (iddah) nya.\""
        },
        {
            "number": 2181,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ أَنَّ سُبَيْعَةَ وَضَعَتْ بَعْدَ وَفَاةِ زَوْجِهَا بِأَيَّامٍ فَتَشَوَّفَتْ فَعَابَ أَبُو السَّنَابِلِ فَسَأَلَتْ أَوْ ذَكَرَتْ أَمْرَهَا لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَهَا أَنْ تَتَزَوَّجَ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Sufyan] dari [Manshur] dari [Ibrahim] dari [Al Aswad] bahwa Subai'ah telah melahirkan beberapa hari setelah suaminya wafat. Kemudian dirinya berhias, ternyata dirinya dicela oleh Abu As Sanabil. Lantas Suba'iah mengadukan atau menyebutkan perkaranya kepada Rasulullah shallallahu 'alaihi wasallam, ternyata beliau memerintahkannya supaya menikah lagi."
        },
        {
            "number": 2182,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُلَيْمَانُ بْنُ كَثِيرٍ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَوْ تُؤْمِنُ بِاللَّهِ أَنْ تَحِدَّ عَلَى أَحَدٍ فَوْقَ ثَلَاثَةِ أَيَّامٍ إِلَّا عَلَى زَوْجِهَا",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Katsir] telah mengabarkan kepada kami [Sulaiman bin Katsir] dari [Az Zuhri] dari ['Urwah] dari ['Aisyah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak halal bagi seorang wanita yang beriman kepada Allah dan hari Akhir atau beriman kepada Allah, berkabung kepada seseorang di atas tiga hari kecuali terhadap suaminya.\""
        },
        {
            "number": 2183,
            "arab": " أَخْبَرَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا شُعْبَةُ عَنْ حُمَيْدِ بْنِ نَافِعٍ قَالَ سَمِعْتُ زَيْنَبَ بِنْتَ أَبِي سَلَمَةَ تُحَدِّثُ عَنْ أُمِّ حَبِيبَةَ بِنْتِ أَبِي سُفْيَانَ أَنَّ أَخًا لَهَا مَاتَ أَوْ حَمِيمًا لَهَا فَعَمَدَتْ إِلَى صُفْرَةٍ فَجَعَلَتْ تَمْسَحُ يَدَيْهَا وَقَالَتْ إِنَّمَا أَفْعَلُ هَذَا لِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَنْ تَحِدَّ فَوْقَ ثَلَاثٍ إِلَّا عَلَى زَوْجِهَا فَإِنَّهَا تَحِدُّ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا أَخْبَرَنَا هَاشِمُ بْنُ الْقَاسِمِ أَخْبَرَنَا شُعْبَةُ عَنْ حُمَيْدِ بْنِ نَافِعٍ قَالَ سَمِعْتُ زَيْنَبَ بِنْتَ أُمِّ سَلَمَةَ تُحَدِّثُ عَنْ أُمِّهَا أَوْ امْرَأَةٍ مِنْ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
            "id": "Telah mengabarkan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami [Syu'bah] dari [Humaid bin Nafi'], ia berkata; aku mendengar [Zainab binti Abu Salamah] menceritakan dari [Ummu Habibah binti Abu Sufyan] bahwa saudaranya -atau sahabatnya, - kemudian ia mengambil minyak wangi berwarna kuning dan mengusapkan ke kedua tangannya, dia berkata; \"Sesungguhnya aku melakukan hal ini karena Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak halal bagi seorang wanita yang beriman kepada Allah dan hari Akhir untuk berkabung melebihi tiga hari, kecuali terhadap suaminya, maka ia berkabung empat bulan sepuluh hari.\" Telah mengabarkan kepada kami [Syu'bah] dari [Humaid bin Nafi'], ia berkata; aku mendengar [Zainab binti Ummu Salamah] menceritakan dari [ibunya] dari para isteri Nabi shallallahu 'alaihi wasallam seperti itu.\""
        },
        {
            "number": 2184,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا زَائِدَةُ عَنْ هِشَامِ بْنِ حَسَّانَ عَنْ حَفْصَةَ بِنْتِ سِيرِينَ عَنْ أُمِّ عَطِيَّةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَحِدُّ الْمَرْأَةُ فَوْقَ ثَلَاثَةِ أَيَّامٍ إِلَّا عَلَى زَوْجٍ فَإِنَّهَا تَحِدُّ عَلَيْهِ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا لَا تَلْبَسُ ثَوْبًا مَصْبُوغًا إِلَّا ثَوْبَ عَصْبٍ وَلَا تَكْتَحِلُ وَلَا تَمَسُّ طِيبًا إِلَّا فِي أَدْنَى طُهْرِهَا إِذَا اغْتَسَلَتْ مِنْ مَحِيضِهَا نُبْذَةً مِنْ كُسْتٍ وَأَظْفَارٍ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Zaidah] dari [Hisyam bin Hassan] dari [Hafshah binti Sirin] dari [Ummu 'Athiyah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Tidak boleh seorang wanita berkabung melebihi tiga hari, kecuali terhadap suaminya, maka ia berkabung selama empat bulan sepuluh hari, dan tidak boleh menggunkan pakaian yang berwarna warni, melainkan hanya memakai pakaian yang kasar (kain beludru), dan tidak boleh menggunakan celak mata, dan tidak boleh memakai wewangian kecuali jika masa iddahnya telah habis, maka diperbolehkan baginya memakai qusth dan adzfar (sejenis pohon yang harum baunya).\""
        },
        {
            "number": 2185,
            "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ حَدَّثَنَا مَالِكٌ عَنْ سَعْدِ بْنِ إِسْحَقَ بْنِ كَعْبِ بْنِ عُجْرَةَ عَنْ عَمَّتِهِ زَيْنَبَ بِنْتِ كَعْبِ بْنِ عُجْرَةَ أَنَّ الْفُرَيْعَةَ بِنْتَ مَالِكٍ أَخْبَرَتْهَا أَنَّهَا سَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَأْذَنَ لَهَا أَنْ تَرْجِعَ إِلَى أَهْلِهَا فَإِنَّ زَوْجِي قَدْ خَرَجَ فِي طَلَبِ أَعْبُدٍ لَهُ أَبَقُوا فَأَدْرَكَهُمْ حَتَّى إِذَا كَانَ بِطَرَفِ الْقَدُومِ قَتَلُوهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ امْكُثِي فِي بَيْتِكِ حَتَّى يَبْلُغَ الْكِتَابُ أَجَلَهُ فَقُلْتُ إِنَّهُ لَمْ يَدَعْنِي فِي بَيْتٍ أَمْلِكُهُ وَلَا نَفَقَةٍ فَقَالَ امْكُثِي حَتَّى يَبْلُغَ الْكِتَابُ أَجَلَهُ فَاعْتَدَّتْ فِيهِ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا قَالَتْ فَلَمَّا كَانَ عُثْمَانُ أَرْسَلَ إِلَيَّ فَسَأَلَنِي عَنْ ذَلِكَ فَأَخْبَرْتُهُ فَاتَّبَعَ ذَلِكَ وَقَضَى بِهِ",
            "id": "Telah mengabarkan kepada kami ['Ubaidullah bin Abdul Majid] telah menceritakan kepada kami [Malik] dari [Sa'd bin Ishaq bin Ka'b bin 'Ujrah] dari bibinya [Zainab binti Ka'an bin Ujrah] bahwa [Al Furai'ah binti Malik], ia telah mengabarkan kepadanya, bahwa ia pernah meminta kepada Rasulullah shallallahu 'alaihi wasallam agar memberinya izin untuk kembali kepada keluarganya. Ia berkata; \"Sesungguhnya suamiku keluar untuk mencari budak-budaknya yang kabur, kemudian ia mendapatkan mereka hingga setelah berada di Tharaf Al Qadum, budak-budaknya membunuhnya.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tinggallah di rumahmu hingga 'iddahmu habis sampai batas waktunya.\" Aku berkata; \"Sesungguhnya suamiku tidak meninggalkanku di rumah yang aku miliki, tidak pula ada nafkah.\" Beliau bersabda: \"Tinggallah hingga 'iddah sampai batas waktunya.\" Kemudian ia menjalani 'iddah selama empat bulan sepuluh hari. Furai'ah berkata; Tatkala Utsman mengirim surat kepadaku dan bertanya mengenai hal itu, maka aku mengabarkan kepadanya, setelah itu Utsman mengikuti dan memberikan keputusan dengannya.\""
        },
        {
            "number": 2186,
            "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ طُلِّقَتْ خَالَتِي فَأَرَادَتْ أَنْ تَجُدَّ نَخْلًا لَهَا فَقَالَ لَهَا رَجُلٌ لَيْسَ لَكِ أَنْ تَخْرُجِي قَالَتْ فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ اخْرُجِي فَجُدِّي نَخْلَكِ فَلَعَلَّكِ أَنْ تَصَدَّقِي أَوْ تَصْنَعِي مَعْرُوفًا",
            "id": "Telah mengabarkan kepada kami ['Ashim] dari [Ibnu Juraij] dari [Abu Az Zubair] dari [Jabir], ia berkata; bibiku telah dicerai dan ia hendak menebang pohon kurma miliknya, lantas seseorang berkata; \"Engkau tidak boleh keluar.\" Bibiku berkata; kemudian aku mendatangi Nabi shallallahu 'alaihi wasallam dan menceritakan hal itu kepada beliau. Beliau bersabda: \"Keluarlah dan potonglah pohon kurmamu, kemungkinan engkau akan bersedekah atau melakukan sesuatu yang terpuji.\""
        },
        {
            "number": 2187,
            "arab": " أَخْبَرَنَا سَهْلُ بْنُ حَمَّادٍ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ أَنَّهَا أَرَادَتْ أَنْ تَشْتَرِيَ بَرِيرَةَ فَأَرَادَ مَوَالِيهَا أَنْ يَشْتَرِطُوا وَلَاءَهَا فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ اشْتَرِيهَا فَإِنَّمَا الْوَلَاءُ لِمَنْ أَعْتَقَ فَاشْتَرَتْهَا فَأَعْتَقَتْهَا وَخَيَّرَهَا مِنْ زَوْجِهَا وَكَانَ حُرًّا وَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِلَحْمٍ فَقَالَ مِنْ أَيْنَ هَذَا قِيلَ تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ فَقَالَ هُوَ لَهَا صَدَقَةٌ وَلَنَا هَدِيَّةٌ",
            "id": "Telah mengabarkan kepada kami [Sahl bin Hammad] telah menceritakan kepada kami [Syu'bah] dari [Al Hakam] dari [Ibrahim] dari [Al Aswad] dari ['Aisyah] bahwa ia ingin membeli Barirah, ternyata tuannya memberikan syarat perwaliannya harus milik mereka. 'Aisyah pun mengadukan hal itu kepada Rasulullah shallallahu 'alaihi wasallam. Beliau lalu bersabda: \"Belilah dia, sesungguhnya perwalian adalah milik orang yang memerdekakan.\" Kemudian 'Aisyah membelinya dan membebaskannya. Dan beliau juga pernah memberikan pilihan kepadanya atas suaminya yang juga orang merdeka. Dan Nabi shallallahu 'alaihi wasallam pernah diberi daging, kemudian beliau bertanya: \"Dari mana daging ini?\" Dijawab; \"ini adalah daging yang disedekahkan kepada Barirah.\" Lalu beliau bersabda: \"Baginya adalah sedekah dan bagi kami adalah hadiah.\""
        },
        {
            "number": 2188,
            "arab": " أَخْبَرَنَا إِسْمَعِيلُ بْنُ خَلِيلٍ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ دَخَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيَّ فَقَرَّبْتُ إِلَيْهِ طَعَامًا لَيْسَ فِيهِ لَحْمٌ فَقَالَ أَلَمْ أَرَ لَكُمْ قِدْرًا مَنْصُوبَةً قُلْتُ يَا رَسُولَ اللَّهِ هَذَا لَحْمٌ تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ فَأَهْدَتْ لَنَا قَالَ هُوَ عَلَيْهَا صَدَقَةٌ وَهُوَ لَنَا مِنْهَا هَدِيَّةٌ وَكَانَ لَهَا زَوْجٌ فَلَمَّا عُتِقَتْ خُيِّرَتْ",
            "id": "Telah mengabarkan kepada kami [Isma'il bin Khalil] telah menceritakan kepada kami [Ali bin Mushir] telah menceritakan kepada kami [Hisyam bin 'Urwah] dari [Abdurrahman bin Al Qasim] dari [Ayahnya] dari ['Aisyah], ia berkata; Rasulullah shallallahu 'alaihi wasallam menemuiku, lalu aku dekatkan makanan yang tidak ada dagingnya, lalu beliau bersabda: \"Bukankah tadi aku melihat kalian memasak (daging) di kuwali?\" Maka saya katakan; \"Wahai Rasulullah, ini adalah daging yang disedekahkan kepada Barirah, dan ia hadiahkan kepada kita.\" Beliau bersabda: \"Daging itu adalah sedekah baginya dan menjadi hadiah bagi kita.\" Dan Barirah dahulunya memiliki suami, kemudian setelah ia di bebaskan, maka ia diberikan pilihan (antara meneruskan atau berpisah).\""
        },
        {
            "number": 2189,
            "arab": " أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ الضَّحَّاكِ عَنْ الْمُغِيرَةِ بْنِ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيِّ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّ بَرِيرَةَ حِينَ أَعْتَقَتْهَا عَائِشَةُ كَانَ زَوْجُهَا عَبْدًا فَجَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَحُضُّهَا عَلَيْهِ فَجَعَلَتْ تَقُولُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَيْسَ لِي أَنْ أُفَارِقَهُ قَالَ بَلَى قَالَتْ فَقَدْ فَارَقْتُهُ",
            "id": "Telah mengabarkan kepada kami [Abdurrahman bin Adh Dhahhak] dari [Al Mughirah bin Abdurrahman Al Makhzumi] dari [Hisyam bin 'Urwah] dari [Abdurrahman bin Al Qasim] dari [Ayahnya] dari ['Aisyah] bahwa ketika Barirah dibebaskan oleh 'Aisyah, sementara suaminya masih berstatuskan budak, kemudian Rasulullah shallallahu 'alaihi wasallam menganjurkannya agar berbuat baik terhadapnya, maka Barirah berkata kepada Rasulullah shallallahu 'alaihi wasallam; \"Bukankah aku boleh berpisah dengannya?\" Beliau menjawab: \"Benar.\" Ia berkata; \"Sungguh aku telah berpisah darinya.\""
        },
        {
            "number": 2190,
            "arab": " أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ عَنْ خَالِدٍ يَعْنِي الْحَذَّاءَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ زَوْجَ بَرِيرَةَ كَانَ عَبْدًا يُقَالُ لَهُ مُغِيثٌ كَأَنِّي أَنْظُرُ إِلَيْهِ يَطُوفُ خَلْفَهَا يَبْكِي وَدُمُوعُهُ تَسِيلُ عَلَى لِحْيَتِهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْعَبَّاسِ يَا عَبَّاسُ أَلَا تَعْجَبُ مِنْ شِدَّةِ حُبِّ مُغِيثٍ بَرِيرَةَ وَمِنْ شِدَّةِ بُغْضِ بَرِيرَةَ مُغِيثًا فَقَالَ لَهَا لَوْ رَاجَعْتِيهِ فَإِنَّهُ أَبُو وَلَدِكِ فَقَالَتْ يَا رَسُولَ اللَّهِ أَتَأْمُرُنِي قَالَ إِنَّمَا أَنَا شَافِعٌ قَالَتْ لَا حَاجَةَ لِي فِيهِ",
            "id": "Telah mengabarkan kepada kami ['Amr bin 'Aun] telah mengabarkan kepada kami [Khalid bin Abdullah] dari [Khalid yaitu Al Hadzdza`] dari [Ikrimah] dari [Ibnu Abbas] bahwa suami Barirah adalah seorang budak yang bernama Mughits, sepertinya aku melihat dia mengikuti di belakang Barirah dalam keadaan menangis dan air matanya mengalir hingga membasahi jenggotnya. Kemudian Nabi shallallahu 'alaihi wasallam bersabda kepada Al Abbas: \"Wahai Abbas, tidakkah engkau kagum dengan besarnya kecintaan Mughits kepada Barirah dan besarnya kebencian Barirah kepada Mughits?\" Kemudian beliau bersabda kepada Barirah: \"Seandainya engkau kembali kepadanya, sesungguhnya ia adalah ayah dari anakmu.\" Lalu Barirah berkata; \"Wahai Rasulullah, apakah anda memerintahkanku?\" Beliau menjawab: \"Sesungguhnya aku sebagai perantara.\" Ia berkata; \"Aku tidak butuh kepadanya.\""
        },
        {
            "number": 2191,
            "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي زِيَادُ بْنُ سَعْدٍ عَنْ هِلَالِ بْنِ أُسَامَةَ عَنْ أَبِي مَيْمُونَةَ سُلَيْمَانَ مَوْلًى لِأَهْلِ الْمَدِينَةِ قَالَ كُنْتُ عِنْدَ أَبِي هُرَيْرَةَ فَجَاءَتْهُ امْرَأَةٌ فَقَالَتْ إِنَّ زَوْجِي يُرِيدُ أَنْ يَذْهَبَ بِوَلَدِي فَقَالَ أَبُو هُرَيْرَةَ كُنْتُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ جَاءَتْهُ امْرَأَةٌ فَقَالَتْ إِنَّ زَوْجِي يُرِيدُ أَنْ يَذْهَبَ بِوَلَدِي أَوْ بِابْنِي وَقَدْ نَفَعَنِي وَسَقَانِي مِنْ بِئْرِ أَبِي عِنَبَةَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَهِمَا أَوْ قَالَ تَسَاهَمَا أَبُو عَاصِمٍ الشَّاكُّ فَجَاءَ زَوْجُهَا فَقَالَ مَنْ يُخَاصِمُنِي فِي وَلَدِي أَوْ فِي ابْنِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا غُلَامُ هَذَا أَبُوكَ وَهَذِهِ أُمُّكَ فَخُذْ بِيَدِ أَيِّهِمَا شِئْتَ وَقَدْ قَالَ أَبُو عَاصِمٍ فَاتْبَعْ أَيَّهُمَا شِئْتَ فَأَخَذَ بِيَدِ أُمِّهِ فَانْطَلَقَتْ بِهِ",
            "id": "Telah mengabarkan kepada kami [Abu 'Ashim] telah menceritakan kepada kami [Ibnu Juraij], ia berkata; telah mengabarkan kepadaku [Ziyad bin Sa'd] dari [Hilal bin Usamah] dari [Abu Maimunah Sulaiman] mantan budak penduduk Madinah, ia berkata; aku pernah berada di rumah Abu Hurairah, kemudian seorang wanita datang kepadanya dan berkata; \"Sesungguhnya suamiku ingin pergi membawa anakku.\" [Abu Hurairah] lalu berkata; \"Aku pernah bersama Rasulullah shallallahu 'alaihi wasallam, tiba-tiba seorang wanita datang kepada beliau sambil berkata; \"Sesungguhnya suamiku ingin pergi membawa anakku -atau putraku- sementara anakku telah memberi manfaat kepadaku dan selalu mengambilkan air dari sumur Abu 'Inabah.\" Kemudian Rasulullah shallallahu 'alaihi wasallam berkata: \"Hendaknya kalian berdua mengadakan undian.\" -Atau beliau mengatakan: \"Hendaknya kalian saling mengundi.\" Abu 'Ashim ragu mengenai redaksi haditsnya- Kemudian suaminya datang dan berkata; \"Siapakah yang akan melawanku terhadap anakku?\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai anak kecil, ini adalah ayahmu dan ini adalah ibumu, peganglah tangan salah seorang diantara mereka berdua yang engkau kehendaki! \" Anak tersebut akhirnya memegang tangan ibunya, lalu wanita itu pergi dengan anaknya.\""
        },
        {
            "number": 2192,
            "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي مُظَاهِرٌ وَهُوَ ابْنُ أَسْلَمَ أَنَّهُ سَمِعَ الْقَاسِمَ بْنَ مُحَمَّدٍ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِلْأَمَةِ تَطْلِيقَتَانِ وَقُرْؤُهَا حَيْضَتَانِ قَالَ أَبُو عَاصِمٍ سَمِعْتُهُ مِنْ مُظَاهِرٍ",
            "id": "Telah mengabarkan kepada kami [Abu 'Ashim] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Muzhahir yaitu Ibnu Aslam] bahwa ia mendengar [Al Qasim bin Muhammad] dari ['Aisyah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Seorang budak memiliki dua kali cerai, dan quru`nya (masa iddahnya) adalah dua kali haid.\" [Abu 'Ashim] berkata; aku mendengarnya dari [Muzhahir]."
        },
        {
            "number": 2193,
            "arab": " أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا شَرِيكٌ عَنْ قَيْسِ بْنِ وَهْبٍ عَنْ أَبِي الْوَدَّاكِ عَنْ أَبِي سَعِيدٍ وَرَفَعَهُ أَنَّهُ قَالَ فِي سَبَايَا أَوْطَاسٍ لَا تُوطَأُ حَامِلٌ حَتَّى تَضَعَ حَمْلَهَا وَلَا غَيْرُ ذَاتِ حَمْلٍ حَتَّى تَحِيضَ حَيْضَةً",
            "id": "Telah mengabarkan kepada kami ['Amr bin 'Aun] telah mengabarkan kepada kami [Syarik] dari [Qais bin Wahb] dari [Abu Al Waddak] dari [Abu Sa'id] -dia telah merafa'kannya- dia berkata mengenai para tawanan wanita Authas; \"Wanita hamil tidak boleh digauli hingga ia melahirkan kandungannya, sedangkan yang tidak hamil, hingga ia mengalami haid satu kali.\""
        }
    ]
}