{
    "kategori": "Kitab Minuman",
    "hadits": [
        {
            "number": 1996,
            "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ نَافِعٍ حَدَّثَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ أُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلَةَ أُسْرِيَ بِهِ بِإِيلِيَاءَ بِقَدَحَيْنِ مِنْ خَمْرٍ وَلَبَنٍ فَنَظَرَ إِلَيْهِمَا ثُمَّ أَخَذَ اللَّبَنَ فَقَالَ جِبْرِيلُ الْحَمْدُ لِلَّهِ الَّذِي هَدَاكَ لِلْفِطْرَةِ لَوْ أَخَذْتَ الْخَمْرَ غَوَتْ أُمَّتُكَ",
            "id": "Telah mengabarkan kepada kami [Al Hakam bin Nafi'] telah menceritakan kepada kami [Syu'aib] dari [Az Zuhri] telah mengabarkan kepadaku [Sa'id bin Al Musayyab] bahwa ia mendengar [Abu Hurairah] berkata; Nabi shallallahu 'alaihi wasallam pernah di beri dua gelas yang berisi arak dan susu di Iliya' pada malam isra`, beliau kemudian melihat keduanya dan mengambil susu. Jibril berkata; segala puji bagi Allah Yang telah menunjukimu kepadamu kesucian, seandainya engkau mengambil arak, niscaya umatmu akan sesat.\""
        },
        {
            "number": 1997,
            "arab": " أَخْبَرَنَا أَبُو النُّعْمَانِ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا ثَابِتٌ عَنْ أَنَسٍ قَالَ كُنْتُ سَاقِيَ الْقَوْمِ فِي مَنْزِلِ أَبِي طَلْحَةَ قَالَ فَنَزَلَ تَحْرِيمُ الْخَمْرِ قَالَ فَأَمَرَ مُنَادِيًا فَنَادَى فَقَالَ أَبُو طَلْحَةَ اخْرُجْ فَانْظُرْ مَا هَذَا فَخَرَجْتُ فَقُلْتُ هَذَا مُنَادٍ يُنَادِي أَلَا إِنَّ الْخَمْرَ قَدْ حُرِّمَتْ فَقَالَ لِيَ اذْهَبْ فَأَهْرِقْهَا قَالَ فَجَرَتْ فِي سِكَكِ الْمَدِينَةِ قَالَ وَكَانَتْ خَمْرُهُمْ يَوْمَئِذٍ الْفَضِيخَ فَقَالَ بَعْضُ الْقَوْمِ قُتِلَ قَوْمٌ وَهِيَ فِي بُطُونِهِمْ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ { لَيْسَ عَلَى الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جُنَاحٌ فِيمَا طَعِمُوا إِذَا مَا اتَّقَوْا وَآمَنُوا } الْآيَةَ",
            "id": "Telah mengabarkan kepada kami [Abu Nu'man] telah menceritakan kepada kami [Hammad bin Zaid] telah menceritakan kepada kami [Tsabit] dari [Anas], ia berkata; Ketika aku menuangkan minuman di rumah Abu Thalhah. Anas melanjutkan; tiba-tiba turunlah (ayat) yang mengharamkan khamer. Kemudian beliau memerintahkan seseorang untuk menyeru, ia pun menyeru. Lalu Abu Thalhah berkata; \"Keluarlah dan lihatlah ada apa itu?, \" Akupun keluar, setelah itu aku berkata; \"Itu adalah orang yang menyeru, ketahuilah bahwa khamer telah diharamkan.\" Abu Thalhah berkata kepadaku; \"Pergi dan tumpahkanlah khamer tersebut.\" Anas berkata; \"Berita itu kemudian tersebar ke seantero penjuru Madinah, khamer mereka saat itu adalah fadikh (khmer yang terbuat dari rendaman kurma pentil). Kemudian sebagian orang mengatakan; \"Beberapa orang telah meninggal, sementara perut mereka masih terisi khamer.\" Maka Allah 'azza wajalla menurunkan ayat: Tidak ada dosa bagi orang-orang yang beriman dan mengerjakan amalan yang saleh karena memakan makanan yang telah mereka makan dahulu, apabila mereka bertakwa serta beriman. QS Al Ma`idah; 93."
        },
        {
            "number": 1998,
            "arab": " أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ شَرِبَ الْخَمْرَ فِي الدُّنْيَا ثُمَّ لَمْ يَتُبْ مِنْهَا حُرِمَهَا فِي الْآخِرَةِ فَلَمْ يُسْقَهَا",
            "id": "Telah mengabarkan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Nafi'] dari [Ibnu Umar], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa minum khamer di dunia, kemudian ia tidak bertaubat darinya, maka ia diharamkan darinya di Akherat, dan tidak akan diberi minum darinya.\""
        },
        {
            "number": 1999,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ الْأَوْزَاعِيِّ قَالَ حَدَّثَنِي رَبِيعَةُ بْنُ يَزِيدَ عَنْ عَبْدِ اللَّهِ بْنِ الدَّيْلَمِيِّ قَالَ دَخَلْتُ عَلَى عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ فِي حَائِطٍ لَهُ بِالطَّائِفِ يُقَالُ لَهُ الْوَهْطُ فَإِذَا هُوَ مُخَاصِرٌ فَتًى مِنْ قُرَيْشٍ يُزَنُّ ذَلِكَ الْفَتَى بِشُرْبِ الْخَمْرِ فَقُلْتُ خِصَالٌ بَلَغَتْنِي عَنْكَ أَنَّكَ تُحَدِّثُ بِهَا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ مَنْ شَرِبَ الْخَمْرَ شَرْبَةً لَمْ تُقْبَلْ لَهُ صَلَاةٌ أَرْبَعِينَ صَبَاحًا فَلَمَّا أَنْ سَمِعَهُ الْفَتَى يَذْكُرُ الْخَمْرَ اخْتَلَجَ يَدَهُ مِنْ يَدِ عَبْدِ اللَّهِ ثُمَّ وَلَّى فَقَالَ عَبْدُ اللَّهِ اللَّهُمَّ إِنِّي لَا أُحِلُّ لِأَحَدٍ أَنْ يَقُولَ عَلَيَّ مَا لَمْ أَقُلْ وَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ شَرِبَ الْخَمْرَ شَرْبَةً لَمْ تُقْبَلْ لَهُ صَلَاةٌ أَرْبَعِينَ صَبَاحًا فَإِنْ تَابَ تَابَ اللَّهُ عَلَيْهِ فَلَا أَدْرِي فِي الثَّالِثَةِ أَمْ فِي الرَّابِعَةِ كَانَ حَقًّا عَلَى اللَّهِ أَنْ يَسْقِيَهُ مِنْ رَدْغَةِ الْخَبَالِ يَوْمَ الْقِيَامَةِ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] dari [Al Auza'i], ia berkata; telah menceritakan kepadaku [Rabi'ah bin Yazid] dari [Abdullah bin Ad Dailami], ia berkata; aku menemui [Abdullah bin 'Amr bin Al 'Ash] di kebunnya di Thaif, kebun itu disebut Al Wahth. Ternyata ia sedang menahan tangan seorang pemuda dari Quraisy yang dituduh meminum khamer. Aku kemudian berkata; \"Beberapa perkara yang sampai kepadaku bahwa anda menceritakannya dari Rasulullah shallallahu 'alaihi wasallam, bahwa: \"Barangsiapa meminum khamer satu teguk, maka tidak akan diterima shalatnya selama empat puluh hari.\" Ketika pemuda tersebut mendengar ia menyebutkan khamer, maka pemuda itu menarik dari tangan Abdullah, kemudian pergi. Abdullah lalu berkata; \"Ya Allah, sesungguhnya aku tidak mengahalalkan orang yang memfitnahku telah mengucapkan sesuatu yang tidak aku katakan. Sesungguhnya aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa minum seteguk khamer, maka tidak akan diterima shalatnya selama empat puluh hari, apabila ia bertaubat maka Allah menerima taubatnya -Aku tidak tahu, apakah hal itu pada kali ketiga atau keempat-Maka Allah berhak untuk memberinya minuman dari Lumpur penghuni Neraka pada Hari Kiamat.\""
        },
        {
            "number": 2000,
            "arab": " أَخْبَرَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا الْحَسَنُ بْنُ أَبِي جَعْفَرٍ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلَا يَقْعُدْ عَلَى مَائِدَةٍ يُشْرَبُ عَلَيْهَا الْخَمْرُ",
            "id": "Telah mengabarkan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Al Hasan bin Abu Ja'far] telah menceritakan kepada kami [Abu Az Zubair] dari [Jabir] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa beriman kepada Allah dan Hari Akhir, maka janganlah ia duduk di hidangan yang terdapat khamer.\""
        },
        {
            "number": 2001,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ كَثِيرٍ الْبَصْرِيُّ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ جَابَانَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَدْخُلُ الْجَنَّةَ وَلَدُ زِنْيَةٍ وَلَا مَنَّانٌ وَلَا عَاقٌّ وَلَا مُدْمِنُ خَمْرٍ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Katsir Al Bashri] telah menceritakan kepada kami [Sufyan] dari [Manshur] dari [Salim bin Abu Al Ja'd] dari [Jaban] dari [Abdullah bin 'Amr] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Tidak akan masuk surga anak hasil zina, orang yang mengungkit pemberiannya, anak durhaka dan pecandu khamer.\""
        },
        {
            "number": 2002,
            "arab": " حَدَّثَنَا أَحْمَدُ بْنُ الْحَجَّاجِ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا شُعْبَةُ عَنْ مَنْصُورٍ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ نُبَيْطِ بْنِ شَرِيطٍ عَنْ جَابَانَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَدْخُلُ الْجَنَّةَ عَاقٌّ وَلَا مَنَّانٌ وَلَا مُدْمِنُ خَمْرٍ",
            "id": "Telah menceritakan kepada kami [Ahmad bin Al Hajjaj] telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Syu'bah] dari [Manshur] dari [Salim bin Abu Al Ja'd] dari [Nubaith bin Syarith] dari [Jaban] dari [Abdullah bin 'Amr] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Tidak akan masuk surga anak durhaka, orang yang mengungkit pemberiannya dan pecandu khamer.\""
        },
        {
            "number": 2003,
            "arab": " أَخْبَرَنَا سُهَيْلُ بْنُ حَمَّادٍ حَدَّثَنَا شُعْبَةُ حَدَّثَنَا سِمَاكٌ قَالَ سَمِعْتُ عَلْقَمَةَ بْنَ وَائِلٍ يُحَدِّثُ عَنْ أَبِيهِ وَائِلٍ أَنَّ سُوَيْدَ بْنَ طَارِقٍ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْخَمْرِ فَنَهَاهُ عَنْهَا أَنْ يَصْنَعَهَا فَقَالَ إِنَّهَا دَوَاءٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهَا لَيْسَتْ دَوَاءً وَلَكِنَّهَا دَاءٌ",
            "id": "Telah mengabarkan kepada kami [Suhail bin Hammad] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami [Simak], ia berkata; aku bertanya kepada ['Alqamah bin Wail] dia menceritakan dari ayahnya yaitu [Wail] bahwa Suwaid bin Thariq bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai khamer. Lantas beliau melarang untuk membuatnya. Ia pun berkata; \"Sesungguhnya khamer dapat di jadikan obat.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya khamer bukanlah obat, melainkan penyakit.\""
        },
        {
            "number": 2004,
            "arab": " أَخْبَرَنَا أَبُو الْمُغِيرَةِ عَنْ الْأَوْزَاعِيِّ قَالَ سَمِعْتُ أَبَا كَثِيرٍ يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْخَمْرُ فِي هَاتَيْنِ الشَّجَرَتَيْنِ النَّخْلَةِ وَالْعِنَبَةِ",
            "id": "Telah mengabarkan kepada kami [Abu Al Mughirah] dari [Al Auza'i], ia berkata; aku mendengar [Abu Katsir] berkata; aku mendengar [Abu Hurairah] berkata; aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Khamer dapat di buat dari dua pohon ini yaitu pohon kurma dan pohon anggur.\""
        },
        {
            "number": 2005,
            "arab": " حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ حَدَّثَنَا مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ الْبِتْعِ قَالَ كُلُّ شَرَابٍ أَسْكَرَ حَرَامٌ",
            "id": "Telah menceritakan kapada kami ['Ubaidullah bin Abdul Majid] telah menceritakan kepada kami [Malik] dari [Ibnu Syihab] dari [Abu Salamah] dari ['Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam pernah ditanya mengenai Al Bit', Beliau bersabda: \"Semua minuman yang memabukkan adalah haram.\" "
        },
        {
            "number": 2006,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ إِسْرَائِيلَ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى عَنْ أَبِيهِ قَالَ بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا وَمُعَاذَ بْنَ جَبَلٍ إِلَى الْيَمَنِ فَقَالَ اشْرَبُوا وَلَا تَشْرَبُوا مُسْكِرًا فَإِنَّ كُلَّ مُسْكِرٍ حَرَامٌ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Isra`il] dari [Abu Ishaq] dari [Abu Burdah bin Abu Musa] dari [Ayahnya] ia berkata; Rasulullah shallallahu 'alaihi wasallam pernah mengutusku dan Mu'adz bin Jabal ke Yaman, Beliau berkata: \"Minumlah dan janganlah kalian minum sesuatu yang memabukkan, karena sesungguhnya segala yang memabukkan adalah haram.\""
        },
        {
            "number": 2007,
            "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ أَخْبَرَنَا أَبُو أُسَامَةَ حَدَّثَنَا الْوَلِيدُ بْنُ كَثِيرِ بْنِ سِنَانٍ حَدَّثَنِي الضَّحَّاكُ بْنُ عُثْمَانَ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ عَامِرِ بْنِ سَعْدٍ عَنْ سَعْدٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَنْهَاكُمْ عَنْ قَلِيلِ مَا أَسْكَرَ كَثِيرُهُ",
            "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] telah mengabarkan kepada kami [Abu Usamah] telah menceritakan kepada kami [Al Walid bin Katsir bin Sinan] telah menceritakan kepadaku [Adh Dhahhak bin Utsman] dari [Bukair bin Abdullah bin Al Asyajj] dari ['Amir bin Sa'd] dari [Sa'd] dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Aku melarang kalian dari sedikit yang banyaknya menyebabkan mabuk.\""
        },
        {
            "number": 2008,
            "arab": " حَدَّثَنَا زَيْدُ بْنُ يَحْيَى حَدَّثَنَا مُحَمَّدُ بْنُ رَاشِدٍ عَنْ أَبِي وَهْبٍ الْكَلَاعِيِّ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ أَوَّلَ مَا يُكْفَأُ قَالَ زَيْدٌ يَعْنِي الْإِسْلَامَ كَمَا يُكْفَأُ الْإِنَاءُ كَفْيَ الْخَمْرِ فَقِيلَ فَكَيْفَ يَا رَسُولَ اللَّهِ وَقَدْ بَيَّنَ اللَّهُ فِيهَا مَا بَيَّنَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسَمُّونَهَا بِغَيْرِ اسْمِهَا فَيَسْتَحِلُّونَهَا",
            "id": "Telah menceritakan kepada kami [Zaid bin Yahya] telah menceritakan kepada kami [Muhammad bin Rasyid] dari [Abu Wahb Al Kala'i] dari [Al Qasim bin Muhammad] dari ['Aisyah], ia berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya sesuatu pertama yang ditumpahkan-Zaid berkata; yaitu dalam Islam- seperti membalikkah bejana adalah mrnumpshksn (bejana) khamer.\" Beliau dtanya; \"Bagaimana hal itu terjadi wahai Rasulullah? Padahal Allah telah menjelaskan mengenai khamer sebagaimana yang telah Allah jelaskan?\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mereka menamakannya dengan selain namanya, kemudian mereka menghalalkannya.\""
        },
        {
            "number": 2009,
            "arab": " أَخْبَرَنَا مَرْوَانُ بْنُ مُحَمَّدٍ حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ حَدَّثَنِي أَبُو وَهْبٍ عَنْ مَكْحُولٍ عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ عَنْ أَبِي عُبَيْدَةَ بْنِ الْجَرَّاحِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوَّلُ دِينِكُمْ نُبُوَّةٌ وَرَحْمَةٌ ثُمَّ مُلْكٌ وَرَحْمَةٌ ثُمَّ مُلْكٌ أَعْفَرُ ثُمَّ مُلْكٌ وَجَبَرُوتٌ يُسْتَحَلُّ فِيهَا الْخَمْرُ وَالْحَرِيرُ قَالَ أَبُو مُحَمَّد الْأَعْفَرُ شِبْهُ التُّرَابِ لَيْسَ فِيهِ طَمَعٌ",
            "id": "Telah mengabarkan kepada kami [Marwan bin Muhammad] telah menceritakan kepada kami [Yahya bin Hamzah] telah menceritakan kepadaku [Abu Wahb] dari [Makhul] dari [Abu Tsa'labah Al Khusyani] dari [Abu 'Ubaidah bin Al Jarrah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pertama kali dalam agama kalian adalah kenabian dan rahmat, kemudian kerajaan dan rahmat, kemudian kerajaan yang dipimpin dengan keburukan kemudian kerajaan dan keangkuhan serta otoriter, padanya dihalalkan khamer dan kain sutera.\" Abu Muhammad berkata; Al A'far adalah menyerupai debu dan tidak ada harapan padanya."
        },
        {
            "number": 2010,
            "arab": " أَخْبَرَنَا سَهْلُ بْنُ حَمَّادٍ حَدَّثَنَا طُعْمَةُ حَدَّثَنَا عَمْرُو بْنُ بَيَانٍ التَّغْلِبِيُّ عَنْ عُرْوَةَ بْنِ الْمُغِيرَةِ بْنِ شُعْبَةَ عَنْ أَبِيهِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ مَنْ بَاعَ الْخَمْرَ فَلْيُشَقِّصْ الْخَنَازِيرَ قَالَ أَبُو مُحَمَّد إِنَّمَا هُوَ عُمَرُ بْنُ بَيَانٍ",
            "id": "Telah mengabarkan kepada kami [Sahl bin Hammad] telah menceritakan kepada kami [Thu'mah] telah menceritakan kepada kami ['Amr bin Bayan At Taghlibi] dari ['Urwah bin Al Mughirah bin Syu'bah] dari [Ayahnya] dari Rasulullah shallallahu 'alaihi wasallam bahwa beliau bersabda: \"Barangsiapa menjual khamer, sebagaimana ia menghalalkan daging babi.\" Abu Muhammad berkata; sesungguhnya yang benar adalah Umar bin Bayan."
        },
        {
            "number": 2011,
            "arab": " حَدَّثَنَا يَعْلَى عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ الْقَعْقَاعِ بْنِ حَكِيمٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ وَعْلَةَ قَالَ سَأَلْتُ ابْنَ عَبَّاسٍ عَنْ بَيْعِ الْخَمْرِ فَقَالَ كَانَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَدِيقٌ مِنْ ثَقِيفٍ أَوْ مِنْ دَوْسٍ فَلَقِيَهُ بِمَكَّةَ عَامَ الْفَتْحِ بِرَاوِيَةٍ مِنْ خَمْرٍ يُهْدِيهَا لَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا فُلَانُ أَمَا عَلِمْتَ أَنَّ اللَّهَ تَعَالَى قَدْ حَرَّمَهَا قَالَ فَأَقْبَلَ الرَّجُلُ عَلَى غُلَامِهِ فَقَالَ اذْهَبْ فَبِعْهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَاذَا أَمَرْتَهُ يَا فُلَانُ قَالَ أَمَرْتُهُ بِبَيْعِهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الَّذِي حَرَّمَ شُرْبَهَا حَرَّمَ بَيْعَهَا فَأَمَرَ بِهَا فَأُكْفِئَتْ فِي الْبَطْحَاءِ",
            "id": "Telah menceritakan kepada kami [Ya'la] dari [Muhammad bin Ishaq] dari [Al Qa'qa' bin Hakim] dari [Abdurrahman bin Wa'lah] ia berkata; Aku bertanya kepada [Ibnu Abbas] mengenai penjualan khamer. Ia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah memiliki seorang teman dari Tsaqif atau dari Daus, beliau bertemu dengannya di Makkah pada saat penaklukan kota Makkah, dia membawa geriba berisi khamer yang dihadiahkan kepada beliau. Maka beliau berkata kepadanya: \"Wahai Fulan, tidakkah kamu tahu bahwa Allah Ta'ala telah mengharamkannya?\" Orang itu lalu menghadap kepada budaknya dan berkata; \"Pergi dan juallah khamer tersebut.\" Spontan Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apa yang engkau perintahkan kepadanya wahai Fulan?\" Ia berkata; \"Aku memerintahkannya untuk menjualnya.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Dzat Yang mengharamkan untuk meminumnya mengharamkan pula untuk menjualnya.\" Kemudian beliau memerintahkan supaya khamer tersebut ditumpahkan di Bathha`."
        },
        {
            "number": 2012,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ أَحْمَدَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو يَعْنِي ابْنَ دِينَارٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَ بَلَغَ عُمَرَ أَنَّ سَمُرَةَ بَاعَ خَمْرًا فَقَالَ قَاتَلَ اللَّهُ سَمُرَةَ أَمَا عَلِمَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَعَنَ اللَّهُ الْيَهُودَ حُرِّمَتْ عَلَيْهِمْ الشُّحُومُ فَجَمَلُوهَا فَبَاعُوهَا قَالَ سُفْيَانُ جَمَلُوهَا أَذَابُوهَا",
            "id": "Telah menceritakan kepada kami [Muhammad bin Ahmad] telah menceritakan kepada kami [Sufyan] dari ['Amr yaitu Ibnu Dinar] dari [Thawus] dari [Ibnu Abbas] ia berkata; telah sampai berita kepada Umar, bahwa Samurah telah menjual arak. Umar berkata; \"Semoga Allah memerangi Samurah. Tidakkah ia mengetahui bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Semoga Allah melaknat orang-orang Yahudi, lemak telah diharamkan kepada mereka kemudian mereka mencairkannya dan menjualnya.\" Sufyan berkata; \"Jamaluuha artinya mencairkannya.\""
        },
        {
            "number": 2013,
            "arab": " حَدَّثَنَا عَاصِمُ بْنُ عَلِيٍّ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ عَنْ الْحَارِثِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَكِرَ فَاجْلِدُوهُ ثُمَّ إِذَا سَكِرَ فَاجْلِدُوهُ ثُمَّ إِذَا سَكِرَ فَاجْلِدُوهُ ثُمَّ إِذَا سَكِرَ فَاضْرِبُوا عُنُقَهُ يَعْنِي فِي الرَّابِعَةِ",
            "id": "Telah menceritakan kepada kami ['Ashim bin Ali] telah menceritakan kepada kami [Ibnu Abu Dzi'b] dari [Al Harits bin Abdurrahman] dari [Abu Salamah] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila ia mabuk maka cambuklah dia, kemudian bila mabuk, cambuklah dia, jika masih mabuk, cambuklah dia, dan apabila masih saja mabuk, maka penggallah lehernya dikeempat kali.\""
        },
        {
            "number": 2014,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ الْأَوْزَاعِيِّ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَزْنِي الزَّانِي حِينَ يَزْنِي وَهُوَ مُؤْمِنٌ وَلَا يَسْرِقُ السَّارِقُ حِينَ يَسْرِقُ وَهُوَ مُؤْمِنٌ وَلَا يَشْرَبُ الْخَمْرَ حِينَ يَشْرَبُهَا وَهُوَ مُؤْمِنٌ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Al Auza'i] dari [Az Zuhri] dari [Abu Salamah] dari [Abu Hurairah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah berzina orang yang berzina ketika ia berzina ia dalam keadaan beriman, dan tidaklah mencuri orang yang mencuri ketika mencuri ia dalam keadaan beriman, dan tidaklah minum arak ketika meminumnya ia dalam keadaan beriman.\""
        },
        {
            "number": 2015,
            "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ كَانَ يُنْبَذُ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي السِّقَاءِ فَإِنْ لَمْ يَكُنْ سِقَاءٌ نُبِذَ لَهُ فِي تَوْرٍ مِنْ بِرَامٍ",
            "id": "Telah mengabarkan kepada kami [Yazid bin Harun] dari [Abdul Malik bin Abu Sulaiman] dari [Abu Az Zubair] dari [Jabir] ia berkata; Nabi shallallahu 'alaihi wasallam pernah dibuatkan rendaman khamer di dalam wadah dari kulit. Apabila tidak ada wadah dari kulit, beliau dibuatkan rendamana khamer dalam bejana kecil yang terbuat dari batu.\""
        },
        {
            "number": 2016,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ كَثِيرٍ عَنْ الْأَوْزَاعِيِّ عَنْ يَحْيَى بْنِ أَبِي عَمْرٍو السَّيْبَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ الدَّيْلَمِيِّ عَنْ أَبِيهِ أَنَّ أَبَاهُ أَوْ أَنَّ رَجُلًا مِنْهُمْ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّا قَدْ خَرَجْنَا مِنْ حَيْثُ عَلِمْتَ وَنَزَلْنَا بَيْنَ ظَهْرَانَيْ مَنْ قَدْ عَلِمْتَ فَمَنْ وَلِيُّنَا قَالَ اللَّهُ وَرَسُولُهُ قَالُوا يَا رَسُولَ اللَّهِ إِنَّا كُنَّا أَصْحَابَ كَرْمٍ وَخَمْرٍ وَإِنَّ اللَّهَ قَدْ حَرَّمَ الْخَمْرَ فَمَا نَصْنَعُ بِالْكَرْمِ قَالَ اصْنَعُوهُ زَبِيبًا قَالُوا فَمَا نَصْنَعُ بِالزَّبِيبِ قَالَ انْقَعُوهُ فِي الشِّنَانِ انْقَعُوهُ عَلَى غَدَائِكُمْ وَاشْرَبُوهُ عَلَى عَشَائِكُمْ وَانْقَعُوهُ عَلَى عَشَائِكُمْ وَاشْرَبُوهُ عَلَى غَدَائِكُمْ فَإِنَّهُ إِذَا أَتَى عَلَيْهِ الْعَصْرَانِ كَانَ خَلًّا قَبْلَ أَنْ يَكُونَ خَمْرًا",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Katsir] dari [Al Auza'i] dari [Yahya bin Abu 'Amr As Saibani] dari [Abdullah bin Ad Dailami] dari [Ayahnya] bahwa ayahnya atau seorang laki-laki diantara mereka bertanya kepada Nabi shallallahu 'alaihi wasallam, ia berkata; \"Wahai Rasulullah, sesungguhnya kami keluar dari tempat yang telah engkau ketahui dan kami singgah diantara orang-orang yang telah engkau ketahui, maka siapakah penolong-penolong kami?\" Beliau menjawab: \"Allah dan RasulNya.\" Ia berkata lagi; \"Wahai Rasulullah, sesungguhnya kami adalah orang-orang yang memiliki anggur dan khamer, sementara Allah telah mengharamkan khamer, lalu apa yang harus kami perbuat terhadap anggur?\" Beliau menjawab: \"Buatlah menjadi kismis.\" Mereka mengatakan; \"Apa yang harus kami perbuat terhadap kismis?\" Beliau menjawab: \"Rendamlah dalam geriba basah, rendamlah untuk makan siang kalian, dan minumlah untuk makan malam kalian, dan rendamlah untuk makan malam kalian serta minumlah untuk makan siang kalian, karena apabila tiba pagi hari dan senja, ia akan menjadi cuka sebelum menjadi khamer.\""
        },
        {
            "number": 2017,
            "arab": " أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ عَزْرَةَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَ سَأَلْتُ ابْنَ عُمَرَ عَنْ نَبِيذِ الْجَرِّ فَقَالَ حَرَّمَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَقِيتُ ابْنَ عَبَّاسٍ فَأَخْبَرْتُهُ بِقَوْلِ ابْنِ عُمَرَ فَقَالَ صَدَقَ أَبُو عَبْدِ الرَّحْمَنِ",
            "id": "Telah mengabarkan kepada kami [Sa'id bin 'Amir] dari [Sa'id bin 'Arubah] dari [Qatadah] dari ['Azrah] dari [Sa'id bin Jubair], ia berkata; Aku bertanya kepada [Ibnu Umar] mengenai Nabidzul Jarr, Ia menjawab; Rasulullah shallallahu 'alaihi wasallam telah mengharamkannya. Kemudian aku bertemu dengan Ibnu Abbas dan mengabarkan kepadanya mengenai perkataan Ibnu Umar, [Ibnu Abbas] menjawab; \"Abu Abdurrahman benar.\" "
        },
        {
            "number": 2018,
            "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ نَافِعٍ عَنْ شُعَيْبِ بْنِ أَبِي حَمْزَةَ عَنْ الزُّهْرِيِّ قَالَ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَنْتَبِذُوا فِي الدُّبَّاءِ وَالْمُزَفَّتِ",
            "id": "Telah mengabarkan kepada kami [Al Hakam bin Nafi'] dari [Syu'aib bin Abu Hamzah] dari [Az Zuhri], ia berkata; telah menceritakan kepadaku [Anas bin Malik] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Janganlah membuat rendaman (anggur atau kurma) dalam Dubba`dan muzaffat.\" "
        },
        {
            "number": 2019,
            "arab": " أَخْبَرَنَا أَبُو زَيْدٍ حَدَّثَنَا شُعْبَةُ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ قَالَ سَمِعْتُ أَبَا الْحَكَمِ قَالَ سَأَلْتُ ابْنَ عَبَّاسٍ أَوْ سَمِعْتُهُ سُئِلَ عَنْ نَبِيذِ الْجَرِّ فَقَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْجَرِّ وَالدُّبَّاءِ وَسَأَلْتُ ابْنَ الزُّبَيْرِ فَقَالَ مِثْلَ قَوْلِ ابْنِ عَبَّاسٍ قَالَ وَقَالَ ابْنُ عَبَّاسٍ مَنْ سَرَّهُ أَنْ يُحَرِّمَ مَا حَرَّمَ اللَّهُ وَرَسُولُهُ أَوْ مَنْ كَانَ مُحَرِّمًا مَا حَرَّمَ اللَّهُ وَرَسُولُهُ فَلْيُحَرِّمْ النَّبِيذَ قَالَ و حَدَّثَنِي أَخِي عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْجَرِّ وَالدُّبَّاءِ وَالْمُزَفَّتِ وَعَنْ الْبُسْرِ وَالتَّمْرِ",
            "id": "Telah mengabarkan kepada kami [Abu Zaid] telah menceritakan kepada kami [Syu'bah] dari [Salamah bin Kuhail], ia berkata; aku mendengar [Abu Al Hakam] berkata; aku bertanya kepada [Ibnu Abbas] atau aku mendengar dia ditanya mengenai Nabidzul jarr, Ibnu Abbas menjawab; \"Rasulullah shallallahu 'alaihi wasallam melarang dari jarr dan Dubba'.\" Kemudian aku bertanya kepada [Ibnu Az Zubair], dia pun mengatakan seperti perkataan [Ibnu Abbas]. Dan Ibnu Abbas berkata; \"Barangsiapa senang mengharamkan apa yang telah diharamkan Allah dan RasulNya, atau barangsiapa menghamkan apa yang telah diharamkan Allah dan RasulNya, hendaknya ia mengharamkan rendaman kurma dan anggur.\" Perawi berkata; telah menceritakan kepadaku [saudaraku] dari [Abu Sa'id Al Khudri] bahwa Rasulullah shallallahu 'alaihi wasallam telah melarang dari jarr, dubba' dan muzaffat, serta (rendaman) dari Busr dan tamr. "
        },
        {
            "number": 2020,
            "arab": " أَخْبَرَنَا أَبُو النُّعْمَانِ حَدَّثَنَا ثَابِتُ بْنُ يَزِيدَ حَدَّثَنَا عَاصِمٌ عَنْ فُضَيْلِ بْنِ زَيْدٍ الرَّقَاشِيِّ أَنَّهُ أَتَى عَبْدَ اللَّهِ بْنَ مُغَفَّلٍ فَقَالَ أَخْبِرْنِي بِمَا يَحْرُمُ عَلَيْنَا مِنْ الشَّرَابِ فَقَالَ الْخَمْرُ قَالَ قُلْتُ هُوَ فِي الْقُرْآنِ قَالَ مَا أُحَدِّثُكَ إِلَّا مَا سَمِعْتُ مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَدَأَ بِالِاسْمِ أَوْ قَالَ بِالرِّسَالَةِ قَالَ نَهَى عَنْ الدُّبَّاءِ وَالْحَنْتَمِ وَالنَّقِيرِ",
            "id": "Telah mengabarkan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Tsabit bin Yazid] telah menceritakan kepada kami ['Ashim] dari [Fudhail bin Zaid Ar Raqasyi] bahwa ia pernah menemui [Abdullah bin Mughaffal] lalu berkata; \"Beritahukanlah kepadaku mengenai minuman yang diharamkan atas kita!.\" Abdullah bin Mughaffal menjawab; \"Yaitu khamer.\" Fudhail berkata; saya katakan; \"Apakah hal itu (tercantum) dalam Al Qur'an?\" Abdullah bin Mughaffal menjawab; \"Tidaklah aku menceritakan kepadamu kecuali apa yang telah aku dengar dari Muhammad shallallahu 'alaihi wasallam -Abdullah bin Mughaffal (mengatakan dengan) mendahulukan nama yaitu Muhammad Rasulullah, atau mendahulukan risalah yaitu Rasulullah Muhammad- dia melanjutkan; \"Beliau telah melarang bejana dari dubba', hantam dan naqir.\" "
        },
        {
            "number": 2021,
            "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ وَسَعِيدُ بْنُ عَامِرٍ وَاللَّفْظُ لِيَزِيدَ قَالَا أَخْبَرَنَا هِشَامٌ عَنْ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَنْتَبِذُوا الزَّهْوَ وَالرُّطَبَ جَمِيعًا وَلَا تَنْتَبِذُوا الزَّبِيبَ وَالتَّمْرَ جَمِيعًا وَانْتَبِذُوا كُلَّ وَاحِدٍ مِنْهُمَا عَلَى حِدَتِهِ",
            "id": "Telah mengabarkan kepada kami [Yazid bin Harun] dan [Sa'id bin 'Amir] sedangkan redaksi haditsnya dari Yazid, keduanya berkata; telah mengabarkan kepada kami [Hisyam] dari [Yahya] dari [Abdullah bin Abu Qatadah] dari [Ayahnya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Buatlah rendaman dari Zahwu (kurma masak) serta Ruthab (kurma basah) secara bersamaan, dan janganlah membuat rendaman dari Kismis dan tamr (kurma kering) secara bersamaan, dan buatlah rendaman dari salah satunya secara terpisah.\""
        },
        {
            "number": 2022,
            "arab": " حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ أَخْبَرَنَا شُعْبَةُ عَنْ سِمَاكٍ عَنْ عَلْقَمَةَ بْنِ وَائِلٍ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَقُولُوا الْكَرْمَ وَقُولُوا الْعِنَبَ أَوْ الْحَبَلَةَ",
            "id": "Telah menceritakan kepada kami [Utsman bin Umar] telah mengabarkan kepada kami [Syu'bah] dari [Simak] dari ['Alqamah bin Wail] dari [Ayahnya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian mengatakan Al Karam, akan tetapi katakanlah anggur atau habalah.\""
        },
        {
            "number": 2023,
            "arab": " حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ إِسْرَائِيلَ عَنْ السُّدِّيِّ عَنْ يَحْيَى بْنِ عَبَّادٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كَانَ فِي حِجْرِ أَبِي طَلْحَةَ يَتَامَى فَاشْتَرَى لَهُمْ خَمْرًا فَلَمَّا نَزَلَ تَحْرِيمُ الْخَمْرِ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ فَقَالَ أَجْعَلُهُ خَلًّا قَالَ لَا فَأَهْرَاقَهُ",
            "id": "Telah menceritakan kepada kami ['Ubaidullah bin Musa] dari [Isra`il] dari [As Suddi] dari [Yahya bin 'Abbad] dari [Anas bin Malik] ia berkata; \"Abu Thalhah memiliki tanggungan anak-anak yatim, kemudian ia membelikan khamer untuk mereka, katika turun pengharaman khamer, ia datang kepada Nabi shallallahu 'alaihi wasallam dan memberitahukan hal itu kepada beliau, lantas Abu Thalhah berkata; \"Apakah aku boleh menjadikannya cuka?\" Beliau bersabda: \"Tidak.\" Setelah itu Abu Thalhah menumpahkannya."
        },
        {
            "number": 2024,
            "arab": " أَخْبَرَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنَا الزُّهْرِيُّ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَرِبَ لَبَنًا وَعَنْ يَسَارِهِ أَبُو بَكْرٍ وَعَنْ يَمِينِهِ رَجُلٌ أَعْرَابِيٌّ فَأَعْطَى الْأَعْرَابِيَّ فَضْلَهُ ثُمَّ قَالَ الْأَيْمَنَ فَالْأَيْمَنَ",
            "id": "Telah mengabarkan kepada kami [Abu Al Mughirah] telah menceritakan kepada kami [Al Auza'i] telah menceritakan kepada kami [Az Zuhri] dari [Anas bin Malik] bahwa dia pernah melihat Rasulullah shallallahu 'alaihi wasallam meminum susu, sementara di sebelah kirinya terdapat Abu Bakr dan disebelah kanannya terdapat seorang arab badui, maka beliau memberikan sisanya kepada orang badui tersebut, beliau bersabda: \"(Dari) yang sebelah kanan kemudian yang sebelah kanan.\""
        },
        {
            "number": 2025,
            "arab": " أَخْبَرَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ أَخْبَرَنَا قَتَادَةُ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يُشْرَبَ مِنْ فِي السِّقَاءِ",
            "id": "Telah mengabarkan kepada kami ['Affan] telah menceritakan kepada kami [Hammad bin Salamah] telah mengabarkan kepada kami [Qatadah] dari [Ikrimah] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam melarang minum (langsung) dari mulut geriba.\""
        },
        {
            "number": 2026,
            "arab": " أَخْبَرَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا وُهَيْبٌ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ عِكْرِمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُشْرَبَ مِنْ فِي السِّقَاءِ",
            "id": "Telah mengabarkan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Wuhaib] dari [Khalid Al Hadzdza`] dari [Ikrimah] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang minum (langsung) dari mulut geriba.\" "
        },
        {
            "number": 2027,
            "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ اخْتِنَاثِ الْأَسْقِيَةِ",
            "id": "Telah mengabarkan kepada kami [Yazid bin Harun] dari [Ibnu Abu Dzi`b] dari [Az Zuhri] dari ['Ubaidullah bin Abdullah] dari [Abu Sa'id Al Khudri] bahwa Nabi shallallahu 'alaihi wasallam melarang memotong mulut bejana lalu minum (langsung) darinya.\""
        },
        {
            "number": 2028,
            "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا عَزْرَةُ بْنُ ثَابِتٍ عَنْ ثُمَامَةَ قَالَ كَانَ أَنَسٌ يَتَنَفَّسُ فِي الْإِنَاءِ مَرَّتَيْنِ أَوْ ثَلَاثًا وَزَعَمَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَنَفَّسُ فِي الْإِنَاءِ مَرَّتَيْنِ أَوْ ثَلَاثًا",
            "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami ['Azrah bin Tsabit] dari [Tsumamah] ia berkata; [Anas] bernafas dalam bejana dua atau tiga kali, dan mengira bahwa Rasulullah shallallahu 'alaihi wasallam pernah bernafas dalam bejana dua atau tiga kali (ketika minum).\""
        },
        {
            "number": 2029,
            "arab": " أَخْبَرَنَا إِسْحَقُ بْنُ عِيسَى عَنْ مَالِكٍ عَنْ أَيُّوبَ بْنِ حَبِيبٍ عَنْ الزُّهْرِيِّ عَنْ أَبِي الْمُثَنَّى قَالَ كُنْتُ عِنْدَ مَرْوَانَ فَجَاءَ أَبُو سَعِيدٍ فَقَالَ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ إِنِّي لَا أَرْوَى مِنْ نَفَسٍ وَاحِدٍ قَالَ فَأَبِنْ الْإِنَاءَ عَنْ فِيكَ ثُمَّ تَنَفَّسْ قَالَ إِنِّي أَرَى الْقَذَاةَ قَالَ أَهْرِقْهُ",
            "id": "Telah mengabarkan kepada kami [Ishaq bin Isa] dari [Malik] dari [Ayyub bin Habib] dari [Az Zuhri] dari [Abu Al Mutsanna] ia berkata; aku pernah berada di rumah Marwan, kemudian [Abu Sa'id] datang lalu berkata; seorang laki-laki berkata; \"Wahai Rasulullah, sesungguhnya aku tidak minum dengan satu nafas.\" Beliau lalu bersabda: \"Jauhkanlah bejana dari mulutmu, kemudian bernafaslah.\" Orang tersebut berkata; \"Ternyata setelah itu aku melihat kotoran.\" Beliau bersabda: \"Maka tuangkanlah.\""
        },
        {
            "number": 2030,
            "arab": " أَخْبَرَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ قَالَ حَدَّثَنِي أَبِي أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا بَالَ أَحَدُكُمْ فَلَا يَمَسَّ ذَكَرَهُ بِيَمِينِهِ وَلَا يَسْتَنْجِي بِيَمِينِهِ وَلَا يَتَنَفَّسْ فِي الْإِنَاءِ",
            "id": "Telah mengabarkan kepada kami [Abu Al Mughirah] telah menceritakan kepada kami [Al Auza'i] dari [Yahya] dari [Abdullah bin Abu Qatadah], ia berkata; telah menceritakan kepadaku [Ayahku] bahwa ia telah mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang diantara kalian kencing, hendaknya ia tidak memegang kemaluannya dengan tangan kanannya dan tidak cebok dengan tangan kanannya, serta janganlah ia bernafas dalam bejana.\""
        },
        {
            "number": 2031,
            "arab": " أَخْبَرَنَا إِسْحَقُ بْنُ عِيسَى حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ عَنْ سَعِيدِ بْنِ الْحَارِثِ الْأَنْصَارِيِّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ أَتَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا مِنْ الْأَنْصَارِ يَعُودُهُ وَجَدْوَلٌ يَجْرِي فَقَالَ إِنْ كَانَ عِنْدَكُمْ مَاءٌ بَاتَ فِي الشَّنِّ وَإِلَّا كَرَعْنَا",
            "id": "Telah mengabarkan kepada kami [Ishaq bin Isa] telah menceritakan kepada kami [Fulaih bin Sulaiman] dari [Sa'id bin Al Harits Al Anshari] dari [Jabir bin Abdullah] ia berkata; Nabi shallallahu 'alaihi wasallam datang mengunjungi seorang laki-laki dari kalangan Anshar, sementara sungai kecil mengalir (di dekatnya). Kemudian beliau bersabda: \"Seandainya kalian memiliki air dalam bejana, jika tidak maka kami akan meminumnya (langsung) dengan mulut kami.\""
        },
        {
            "number": 2032,
            "arab": " حَدَّثَنَا مَنْصُورُ بْنُ سَلَمَةَ الْخُزَاعِيُّ حَدَّثَنَا شَرِيكٌ عَنْ عَبْدِ الْكَرِيمِ عَنْ الْبَرَاءِ ابْنِ ابْنَةِ أَنَسٍ عَنْ أَنَسٍ عَنْ أُمِّ سُلَيْمٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَرِبَ مِنْ فَمِ قِرْبَةٍ قَائِمًا",
            "id": "Telah menceritakan kepada kami [Manshur bin Salamah Al Khuza'i] telah menceritakan kepada kami [Syarik] dari [Abdul Karim] dari [Al Bara`] cucu Anas, dari [Anas] dari [Ummu Sulaim] bahwa Nabi shallallahu 'alaihi wasallam minum dari mulut geriba sambil berdiri.\""
        },
        {
            "number": 2033,
            "arab": " حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ أَخْبَرَنَا عِمْرَانُ بْنُ حُدَيْرٍ عَنْ أَبِي الْبَزَرِيِّ يَزِيدَ بْنِ عُطَارِدَ عَنْ ابْنِ عُمَرَ قَالَ كُنَّا نَشْرَبُ وَنَحْنُ قِيَامٌ وَنَأْكُلُ وَنَحْنُ نَسْعَى عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ نَحْوَهُ",
            "id": "Telah menceritakan kepada kami [Utsman bin Umar] telah mengabarkan kepada kami [Imran bin Hudair] dari [Abu Al Bazari Yazid bin 'Utharid] dari [Ibnu Umar] ia berkata; \"Pada saman Rasulullah shallallahu 'alaihi wasallam, kami biasa minum sambil berdiri, dan makan sambil berjalan.\" Telah mengabarkan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Hafsh bin Ghiyats] dari ['Ubaidullah] dari [Nafi'] dari [Ibnu Umar] sama seperti hadits di atas."
        },
        {
            "number": 2034,
            "arab": " أَخْبَرَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الشُّرْبِ قَائِمًا قَالَ فَسَأَلْتُهُ عَنْ الْأَكْلِ فَقَالَ ذَاكَ أَخْبَثُ",
            "id": "Telah mengabarkan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami [Qatadah] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam melarang minum sambil berdiri.\" Anas berkata; kemudian aku bertanya kepada beliau mengenai makan, beliau bersabda: \"Itu lebih buruk lagi.\""
        },
        {
            "number": 2035,
            "arab": " أَخْبَرَنَا سَعِيدُ بْنُ الرَّبِيعِ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي زِيَادٍ الطَّحَّانِ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِرَجُلٍ رَآهُ يَشْرَبُ قَائِمًا قِئْ قَالَ لِمَ قَالَ أَتُحِبُّ أَنْ تَشْرَبَ مَعَ الْهِرِّ قَالَ لَا قَالَ فَقَدْ شَرِبَ مَعَكَ شَرٌّ مِنْهُ الشَّيْطَانُ",
            "id": "Telah mengabarkan kepada kami [Sa'id bin Ar Rabi'] telah menceritakan kepada kami [Syu'bah] dari [Abu Ziyad Ath Thahhan] ia berkata; aku mendengar [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda kepada seorang laki-laki yang beliau lihat sedang minum sambil berdiri: \"Muntahkanlah.\" Orang itu berkata; \"Kenapa?\" Beliau bersabda: \"Apakah kamu senang minum bersama kucing?\" laki-laki itu menjawab; \"Tidak.\" Beliau bersabda: \"Sungguh telah minum bersamamu sesuatu yang lebih buruk dari kucing yaitu Syetan.\""
        },
        {
            "number": 2036,
            "arab": " أَخْبَرَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ عَنْ نَافِعٍ عَنْ زَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ عَنْ أُمِّ سَلَمَةَ أَنَّهَا أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الَّذِي يَشْرَبُ فِي آنِيَةٍ مِنْ فِضَّةٍ فَإِنَّمَا يُجَرْجِرُ فِي بَطْنِهِ نَارَ جَهَنَّمَ",
            "id": "Telah mengabarkan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Laits bin Sa'd] dari [Nafi'] dari [Zaid bin Abdullah bin Umar] dari [Abdullah bin Abdurrahman bin Abu Bakr] dari [Ummu Salamah] bahwa ia mengabarkan kepadanya, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa minum dari bejana yang terbuat dari perak, sesungguhnya ia telah menuangkan api Jahannam ke dalam perutnya.\""
        },
        {
            "number": 2037,
            "arab": " حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ حَدَّثَنَا ابْنُ عَوْنٍ عَنْ مُجَاهِدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى قَالَ خَرَجْنَا مَعَ حُذَيْفَةَ إِلَى الْمَدَائِنِ فَاسْتَسْقَى فَأَتَاهُ دِهْقَانٌ بِإِنَاءٍ مِنْ فِضَّةٍ فَرَمَى بِهِ وَجْهَهُ فَقُلْنَا اسْكُتُوا فَإِنَّا إِنْ سَأَلْنَاهُ لَمْ يُحَدِّثْنَا فَلَمَّا كَانَ بَعْدُ قَالَ أَتَدْرُونَ لِمَ رَمَيْتُهُ قُلْنَا لَا قَالَ إِنِّي كُنْتُ نَهَيْتُهُ وَذَكَرَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى عَنْ الشُّرْبِ فِي آنِيَةِ الذَّهَبِ وَالْفِضَّةِ وَعَنْ لُبْسِ الْحَرِيرِ وَالدِّيبَاجِ وَقَالَ هُمَا لَهُمْ فِي الدُّنْيَا وَلَكُمْ فِي الْآخِرَةِ",
            "id": "Telah menceritakan kepada kami [Utsman bin Umar] telah menceritakan kepada kami [Ibnu 'Aun] dari [Mujahid] dari [Abdurrahman bin Abu Laila] ia berkata; kami pernah keluar bersama [Hudzaifah] menuju Madain, kemudian dia meminta air minum. Lantas Dihqan datang membawa bejana yang terbuat dari perak. Hudzaifah langsung melempar bejana tersebut ke wajahnya. Kami pun berkata; \"Diamlah kalian, sebab bila kita bertanya kepadanya, maka Hudzaifah tidak akan menceritakan kepada kita. Setelah itu, Hudzaifah berkata: \"Tahukah kalian, kenapa aku melemparnya?\" Kami menjawab: \"Tidak.\" Dia berkata; \"Sesungguhnya aku telah melarangnya....\" Abdurrahman bin Laila kemudian menyebutkan bahwa Nabi shallallahu 'alaihi wasallam telah melarang minum dari bejana yang terbuat dari emas dan perak, dan (melarang) mengenakan sutera dan dibaj (jenis sutera murni). Beliau bersabda: \"Keduanya adalah untuk mereka di dunia dan untuk kalian di Akhirat.\""
        },
        {
            "number": 2038,
            "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ حَدَّثَنِي جَابِرٌ قَالَ حَدَّثَنِي أَبُو حُمَيْدٍ السَّاعِدِيُّ قَالَ أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِلَبَنٍ فَقَالَ أَلَا خَمَّرْتَهُ وَلَوْ تَعْرِضُ عَلَيْهِ عُودًا",
            "id": "Telah mengabarkan kepada kami [Abu 'Ashim] dari [Ibnu Juraij] dari [Abu Az Zubair] telah menceritakan kepadaku [Jabir] ia berkata; telah menceritakan kepadaku [Abu Humaid As Sa'idi] ia berkata; aku datang kepada Rasulullah shallallahu 'alaihi wasallam membawa susu. Kemudian beliau bersabda: \"Tidakkah engkau menutupinya walau hanya menaruh dahan diatasnya?\""
        },
        {
            "number": 2039,
            "arab": " حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ عَنْ خَالِدٍ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِتَغْطِيَةِ الْوَضُوءِ وَإِيكَاءِ السِّقَاءِ وَإِكْفَاءِ الْإِنَاءِ",
            "id": "Telah menceritakan kepada kami ['Amr bin 'Aun] dari [Khalid] dari [Suhail] dari [Ayahnya] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam memerintahkan kami untuk menutupi (wadah) air untuk berwudhu, mengikat geriba, dan membalikkan bejana (apabila kosong).\""
        },
        {
            "number": 2040,
            "arab": " أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ أَيُّوبَ بْنِ حَبِيبٍ عَنْ أَبِي الْمُثَنَّى الْجُهَنِيِّ قَالَ قَالَ مَرْوَانُ لِأَبِي سَعِيدٍ الْخُدْرِيِّ هَلْ سَمِعْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنْ النَّفْخِ فِي الشَّرَابِ قَالَ نَعَمْ",
            "id": "Telah mengabarkan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Ayyub bin Habib] dari [Abu Al Mutsanna Al Juhani] ia berkata; Marwan pernah berkata kepada [Abu Sa'id Al Khudri]; \"Apakah kamu pernah mendengar Rasulullah shallallahu 'alaihi wasallam melarang untuk meniup air minum?\" Dia menjawab; \"Ya.\""
        },
        {
            "number": 2041,
            "arab": " أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ عَنْ ابْنِ عُيَيْنَةَ عَنْ عَبْدِ الْكَرِيمِ الْجَزَرِيِّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ النَّفْخِ فِي الشَّرَابِ",
            "id": "Telah mengabarkan kepada kami ['Amr bin 'Aun] dari [Ibnu 'Uyainah] dari [Abdul Karim Al Jazari] dari [Ikrimah] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam melarang meniup air minum.\""
        },
        {
            "number": 2042,
            "arab": " حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ وَسُلَيْمَانُ بْنُ الْمُغِيرَةِ عَنْ ثَابِتٍ عَنْ عَبْدِ اللَّهِ بْنِ رَبَاحٍ عَنْ أَبِي قَتَادَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَاقِي الْقَوْمِ آخِرُهُمْ شُرْبًا",
            "id": "Telah menceritakan kepada kami ['Affan bin Muslim] telah menceritakan kepada kami [Hammad bin Salamah] dan [Sulaiman bin Al Mughirah] dari [Tsabit] dari [Abdullah bin Rabah] dari [Abu Qatadah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang menuangkan air minum adalah orang yang teraikhir minum.\""
        }
    ]
}