{
    "kategori": "Kitab Zakat",
    "hadits": [
        {
            "number": 1563,
            "arab": " حَدَّثَنَا أَبُو عَاصِمٍ عَنْ زَكَرِيَّا بْنِ إِسْحَقَ عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ صَيْفِيٍّ عَنْ أَبِي مَعْبَدٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا بَعَثَ مُعَاذًا إِلَى الْيَمَنِ قَالَ إِنَّكَ تَأْتِي قَوْمًا أَهْلَ كِتَابٍ فَادْعُهُمْ إِلَى أَنْ يَشْهَدُوا أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ فَإِنْ أَطَاعُوا لَكَ فِي ذَلِكَ فَأَخْبِرْهُمْ أَنَّ اللَّهَ فَرَضَ عَلَيْهِمْ خَمْسَ صَلَوَاتٍ فِي كُلِّ يَوْمٍ وَلَيْلَةٍ فَإِنْ هُمْ أَطَاعُوا لَكَ فِي ذَلِكَ فَأَخْبِرْهُمْ أَنَّ اللَّهَ فَرَضَ عَلَيْهِمْ صَدَقَةً فِي أَمْوَالِهِمْ تُؤْخَذُ مِنْ أَغْنِيَائِهِمْ وَتُرَدُّ عَلَى فُقَرَائِهِمْ فَإِنْ هُمْ أَطَاعُوا لَكَ فِي ذَلِكَ فَإِيَّاكَ وَكَرَائِمَ أَمْوَالِهِمْ وَإِيَّاكَ وَدَعْوَةَ الْمَظْلُومِ فَإِنَّهُ لَيْسَ لَهَا مِنْ دُونِ اللَّهِ حِجَابٌ",
            "id": "Telah mengabarkan kepada kami [Abu 'Ashim] dari [Zakaria bin Ishaq] dari [Yahya bin Abdullah bin Shaifi] dari [Abu Ma'bad] dari [Ibnu Abbas], bahwa Nabi shallallahu 'alaihi wasallam saat mengutus Mu'adz ke Yaman, beliau bersabda: \"Sesungguhnya engkau akan datang kepada kaum ahli kitab, maka ajaklah mereka untuk bersaksi bahwa tidak ada tuhan yang berhak disembah kecuali Allah, dan Muhammad adalah Rasulullah. Kemudian jika mereka mentaatimu dalam hal itu maka kabarkanlah kepada mereka bahwa Allah mewajibkan atas mereka shalat lima waktu dalam setiap sehari semalam. Kemudian jika mereka mentaatimu dalam hal itu maka kabarkanlah kepada mereka bahwa Allah telah mewajibkan zakat pada harta mereka yang diambil dari orang-orang kaya mereka dan diberikan kepada orang-orang fakir mereka. Kemudian jika mereka mentaatimu dalam hal itu, maka jauhilah harta berharga mereka dan berhati-hatilah engkau terhadap doa orang yang terzhalimi, sesungguhnya tidak ada penghalang baginya dari Allah.\" "
        },
        {
            "number": 1564,
            "arab": " أَخْبَرَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا شُعْبَةُ عَنْ مُحَمَّدِ بْنِ زِيَادٍ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يُحَدِّثُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لَيْسَ الْمِسْكِينُ الَّذِي تَرُدُّهُ اللُّقْمَةُ وَاللُّقْمَتَانِ وَالْكِسْرَةُ وَالْكِسْرَتَانِ وَالتَّمْرَةُ وَالتَّمْرَتَانِ وَلَكِنْ الْمِسْكِينُ الَّذِي لَيْسَ لَهُ غِنًى يُغْنِيهِ يَسْتَحْيِي أَنْ يَسْأَلَ النَّاسَ إِلْحَافًا أَوْ لَا يَسْأَلُ النَّاسَ إِلْحَافًا",
            "id": "Telah mengabarkan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami [Syu'bah] dari [Muhammad bin Ziyad] ia berkata, saya mendengar [Abu Hurairah] menceritakan dari Nabi shallallahu 'alaihi wasallam, bahwa beliau bersabda: \"Orang miskin bukanlah orang yang tertolak untuk mendapatkan satu atau dua suap makanan, sepotong atau dua potong roti, sebutir atau dua butir kurma. Akan tetapi orang miskin adalah orang yang tidak memiliki sesuatu yang mencukupinya dan malu untuk meminta kepada manusia dengan mendesak, atau orang yang tidak meminta kepada manusia dengan mendesak.\" "
        },
        {
            "number": 1565,
            "arab": " أَخْبَرَنَا يَعْلَى بْنُ عُبَيْدٍ حَدَّثَنَا عَبْدُ الْمَلِكِ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ صَاحِبِ إِبِلٍ وَلَا بَقَرٍ وَلَا غَنَمٍ لَا يُؤَدِّي حَقَّهَا إِلَّا أُقْعِدَ لَهَا يَوْمَ الْقِيَامَةِ بِقَاعٍ قَرْقَرٍ تَطَؤُهُ ذَاتُ الظِّلْفِ بِظِلْفِهَا وَتَنْطَحُهُ ذَاتُ الْقَرْنِ بِقَرْنِهَا لَيْسَ فِيهَا يَوْمَئِذٍ جَمَّاءُ وَلَا مَكْسُورَةُ الْقَرْنِ قَالُوا يَا رَسُولَ اللَّهِ وَمَا حَقُّهَا قَالَ إِطْرَاقُ فَحْلِهَا وَإِعَارَةُ دَلْوِهَا وَمِنْحَتُهَا وَحَلَبُهَا عَلَى الْمَاءِ وَحَمْلٌ عَلَيْهَا فِي سَبِيلِ اللَّهِ",
            "id": "Telah mengabarkan kepada kami [Ya'la bin 'Ubaid] telah menceritakan kepada kami [Abdul Malik] dari [Abu Az Zubair] dari [Jabir] ia berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Tidaklah pemilik unta, sapi dan kambing yang tidak menunaikan haknya kecuali ia akan didudukkan di hadapan hewan tersebut pada Hari Kiamat di tanah terbuka yang datar, kemudian hewan yang memiliki sepatu akan menginjak dengan sepatunya dan yang memiliki tanduk akan menanduk dengan tanduknya. Pada saat itu tidak ada hewan yang tak bertanduk atau tidak ada hewan yang bertanduk patah.\" Mereka berkata, \"Wahai Rasulullah, apakah hak hewan-hewan tersebut?\" Beliau menjawab: \"Mengawinkan pejantannya, meminjamkan embernya, meminjamkannya (untuk diambil manfaatnya), memeras susunya setelah diberi minum dan memberinya muatan di jalan Allah.\""
        },
        {
            "number": 1566,
            "arab": " حَدَّثَنَا بِشْرُ بْنُ الْحَكَمِ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا مِنْ صَاحِبِ إِبِلٍ لَا يَفْعَلُ فِيهَا حَقَّهَا إِلَّا جَاءَ يَوْمَ الْقِيَامَةِ أَكْثَرُ مَا كَانَتْ قَطُّ وَأُقْعِدَ لَهَا بِقَاعٍ قَرْقَرٍ تَسْتَنُّ عَلَيْهِ بِقَوَائِمِهَا وَأَخْفَافِهَا وَلَا صَاحِبِ بَقَرٍ لَا يَفْعَلُ فِيهَا حَقَّهَا إِلَّا جَاءَ يَوْمَ الْقِيَامَةِ أَكْثَرُ مَا كَانَتْ قَطُّ وَأُقْعِدَ لَهَا بِقَاعٍ قَرْقَرٍ تَنْطَحُهُ بِقُرُونِهَا وَتَطَؤُهُ بِقَوَائِمِهَا وَلَا صَاحِبِ غَنَمٍ لَا يَفْعَلُ فِيهَا حَقَّهَا إِلَّا جَاءَ يَوْمَ الْقِيَامَةِ أَكْثَرُ مَا كَانَتْ وَأُقْعِدَ لَهَا بِقَاعٍ قَرْقَرٍ تَنْطَحُهُ بِقُرُونِهَا وَتَطَؤُهُ بِأَظْلَافِهَا لَيْسَ فِيهَا جَمَّاءُ وَلَا مَكْسُورَةٌ قَرْنُهَا وَلَا صَاحِبِ كَنْزٍ لَا يَفْعَلُ فِيهِ حَقَّهُ إِلَّا جَاءَ كَنْزُهُ يَوْمَ الْقِيَامَةِ شُجَاعًا أَقْرَعَ يَتْبَعُهُ فَاتِحًا فَاهُ فَإِذَا أَتَاهُ فَرَّ مِنْهُ فَيُنَادِيهِ خُذْ كَنْزَكَ الَّذِي خَبَّأْتَهُ قَالَ فَأَنَا عَنْهُ غَنِيٌّ فَإِذَا رَأَى أَنَّهُ لَا بُدَّ مِنْهُ سَلَكَ يَدَهُ فِي فَمِهِ فَيَقْضِمُهَا قَضْمَ الْفَحْلِ قَالَ أَبُو الزُّبَيْرِ سَمِعْتُ عُبَيْدَ بْنَ عُمَيْرٍ يَقُولُ هَذَا الْقَوْلَ ثُمَّ سَأَلْنَا جَابِرَ بْنَ عَبْدِ اللَّهِ فَقَالَ مِثْلَ قَوْلِ عُبَيْدِ بْنِ عُمَيْرٍ قَالَ وَقَالَ أَبُو الزُّبَيْرِ سَمِعْتُ عُبَيْدَ بْنَ عُمَيْرٍ يَقُولُ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ مَا حَقُّ الْإِبِلِ قَالَ حَلَبُهَا عَلَى الْمَاءِ وَإِعَارَةُ دَلْوِهَا وَإِعَارَةُ فَحْلِهَا وَمَنْحُهَا وَحَمْلٌ عَلَيْهَا فِي سَبِيلِ اللَّهِ أَخْبَرَنَا الْحَسَنُ بْنُ الرَّبِيعِ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ الْأَعْمَشِ عَنْ الْمَعْرُورِ بْنِ سُوَيْدٍ عَنْ أَبِي ذَرٍّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِبَعْضِ هَذَا الْحَدِيثِ",
            "id": "Telah menceritakan kepada kami [Bisyr bin Al Hakam] telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ibnu Juraij] ia berkata, telah mengabarkan kepadaku [Abu Az Zubair] bahwa ia mendengar [Jabir bin Abdullah] berkata, \"Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah pemilik unta yang tidak melakukan haknya melainkan ia akan datang pada hari Kiamat lebih banyak daripada dahulunya dan orang tersebut didudukkan di hadapannya pada tanah terbuka yang datar, hewan-hewan tersebut menyepak pemiliknya dengan kaki dan sepatunya. Dan tidaklah pemilik sapi yang tidak melakukan haknya kecuali melainkan ia akan datang pada hari Kiamat lebih banyak daripada dahulunya dan pemiliknya didudukkan di hadapannya pada tanah terbuka yang datar, hewan tersebut menanduknya dengan tanduknya dan menginjaknya dengan kaki-kakinya. Dan tidaklah pemilik kambing yang tidak melakukan haknya melainkan ia akan datang pada hari Kiamat lebih banyak daripada dahulunya dan pemiliknya di dudukkan di hadapannya pada tanah terbuka yang datar, hewan tersebut menanduknya dengan tanduknya dan menginjaknya dengan sepatu-sepatunya. Pada hari Kiamat tidak ada kambing yang tidak bertanduk dan tidak ada yang bertanduk patah. Dan tidaklah orang yang memiliki barang timbunan yang tidak melakukan haknya melainkan barang timbunannya akan datang pada hari Kiamat sebagai ular botak yang mengikutinya dengan membuka mulutnya. Apabila ular tersebut datang kepadanya, maka ia akan lari darinya, kemudian ular tersebut berseru kepadany, 'Ambillah barang timbunanmu yang telah engkau sembunyikan.' Pemiliknya berkata, 'Aku tidak butuh kepadanya.' Kemudian apabila ia melihat bahwa ia harus mengambilnya, maka ia memasukkan tangannya ke dalam mulutnya, kemudian ular tersebut mematahkannya dengan giginya sebagaimana pejantan menggigit menggunakan giginya.\" [Abu Az Zubair] berkata, \"Saya mendengar ['Ubaid bin 'Umair] mengatakan perkataan ini, maka kami pun bertanya kepada [Jabir bin Abdullah], dan ia juga mengatakan sebagaimana perkataan 'Ubaid bin 'Umair.\" Ibnu Juraij berkata, \" [Abu Az Zubair] berkata, \"Saya mendengar ['Ubaid bin 'Umair] berkata, \"Seorang laki-laki berkata, \"Wahai Rasulullah, apakah hak unta?\" Beliau menjawab: \"Memerahnya setelah memberi minum, meminjamkan embernya, meminjamkan pejantannya, meminjamkan (untuk diambil manfaatnya) dan memberinya muatan di jalan Allah.\" Telah mengabarkan kepada kami [Al Hasan bin Ar Rabi'] telah menceritakan kepada kami [Abu Al Ahwash] dari [Al A'masy] dari [Al Ma'rur bin Suwaid] dari [Abu Dzar] dari Nabi shallallahu 'alaihi wasallam dengan sebagian hadits ini.\" "
        },
        {
            "number": 1567,
            "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ وَإِبْرَاهِيمُ بْنُ صَدَقَةَ عَنْ سُفْيَانَ بْنِ حُسَيْنٍ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ الصَّدَقَةَ فَكَانَ فِي الْغَنَمِ فِي كُلِّ أَرْبَعِينَ سَائِمَةً شَاةٌ إِلَى عِشْرِينَ وَمِائَةٍ فَإِذَا زَادَتْ فَفِيهَا شَاتَانِ إِلَى مِائَتَيْنِ فَإِذَا زَادَتْ فَفِيهَا ثَلَاثُ شِيَاهٍ إِلَى ثَلَاثِ مِائَةٍ فَإِذَا زَادَتْ شَاةً لَمْ يَجِبْ فِيهَا إِلَّا ثَلَاثُ شِيَاهٍ حَتَّى تَبْلُغَ أَرْبَعَ مِائَةٍ فَإِذَا بَلَغَتْ أَرْبَعَ مِائَةِ شَاةٍ فَفِي كُلِّ مِائَةٍ شَاةٌ وَلَا تُؤْخَذُ فِي الصَّدَقَةِ هَرِمَةٌ وَلَا ذَاتُ عَوَارٍ وَلَا ذَاتُ عَيْبٍ",
            "id": "Telah mengabarkan kepada kami [Al Hakam bin Al Mubarak] telah menceritakan kepada kami ['Abbad bin Al 'Awwam] dan [Ibrahim bin Shadaqah] dari [Sufyan bin Husain] dari [Az Zuhri] dari [Salim] dari [Ibnu Umar], bahwa Nabi shallallahu 'alaihi wasallam telah menetapkan tentang zakat: \"Pada kambing setiap empat puluh hingga seratus dua puluh ekor yang digembala terdapat satu ekor sebagai zakat, jika ada kelebihan hingga jumlah dua ratus ekor maka zakatnya adalah dua ekor, jika ada kelebihan hingga jumlah tiga ratus ekor maka zakatnya adalah tiga ekor kambing. Jika jumlahlah lebih satu ekor dari jumlah tiga ratus ekor, maka tidak ada zakat hingga penambahan itu hingga sampai jumlah empat ratus. Dan jika telah mencapai empat ratus ekor kambing, maka pada setiap seratus terdapat zakat satu ekor kambing, dan dalam zakat tidak diambil kambing yang tua, bukan kambing yang telah tanggal giginya, atau kambing yang memiliki aib.\" "
        },
        {
            "number": 1568,
            "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ مُوسَى حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ الْخَوْلَانِيِّ عَنْ الزُّهْرِيِّ عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ إِلَى أَهْلِ الْيَمَنِ مَعَ عَمْرِو بْنِ حَزْمٍ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ مِنْ مُحَمَّدٍ النَّبِيِّ إِلَى شُرَحْبِيلَ بْنِ عَبْدِ كُلَالٍ وَالْحَارِثِ بْنِ عَبْدِ كُلَالٍ وَنُعَيْمِ بْنِ عَبْدِ كُلَالٍ فِي أَرْبَعِينَ شَاةً شَاةٌ إِلَى أَنْ تَبْلُغَ عِشْرِينَ وَمِائَةٍ فَإِذَا زَادَتْ عَلَى عِشْرِينَ وَمِائَةٍ وَاحِدَةً فَفِيهَا شَاتَانِ إِلَى أَنْ تَبْلُغَ مِائَتَيْنِ فَإِذَا زَادَتْ وَاحِدَةً فَفِيهَا ثَلَاثَةٌ إِلَى أَنْ تَبْلُغَ ثَلَاثَ مِائَةٍ فَمَا زَادَ فَفِي كُلِّ مِائَةِ شَاةٍ شَاةٌ حَدَّثَنَا بِشْرُ بْنُ الْحَكَمِ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ لَهُمْ كِتَابًا فَذَكَرَ نَحْوَهُ",
            "id": "Telah mengabarkan kepada kami [Al Hakam bin Musa] telah menceritakan kepada kami [Yahya bin Hamzah] dari [Sulaiman bin Daud Al Khaulani] dari [Az Zuhri] dari [Abu Bakr bin Muhammad bin 'Amru bin Hazm] dari [Ayahnya] dari [Kakeknya], bahwa Rasulullah shallallahu 'alaihi wasallam telah menulis surat kepada penduduk Yaman yang dibawa bersama 'Amru bin Hazm: \"Bismillaahirrahmaanirrahiim. Dari Muhammad seorang Nabi kepada Syurahbil bin Abdu Kulal, Al Harits bin Abdu Kulal, dan Nu'aim bin Abdu Kulal; pada setiap empat puluh ekor kambing hingga mencapai seratus dua puluh terdapat zakat satu ekor kambing, kemudian apabila melebihi seratus dua puluh hingga dua ratus maka padanya terdapat zakat dua ekor kambing, kemudian apabila lebih dari satu hingga tiga ratus maka padanya terdapat zakat tiga ekor, dan selebihnya maka pada setiap seratus ekor kambing terdapat zakat satu ekor kambing.\" Telah menceritakan kepada kami [Bisyr bin Al Hakam] telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ma'mar] dari [Abdullah bin Abu Bakr bin Muhammad bin 'Amru bin Hazm] dari [Ayahnya] dari [Kakeknya], bahwa Nabi shallallahu 'alaihi wasallam telah menulis untuk mereka…kemudian ia menyebutkan seperti itu.\" "
        },
        {
            "number": 1569,
            "arab": " حَدَّثَنَا يَعْلَى بْنُ عُبَيْدٍ حَدَّثَنَا الْأَعْمَشُ عَنْ شَقِيقٍ عَنْ مَسْرُوقٍ وَالْأَعْمَشُ عَنْ إِبْرَاهِيمَ قَالَا قَالَ مُعَاذٌ بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْيَمَنِ فَأَمَرَنِي أَنْ آخُذَ مِنْ كُلِّ أَرْبَعِينَ بَقَرَةً مُسِنَّةً وَمِنْ كُلِّ ثَلَاثِينَ تَبِيعًا أَوْ تَبِيعَةً",
            "id": "Telah menceritakan kepada kami [Ya'la bin 'Ubaid] telah menceritakan kepada kami [Al A'masy] dari [Syaqiq] dari [Masruq] serta [Al A'masy] dari [Ibrahim] mereka berkata, [Mu'adz] berkata, \"Rasulullah shallallahu 'alaihi wasallam mengutusku ke Yaman dan memerintahkanku untuk mengambil dari setiap empat puluh ekor sapi satu ekor musinnah, dan dari setiap tiga puluh ekor satu tabi' atau tabi'ah.\" "
        },
        {
            "number": 1570,
            "arab": " أَخْبَرَنَا عَاصِمُ بْنُ يُوسُفَ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ عَاصِمٍ عَنْ أَبِي وَائِلٍ عَنْ مَسْرُوقٍ عَنْ مُعَاذٍ قَالَ بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْيَمَنِ فَأَمَرَنِي أَنْ آخُذَ مِنْ الْبَقَرِ مِنْ ثَلَاثِينَ تَبِيعًا حَوْلِيًّا وَمِنْ أَرْبَعِينَ بَقَرَةً مُسِنَّةً حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ عَنْ أَبِي بَكْرِ بْنِ عَيَّاشٍ بِنَحْوِهِ",
            "id": "Telah mengabarkan kepada kami ['Ashim bin Yusuf] telah menceritakan kepada kami [Abu Bakr bin 'Ayyasy] dari ['Ashim] dari [Abu Wail] dari [Masruq] dari [Mu'adz] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam mengutusku ke Yaman, kemudian beliau memerintahkanku agar mengambil sapi dari setiap jumlah tiga puluh ekor satu ekor tabi', dan dari setiap empat puluh ekor sapi satu ekor musinnah.\" Telah menceritakan kepada kami [Ahmad bin Yunus] dari [Abu Bakr bin 'Ayyasy] dengan seperti itu.\" "
        },
        {
            "number": 1571,
            "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ وَإِبْرَاهِيمُ بْنُ صَدَقَةَ عَنْ سُفْيَانَ بْنِ حُسَيْنٍ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ الصَّدَقَةَ فَلَمْ تُخْرَجْ إِلَى عُمَّالِهِ حَتَّى قُبِضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا قُبِضَ أَخَذَهَا أَبُو بَكْرٍ فَعَمِلَ بِهَا مِنْ بَعْدِهِ فَلَمَّا قُبِضَ أَبُو بَكْرٍ أَخَذَهَا عُمَرُ فَعَمِلَ بِهَا مِنْ بَعْدِهِمَا وَلَقَدْ قُتِلَ عُمَرُ وَإِنَّهَا لَمَقْرُونَةٌ بِسَيْفِهِ أَوْ بِوَصِيَّتِهِ وَكَانَ فِي صَدَقَةِ الْإِبِلِ فِي كُلِّ خَمْسٍ شَاةٌ إِلَى خَمْسٍ وَعِشْرِينَ فَإِذَا بَلَغَتْ خَمْسًا وَعِشْرِينَ فَفِيهَا بِنْتُ مَخَاضٍ إِلَى خَمْسٍ وَثَلَاثِينَ فَإِنْ لَمْ تَكُنْ بِنْتُ مَخَاضٍ فَابْنُ لَبُونٍ ذَكَرٌ فَإِذَا زَادَتْ فَفِيهَا بِنْتُ لَبُونٍ إِلَى خَمْسٍ وَأَرْبَعِينَ فَإِذَا زَادَتْ فَفِيهَا حِقَّةٌ إِلَى سِتِّينَ فَإِذَا زَادَتْ فَفِيهَا جَذَعَةٌ إِلَى خَمْسٍ وَسَبْعِينَ فَإِذَا زَادَتْ فَفِيهَا بِنْتَا لَبُونٍ إِلَى تِسْعِينَ فَإِذَا زَادَتْ فَفِيهَا حِقَّتَانِ إِلَى عِشْرِينَ وَمِائَةٍ فَإِذَا زَادَتْ فَفِيهَا فِي كُلِّ خَمْسِينَ حِقَّةٌ وَفِي كُلِّ أَرْبَعِينَ بِنْتُ لَبُونٍ حَدَّثَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ عَنْ أَبِي إِسْحَقَ الْفَزَارِيِّ عَنْ سُفْيَانَ بْنِ حُسَيْنٍ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
            "id": "Telah mengabarkan kepada kami [Al Hakam bin Al Mubarak] telah menceritakan kepada kami ['Abbad bin Al Awwam] dan [Ibrahim bin Shadaqah] dari [Sufyan bin Husain] dari [Az Zuhri] dari [Salim] dari [Ibnu Umar], bahwa Nabi shallallahu 'alaihi wasallam telah menetapkan hukum zakat, namun belum disampaikan kepada para petugasnya hingga Rasulullah shallallahu 'alaihi wasallam meninggal. Maka ketika beliau telah meninggal catatan tersebut diambil Abu Bakr, dan ia melaksanakannya sepeninggal beliau. Kemudian tatkala Abu Bakr meninggal, maka Umar mengambilnya dan melaksanakannya setelah mereka berdua, dan ketika Umar terbunuh, maka sungguh catatan tersebut disertakan pada pedangnya atau pada wasiatnya. Mengenai zakat unta, maka pada setiap lima ekor hingga dua puluh lima terdapat zakat satu ekor kambing. Jika telah mencapai dua puluh lima hingga tiga puluh lima, maka zakatnya adalah Bintu Makhadl, jika tidak ada Bintu Makhadl maka Ibnu Labun jantan. Jika lebih hingga mencapai jumlah empat puluh lima, maka zakatnya adalah satu ekor Bintu Labun. Jika lebih hingga sejumlah enam puluh, maka zakatnya adalah satu Hiqqah. Jika lebih hingga sejumlah tujuh puluh lima, maka zakatnya adalah Jadza'ah. Jika lebih hingga sejumlah sembilan puluh, maka zakatnya adalah dua ekor Bintu Labun. Jika lebih hingga sejumlah seratus dua puluh, maka zakatnya adalah dua ekor Hiqqah. Jika lebih, maka pada setiap penambahan lima puluh terdapat zakat satu hiqqah, dan setiap empat puluh satu ekor bintu labun.\" Telah menceritakan kepada kami [Muhammad bin 'Uyainah] dari [Abu Ishaq Al Fazari] dari [Sufyan bin Husain] dari [Az Zuhri] dari [Salim] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam seperti itu.\" "
        },
        {
            "number": 1572,
            "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ مُوسَى حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ الْخَوْلَانِيِّ حَدَّثَنِي الزُّهْرِيُّ عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ مَعَ عَمْرِو بْنِ حَزْمٍ إِلَى شُرَحْبِيلَ بْنِ عَبْدِ كُلَالٍ وَالْحَارِثِ بْنِ عَبْدِ كُلَالٍ وَنُعَيْمِ بْنِ عَبْدِ كُلَالٍ إِنَّ فِي كُلِّ خَمْسِ أَوَاقٍ مِنْ الْوَرِقِ خَمْسَةَ دَرَاهِمَ فَمَا زَادَ فَفِي كُلِّ أَرْبَعِينَ دِرْهَمًا دِرْهَمٌ وَلَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ شَيْءٌ",
            "id": "Telah mengabarkan kepada kami [Al Hakam bin Musa] telah menceritakan kepada kami [Yahya bin Hamzah] dari [Sulaiman bin Daud Al Khaulani] telah menceritakan kepadaku [Az Zuhri] dari [Abu Bakr bin Muhammad bin 'Amru bin Hazm] dari [Ayahnya] dari [Kakeknya], bahwa Rasulullah shallallahu 'alaihi wasallam menulis surat dititipkan kepada 'Amru bin Hazm untuk ditujukan kepada Syurahbil bin Abdu Kulal, Al Harits bin Abdu Kulal, dan Nu'aim bin Abdu Kulal, yakni bahwa pada setiap lima uqiyah perak terdapat zakat lima dirham, jika ada lebih maka pada setiap empat puluh dirham adalah satu dirham, dan yang kurang dari lima uqiyah tidak ada kewajiban zakat padanya.\" "
        },
        {
            "number": 1573,
            "arab": " أَخْبَرَنَا الْمُعَلَّى بْنُ أَسَدٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ أَبِي إِسْحَقَ عَنْ عَاصِمِ بْنِ ضَمْرَةَ عَنْ عَلِيٍّ رَفَعَهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عَفَوْتُ عَنْ صَدَقَةِ الْخَيْلِ وَالرَّقِيقِ هَاتُوا صَدَقَةَ الرِّقَةِ مِنْ كُلِّ أَرْبَعِينَ دِرْهَمًا دِرْهَمٌ وَلَيْسَ فِي تِسْعِينَ وَمِائَةٍ شَيْءٌ حَتَّى تَبْلُغَ مِائَتَيْنِ",
            "id": "Telah mengabarkan kepada kami [Al Mu'alla bin Asad] telah menceritakan kepada kami [Abu 'Awanah] dari [Abu Ishaq] dari ['Ashim bin Dlamrah] dari [Ali] dan ia merafa'kannya kepada Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Aku telah memaafkan dari zakat kuda dan budak. Maka berikanlah zakat perak, pada setiap empat puluh dirham sebanyak satu dirham, dan pada seratus sembilan puluh tidak ada kewajiban zakat, sehingga mencapai dua ratus.\""
        },
        {
            "number": 1574,
            "arab": " أَخْبَرَنَا الْأَسْوَدُ بْنُ عَامِرٍ حَدَّثَنَا شَرِيكٌ عَنْ عُثْمَانَ الثَّقَفِيِّ عَنْ أَبِي لَيْلَى هُوَ الْكِنْدِيُّ عَنْ سُوَيْدِ بْنِ غَفَلَةَ قَالَ أَتَانَا مُصَدِّقُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخَذْتُ بِيَدِهِ فَقَرَأْتُ فِي عَهْدِهِ أَنْ لَا يُجْمَعَ بَيْنَ مُتَفَرِّقٍ وَلَا يُفَرَّقَ بَيْنَ مُجْتَمِعٍ خَشْيَةَ الصَّدَقَةِ",
            "id": "Telah mengabarkan kepada kami [Al Aswad bin 'Amir] telah menceritakan kepada kami [Syarik] dari [Utsman Ats Tsaqafi] dari [Abu Laila] -yaitu Al Kindi- dari [Suwaid bin Ghafalah] ia berkata, \" [Petugas zakat Nabi shallallahu 'alaihi wasallam] datang kepada kami, kemudian aku gandeng tangannya dan aku baca pada perjanjiannya, 'Tidak boleh digabungkan antara hewan yang terpisah, dan tidak boleh dipisahkan antara hewan yang digabungkan karena khawatir membayar zakat.\""
        },
        {
            "number": 1575,
            "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ عَنْ زَكَرِيَّا عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ صَيْفِيٍّ عَنْ أَبِي مَعْبَدٍ مَوْلَى ابْنِ عَبَّاسٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا بَعَثَ مُعَاذًا إِلَى الْيَمَنِ قَالَ إِيَّاكَ وَكَرَائِمَ أَمْوَالِهِمْ",
            "id": "Telah mengabarkan kepada kami [Abu 'Ashim] dari [Zakaria] dari [Yahya bin Abdullah bin Shaifi] dari [Abu Ma'bad] mantan budak Ibnu Abbas, dari [Ibnu Abbas], bahwa saat Nabi shallallahu 'alaihi wasallam mengutus Mu'adz ke Yaman, beliau bersabda: \"Jauhilah harta berharga mereka.\""
        },
        {
            "number": 1576,
            "arab": " حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا شُعْبَةُ قَالَ عَبْدُ اللَّهِ بْنُ دِينَارٍ أَخْبَرَنِي قَالَ سَمِعْتُ سُلَيْمَانَ بْنَ يَسَارٍ يُحَدِّثُ عَنْ عِرَاكِ بْنِ مَالِكٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ عَلَى فَرَسِ الْمُسْلِمِ وَلَا عَلَى غُلَامِهِ صَدَقَةٌ",
            "id": "Telah menceritakan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami [Syu'bah] ia berkata, [Abdullah bin Dinar] telah mengabarkan kepadaku, ia berkata; saya mendengar [Sulaiman bin Yasar] menceritakan dari ['Irak bin Malik] dari [Abu Hurairah], dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Seorang Muslim tidak ada kewajiban mengeluarkan zakat pada kuda dan budaknya.\" "
        },
        {
            "number": 1577,
            "arab": " حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ سُفْيَانَ عَنْ عَمْرِو بْنِ يَحْيَى عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ صَدَقَةٌ وَلَا فِيمَا دُونَ خَمْسِ أَوَاقٍ صَدَقَةٌ وَلَا فِيمَا دُونَ خَمْسِ ذَوْدٍ صَدَقَةٌ قَالَ أَبُو مُحَمَّد الْوَسْقُ سِتُّونَ صَاعًا وَالصَّاعُ مَنَوَانِ وَنِصْفٌ فِي قَوْلِ أَهْلِ الْحِجَازِ وَأَرْبَعَةُ أَمْنَاءٍ فِي قَوْلِ أَهْلِ الْعِرَاقِ",
            "id": "Telah menceritakan kepada kami ['Ubaidullah bin Musa] dari [Sufyan] dari ['Amru bin Yahya] dari [Ayahnya] dari [Abu Sa'id Al Khudri] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak ada zakat pada biji-bijian serta kurma yang kurang dari lima wasaq, dan tidak ada zakat pada perak yang kurang dari lima uqiyah, dan tidak ada zakat pada unta yang kurang dari lima dzaud.\" Abu Muhammad berkata, \"Satu wasaq adalah enam puluh sha', dan satu sha' adalah dua setengah Mana (nama timbangan) menurut pendapat penduduk Hijaz, dan empat Mana menurut pendapat penduduk Irak.\" "
        },
        {
            "number": 1578,
            "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ يَحْيَى بْنِ عُمَارَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ صَدَقَةٌ مِنْ حَبٍّ وَلَا تَمْرٍ وَلَا فِيمَا دُونَ خَمْسِ أَوَاقٍ صَدَقَةٌ وَلَا فِيمَا دُونَ خَمْسِ ذَوْدٍ صَدَقَةٌ",
            "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] dari [Sufyan] dari [Isma'il bin Umayyah] dari [Muhammad bin Yahya bin Habban] dari [Yahya bin 'Umarah] dari [Abu Sa'id Al Khudri] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada zakat pada biji-bijian serta kurma yang kurang dari lima wasaq, dan tidak ada zakat pada perak yang kurang dari lima uqiyah, dan tidak ada zakat pada unta yang kurang dari lima dzaud.\" "
        },
        {
            "number": 1579,
            "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ مُوسَى حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ الْخَوْلَانِيِّ حَدَّثَنِي الزُّهْرِيُّ عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ مَعَ عَمْرِو بْنِ حَزْمٍ إِلَى شُرَحْبِيلَ بْنِ عَبْدِ كُلَالٍ وَالْحَارِثِ بْنِ عَبْدِ كُلَالٍ وَنُعَيْمِ بْنِ عَبْدِ كُلَالٍ إِنَّ فِي كُلِّ خَمْسِ أَوَاقٍ مِنْ الْوَرِقِ خَمْسَةَ دَرَاهِمَ فَمَا زَادَ فَفِي كُلِّ أَرْبَعِينَ دِرْهَمًا دِرْهَمٌ وَلَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ شَيْءٌ",
            "id": "Telah mengabarkan kepada kami [Al Hakam bin Musa] telah menceritakan kepada kami [Yahya bin Hamzah] dari [Sulaiman bin Daud Al Khaulani] telah menceritakan kepadaku [Az Zuhri] dari [Abu Bakr bin Muhammad bin 'Amru bin Hazm] dari [Ayahnya] dari [Kakeknya], bahwa Rasulullah shallallahu 'alaihi wasallam menulis surat yang dititipkan kepada 'Amru bin Hazm untuk ditujukan kepada Syurahbil bin 'Abdu Kulal, Al Harits bin Abdu Kulal, serta Nu'aim bin Abdu Kulal, bahwa pada setiap lima wasaq perak terdapat zakat lima dirham, jika ada kelebihan maka pada setiap empat puluh dirham terdapat zakat satu dirham, dan yang kurang dari lima wasaq tidak ada zakat padanya.\" "
        },
        {
            "number": 1580,
            "arab": " أَخْبَرَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ زَكَرِيَّا عَنْ الْحَجَّاجِ بْنِ دِينَارٍ عَنْ الْحَكَمِ بْنِ عُتَيْبَةَ عَنْ حُجَيَّةَ بْنِ عَدِيٍّ عَنْ عَلِيٍّ أَنَّ الْعَبَّاسَ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي تَعْجِيلِ صَدَقَتِهِ قَبْلَ أَنْ تَحِلَّ فَرَخَّصَ فِي ذَلِكَ قَالَ أَبُو مُحَمَّد آخُذُ بِهِ وَلَا أَرَى فِي تَعْجِيلِ الزَّكَاةِ بَأْسًا",
            "id": "Telah mengabarkan kepada kami [Sa'id? bin Manshur] telah menceritakan kepada kami [Isma'il bin Zakaria] dari [Al Hajjaj bin Dinar] dari [Al Hakam bin 'Utaibah] dari [Hujayyah bin 'Adi] dari [Ali], bahwa Al Abbas bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang hukum menyegerakan dalam memberikan zakat sebelum wajib. Kemudian beliau memberikan keringanan dalam hal tersebut.\" Abu Muhammad berkata, \"Aku mengamalkan hadits tersebut, dan menyegerakan zakat tidak ada masalah.\" "
        },
        {
            "number": 1581,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ الطُّفَيْلِ حَدَّثَنَا شَرِيكٌ عَنْ أَبِي حَمْزَةَ عَنْ عَامِرٍ عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ فِي أَمْوَالِكُمْ حَقًّا سِوَى الزَّكَاةِ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Ath Thufail] telah menceritakan kepada kami [Syarik] dari [Abu Hamzah] dari ['Amir] dari [Fatimah binti Qais] ia berkata, \"Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya di dalam harta kalian terdapat hak selain zakat.\""
        },
        {
            "number": 1582,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا إِسْرَائِيلُ حَدَّثَنَا أَبُو الْجُوَيْرِيَةِ الْجَرْمِيُّ أَنَّ مَعْنَ بْنَ يَزِيدَ حَدَّثَهُ قَالَ بَايَعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا وَأَبِي وَجَدِّي وَخَطَبَ عَلَيَّ فَأَنْكَحَنِي وَخَاصَمْتُ إِلَيْهِ كَانَ أَبِي يَزِيدُ أَخْرَجَ دَنَانِيرَ يَتَصَدَّقُ بِهَا فَوَضَعَهَا عِنْدَ رَجُلٍ فِي الْمَسْجِدِ فَجِئْتُ فَأَخَذْتُهَا فَأَتَيْتُهُ بِهَا فَقَالَ وَاللَّهِ مَا إِيَّاكَ أَرَدْتُ بِهَا فَخَاصَمْتُهُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَكَ مَا نَوَيْتَ يَا يَزِيدُ وَلَكَ يَا مَعْنُ مَا أَخَذْتَ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Israil] telah menceritakan kepada kami [Abu Al Juwairiyah Al Jurmi] bahwa [Ma'n bin Yazid] telah menceritakan kepadanya, ia berkata, \"Aku bersama bapak dan kakekku membaiat Rasulullah shallallahu 'alaihi wasallam. Ayahku lalu meminang dan menikahkan aku. Dan aku juga mengajukan perkara kepada Rasulullah shallallahu 'alaihi wasallam; ayahku yang bernama Yazid pernah mengeluarkan beberapa dinar untuk bersedekah, kemudian ia meletakkannya pada seorang laki-laki di masjid. Aku lalu datang dan mengambilnya, kemudian aku membawa uang tersebut kepadanya. Maka ia pun berkata, \"Demi Allah, bukan engkau yang aku inginkan dengan sedekah itu! \" Kemudian aku mengajukan perkara tersebut kepada Rasulullah shallallahu 'alaihi wasallam, beliau pun bersabda: \"Bagimu apa yang telah engkau niatkan wahai Yazid dan untukmu apa yang telah engkau ambil wahai Ma'n.\""
        },
        {
            "number": 1583,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ وَأَبُو نُعَيْمٍ عَنْ سُفْيَانَ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ رَيْحَانَ بْنِ يَزِيدَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَحِلُّ الصَّدَقَةُ لِغَنِيٍّ وَلَا لِذِي مِرَّةٍ سَوِيٍّ قَالَ أَبُو مُحَمَّد يَعْنِي قَوِيٍّ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dan [Abu Nu'aim] dari [Sufyan] dari [Sa'd bin Ibrahim] dari [Raihan bin Yazid] dari [Abdullah bin 'Amru] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal sedekah bagi orang kaya dan orang sehat yang kuat.\" Abu Muhammad berkata, \"Yaitu orang yang kuat.\" "
        },
        {
            "number": 1584,
            "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا شَرِيكٌ عَنْ حَكِيمِ بْنِ جُبَيْرٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ سَأَلَ عَنْ ظَهْرِ غِنًى جَاءَ يَوْمَ الْقِيَامَةِ وَفِي وَجْهِهِ خُمُوشٌ أَوْ كُدُوحٌ أَوْ خُدُوشٌ قِيلَ يَا رَسُولَ اللَّهِ وَمَا الْغِنَى قَالَ خَمْسُونَ دِرْهَمًا أَوْ قِيمَتُهَا مِنْ الذَّهَبِ أَخْبَرَنَا أَبُو عَاصِمٍ وَمُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ حَكِيمِ بْنِ جُبَيْرٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ",
            "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Syarik] dari [Hakim bin Jubair] dari [Muhammad bin Abdurrahman bin Yazid] dari [Ayahnya] dari [Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa meminta-minta sementara ia memiliki kelebihan, maka pada hari Kiamat ia akan datang dalam keadaan pada wajahnya terdapat luka cakaran.\" Rasulullah shallallahu 'alaihi wasallam ditanya, \"Wahai Rasulullah, berapakah kecukupan tersebut?\" Beliau bersabda: \"Lima puluh dirham, atau emas yang senilai dengannya.\" Telah mengabarkan kepada kami [Abu 'Ashim] dan [Muhammad bin Yusuf] dari [Sufyan] dari [Hakim bin Jubair] dari [Muhammad bin Abdurrahman] dari [Ayahnya] dari [Abdullah] dari Nabi shallallahu 'alaihi wasallam dengan seperti hadits tersebut.\" "
        },
        {
            "number": 1585,
            "arab": " أَخْبَرَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا شُعْبَةُ أَخْبَرَنِي مُحَمَّدُ بْنُ زِيَادٍ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ قَالَ أَخَذَ الْحَسَنُ تَمْرَةً مِنْ تَمْرِ الصَّدَقَةِ فَجَعَلَهَا فِي فِيهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كِخْ كِخْ أَلْقِهَا أَمَا شَعَرْتَ أَنَّا لَا نَأْكُلُ الصَّدَقَةَ",
            "id": "Telah mengabarkan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami [Syu'bah] telah mengabarkan kepadaku [Muhammad bin Ziyad] ia berkata, saya mendengar [Abu Hurairah] berkata, \"Al Hasan mengambil satu biji dari kurma zakat dan memasukkannya ke dalam mulutnya, maka Nabi shallallahu 'alaihi wasallam pun bersabda: \"Kikh, kikh, buang! Tidakkah engkau merasa bahwa kita tidak makan sedekah?\""
        },
        {
            "number": 1586,
            "arab": " أَخْبَرَنَا الْأَسْوَدُ بْنُ عَامِرٍ حَدَّثَنَا زُهَيْرٌ عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى عَنْ عِيسَى عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ أَبِي لَيْلَى قَالَ كُنْتُ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعِنْدَهُ الْحَسَنُ بْنُ عَلِيٍّ فَأَخَذَ تَمْرَةً مِنْ تَمْرِ الصَّدَقَةِ فَانْتَزَعَهَا مِنْهُ وَقَالَ أَمَا عَلِمْتَ أَنَّهُ لَا تَحِلُّ لَنَا الصَّدَقَةُ",
            "id": "Telah mengabarkan kepada kami [Al Aswad bin 'Amir] telah menceritakan kepada kami [Zuhair] dari [Abdullah bin Isa] dari [Isa] dari [Abdurrahman bin Abu Laila] dari [Abu Laila] ia berkata, \"Aku pernah bersama Nabi shallallahu 'alaihi wasallam dan di sisi beliau terdapat Al Hasan bin Ali, kemudian ia mengambil satu biji kurma zakat, maka beliau mengambil kurma tersebut darinya dan berkata: \"Tidakkah engkau mengetahui bahwa sedekah tidak halal bagi kita?\""
        },
        {
            "number": 1587,
            "arab": " أَخْبَرَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ وَهْبِ بْنِ مُنَبِّهٍ عَنْ أَخِيهِ عَنْ مُعَاوِيَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُلْحِفُوا بِي فِي الْمَسْأَلَةِ فَوَاللَّهِ لَا يَسْأَلُنِي أَحَدٌ شَيْئًا فَأُعْطِيَهُ وَأَنَا كَارِهٌ فَيُبَارَكَ لَهُ فِيهِ",
            "id": "Telah mengabarkan kepada kami [Sa'id? bin Manshur] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari ['Amru bin Dinar] dari [Wahb bin Munabbih] dari [Saudaranya] dari [Mu'awiyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian mendesakku dalam meminta! Demi Allah, seseorang meminta sesuatu kepadaku kemudian aku memberinya, sementara aku tidak suka, lalu ia diberi berkah di dalamnya.\" "
        },
        {
            "number": 1588,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرَّقَاشِيُّ حَدَّثَنَا يَزِيدُ هُوَ ابْنُ زُرَيْعٍ أَخْبَرَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ عَنْ ثَوْبَانَ مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ سَأَلَ النَّاسَ مَسْأَلَةً وَهُوَ عَنْهَا غَنِيٌّ كَانَتْ شَيْنًا فِي وَجْهِهِ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah Ar Raqasyi] telah menceritakan kepada kami [Yazid] -yaitu Ibnu Zurai'- telah mengabarkan kepada kami [Sa'id?] dari [Qatadah] dari [Salim bin Abu Al Ja'd] dari [Ma'dan bin Abu Thalhah] dari [Tsauban] mantan budak Rasulullah shallallahu 'alaihi wasallam, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa meminta sesuatu kepada manusia, sementara dirinya tidak memerlukan sesuatu itu, kecuali sesuatu itu akan menjadi aib di wajahnya.\" "
        },
        {
            "number": 1589,
            "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ حَدَّثَنَا مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ نَاسًا مِنْ الْأَنْصَارِ سَأَلُوا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَعْطَاهُمْ ثُمَّ سَأَلُوهُ فَأَعْطَاهُمْ حَتَّى إِذَا نَفِدَ مَا عِنْدَهُ قَالَ مَا يَكُونُ عِنْدِي مِنْ خَيْرٍ فَلَنْ أَدَّخِرَهُ عَنْكُمْ وَمَنْ يَسْتَعِفَّ يُعِفَّهُ اللَّهُ وَمَنْ يَسْتَغْنِ يُغْنِهِ اللَّهُ وَمَنْ يَتَصَبَّرْ يُصَبِّرْهُ اللَّهُ وَمَا أُعْطِيَ أَحَدٌ عَطَاءً هُوَ خَيْرٌ وَأَوْسَعُ مِنْ الصَّبْرِ",
            "id": "Telah mengabarkan kepada kami [Al Hakam bin Al Mubarak] telah menceritakan kepada kami [Malik] dari [Ibnu Syihab] dari ['Atha` bin Yazid Al Laitsi] dari [Abu Sa'id Al Khudri], bahwa beberapa orang Anshar meminta kepada Rasulullah shallallahu 'alaihi wasallam kemudian beliau memberi, kemudian mereka meminta meminta lagi dan beliau memberi hingga habis apa yang ada pada beliau. Kemudian beliau bersabda: \"Tidak ada kebaikan yang aku simpan dari kalian, barangsiapa menjaga kehormatan dirinya maka Allah akan jaga kehormatan dirinya, barangsiapa merasa cukup maka Allah akan beri dia kecukupan, barangsiapa berusaha untuk bersabar maka Allah akan menjadikannya bersabar. Dan tidaklah seseorang diberi suatu pemberian yang lebih baik dan lebih luas daripada kesabaran.\""
        },
        {
            "number": 1590,
            "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ قَالَ حَدَّثَنِي اللَّيْثُ حَدَّثَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ أَنَّهُ قَالَ قَالَ عَبْدُ اللَّهِ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ يَقُولُ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعْطِينِي الْعَطَاءَ فَأَقُولُ أَعْطِهِ مَنْ هُوَ أَفْقَرُ إِلَيْهِ مِنِّي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُذْهُ وَمَا آتَاكَ اللَّهُ مِنْ هَذَا الْمَالِ وَأَنْتَ غَيْرُ مُشْرِفٍ وَلَا سَائِلٍ فَخُذْهُ وَمَا لَا فَلَا تُتْبِعْهُ نَفْسَكَ أَخْبَرَنَا الْحَكَمُ بْنُ نَافِعٍ عَنْ شُعَيْبِ بْنِ أَبِي حَمْزَةَ عَنْ الزُّهْرِيِّ حَدَّثَنِي السَّائِبُ بْنُ يَزِيدَ أَنَّ حُوَيْطِبَ بْنَ عَبْدِ الْعُزَّى أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ السَّعْدِيِّ أَخْبَرَهُ عَنْ عُمَرَ بِنَحْوِهِ أَخْبَرَنَا أَبُو الْوَلِيدِ حَدَّثَنَا اللَّيْثُ عَنْ بُكَيْرٍ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ ابْنِ السَّعْدِيِّ قَالَ اسْتَعْمَلَنِي عُمَرُ فَذَكَرَ نَحْوًا مِنْهُ",
            "id": "Telah mengabarkan kepada kami [Abdullah bin Shalih] ia berkata, telah menceritakan kepadaku [Al Laits] telah menceritakan kepadaku [Yunus] dari [Ibnu Syihab] dari [Salim] bahwa ia berkata, [Abdullah] berkata, aku mendengar [Umar bin Al Khathab] berkata, \"Rasulullah shallallahu 'alaihi wasallam memberiku sebuah pemberian, kemudian aku katakan, \"Berikanlah kepada orang yang lebih membutuhkannya dariku. Lalu beliau berkata: \"Ambillah apa yang Allah berikan kepadamu dari harta ini, sesuatu yang engkau tidak mengharapkan dan tidak memintanya, ambillah! Dan apa yang tidak demikian maka janganlah engkau perturutkan dirimu.\" Telah mengabarkan kepada kami [Al Hakam bin Nafi'] dari [Syu'aib bin Abu Hamzah] dari [Az Zuhri] telah menceritakan kepadaku [As Sa`ib bin Yazid] bahwa [Huwaithib bin Abdul 'Uzza] telah mengabarkan kepadanya, bahwa [Abdullah bin As Suddi] telah mengabarkan kepadanya dari [Umar] seperti itu.\" Telah mengabarkan kepada kami [Abu Al Walid] telah menceritakan kepada kami [Al Laits] dari [Bukair] dari [Busr bin Sa'id] dari [Ibnu As Suddi] ia berkata, \" [Umar] mengangkatku sebagai pegawai ….. kemudian ia menyebutkan hadits seperti itu.\" "
        },
        {
            "number": 1591,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ الْأَوْزَاعِيِّ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ وَعُرْوَةَ بْنِ الزُّبَيْرِ أَنَّ حَكِيمَ بْنَ حِزَامٍ قَالَ سَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَعْطَانِي ثُمَّ سَأَلْتُهُ فَأَعْطَانِي ثُمَّ سَأَلْتُهُ فَأَعْطَانِي ثُمَّ سَأَلْتُهُ فَقَالَ يَا حَكِيمُ إِنَّ هَذَا الْمَالَ خَضِرٌ حُلْوٌ فَمَنْ أَخَذَهُ بِسَخَاوَةِ نَفْسٍ بُورِكَ لَهُ فِيهِ وَمَنْ أَخَذَهُ بِإِشْرَافِ نَفْسٍ لَمْ يُبَارَكْ لَهُ فِيهِ وَكَانَ كَالَّذِي يَأْكُلُ وَلَا يَشْبَعُ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Al Auza'i] dari [Ibnu Syihab] dari [Sa'id? bin Al Musayyab] dan ['Urwah bin Az Zubair] bahwa [Hakim bin Hizam] berkata, \"Aku meminta kepada Nabi shallallahu 'alaihi wasallam lalu beliau memberiku, kemudian aku meminta kepadanya dan beliau memberiku lagi, kemudian aku meminta kepadanya lalu beliau memberiku lagi, kemudian aku meminta kepadanya lalu beliau bersabda: \"Wahai Hakim, sesungguhnya harta ini adalah hijau dan manis, maka barangsiapa mengambilnya dengan kemurahan hati, maka ia akan diberkahi pada harta tersebut. Dan barangsiapa mengambilnya dengan ketamakan jiwa, maka ia tidak akan diberkahi pada hartanya. Dan ia seperti orang yang makan namun tidak kenyang.\""
        },
        {
            "number": 1592,
            "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي اللَّيْثُ حَدَّثَنِي هِشَامٌ عَنْ عُرْوَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ خَيْرُ الصَّدَقَةِ مَا تُصُدِّقَ بِهِ عَنْ ظَهْرِ غِنًى وَلْيَبْدَأْ أَحَدُكُمْ بِمَنْ يَعُولُ",
            "id": "Telah mengabarkan kepada kami [Abdullah bin Shalih] telah menceritakan kepadaku [Al Laits] telah menceritakan kepadaku [Hisyam] dari ['Urwah] dari [Abu Hurairah] ia berkata, \"Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik sedekah adalah sesuatu yang disedekahkan setelah merasa cukup, dan hendaknya salah seorang di antara kalian memulai dengan orang yang ia tanggung.\""
        },
        {
            "number": 1593,
            "arab": " أَخْبَرَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْيَدُ الْعُلْيَا خَيْرٌ مِنْ الْيَدِ السُّفْلَى قَالَ وَالْيَدُ الْعُلْيَا يَدُ الْمُعْطِي وَالْيَدُ السُّفْلَى يَدُ السَّائِلِ",
            "id": "Telah mengabarkan kepada kami [Sulaiman bin Hazb] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tangan di atas lebih baik daripada tangan yang di bawah.\" Dan beliau bersabda: \"Dan tangan yang di atas adalah tangan orang yang memberi, sedangkan tangan yang di bawah adalah tangan orang yang meminta.\""
        },
        {
            "number": 1594,
            "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ قَالَ سَمِعْتُ مُوسَى بْنَ طَلْحَةَ يَذْكُرُ عَنْ حَكِيمِ بْنِ حِزَامٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ الصَّدَقَةِ عَنْ ظَهْرِ غِنًى وَالْيَدُ الْعُلْيَا خَيْرٌ مِنْ الْيَدِ السُّفْلَى وَابْدَأْ بِمَنْ تَعُولُ",
            "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami ['Amru bin Utsman] ia berkata, saya mendengar [Musa bin Thalhah] menyebutkan hadits dari [Hakim bin Hizam] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik sedekah adalah setelah merasa cukup, dan tangan yang di atas lebih baik daripada tangan yang di bawah, mulailah dari orang yang engkau tanggung.\" "
        },
        {
            "number": 1595,
            "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا شُعْبَةُ قَالَ سُلَيْمَانُ أَخْبَرَنِي قَالَ سَمِعْتُ أَبَا وَائِلٍ يُحَدِّثُ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ زَيْنَبَ امْرَأَةِ عَبْدِ اللَّهِ أَنَّهَا قَالَتْ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَا مَعْشَرَ النِّسَاءِ تَصَدَّقْنَ وَلَوْ مِنْ حُلِيِّكُنَّ وَكَانَ عَبْدُ اللَّهِ خَفِيفَ ذَاتِ الْيَدِ فَجِئْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْأَلُهُ فَوَافَقَتْ زَيْنَبَ امْرَأَةٌ مِنْ الْأَنْصَارِ تَسْأَلُ عَمَّا أَسْأَلُ عَنْهُ فَقُلْتُ لِبِلَالٍ سَلْ لِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيْنَ أَضَعُ صَدَقَتِي عَلَى عَبْدِ اللَّهِ أَوْ فِي قَرَابَتِي فَسَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَيُّ الزَّيَانِبِ فَقَالَ امْرَأَةُ عَبْدِ اللَّهِ فَقَالَ لَهَا أَجْرَانِ أَجْرُ الْقَرَابَةِ وَأَجْرُ الصَّدَقَةِ",
            "id": "Telah mengabarkan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Syu'bah] ia berkata, [Sulaiman] telah mengabarkan kepadaku, ia berkata, saya mendengar [Abu Wail] menceritakan dari ['Amru bin Al Harits] dari [Zainab] isteri Abdullah, bahwa ia berkata, \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai para wanita bersedekahlah walaupun dari perhiasan kalian.\" Sementara Abdullah adalah orang yang miskin, kemudian aku datang kepada Rasulullah shallallahu 'alaihi wasallam bertanya kepada beliau.\" Kemudian Zainab berpapasan dengan seorang wanita Anshar yang juga ingin bertanya mengenai apa yang akan aku tanyakan. Kemudian kukatakan kepada Bilal, \"Tanyakanlah kepada Rasulullah shallallahu 'alaihi wasallam, dimanakah aku harus memberikan sedekahku, kepada Abdullah (suamiku) atau kepada kerabatku?\" Kemudian Bilal bertanya kepada Nabi shallallahu 'alaihi wasallam, lantas beliau balik bertanya, \"Zainab yang manakah?\" Bilal menjawab, \"Isteri Abdullah.\" Kemudian beliau bersabda: \"Baginya dua pahala, pahala kekerabatan dan pahala sedekah.\""
        },
        {
            "number": 1596,
            "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ حَدَّثَنَا مَالِكٌ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَنَسٍ قَالَ كَانَ أَبُو طَلْحَةَ أَكْثَرَ أَنْصَارِيٍّ بِالْمَدِينَةِ مَالًا نَخْلًا وَكَانَتْ أَحَبَّ أَمْوَالِهِ إِلَيْهِ بَيْرُحَاءُ وَكَانَتْ مُسْتَقْبِلَةَ الْمَسْجِدِ وَكَانَ يَدْخُلُهَا وَيَشْرَبُ مِنْ مَائِهَا طَيِّبٌ فَقَالَ أَنَسٌ فَلَمَّا أُنْزِلَتْ هَذِهِ الْآيَةُ { لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ } قَالَ إِنَّ أَحَبَّ أَمْوَالِي إِلَيَّ بَيْرُحَاءُ وَإِنَّهَا صَدَقَةٌ لِلَّهِ أَرْجُو بِرَّهَا وَذُخْرَهَا عِنْدَ اللَّهِ فَضَعْهَا يَا رَسُولَ اللَّهِ حَيْثُ شِئْتَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَخٍ ذَلِكَ مَالٌ رَابِحٌ أَوْ رَائِحٌ وَقَدْ سَمِعْتُ مَا قُلْتَ فِيهِ وَإِنِّي أَرَى أَنْ تَجْعَلَهُ فِي الْأَقْرَبِينَ فَقَالَ أَبُو طَلْحَةَ أَفْعَلُ يَا رَسُولَ اللَّهِ فَقَسَّمَهُ أَبُو طَلْحَةَ فِي قَرَابَةِ بَنِي عَمِّهِ",
            "id": "Telah mengabarkan kepada kami [Al Hakam bin Al Mubarak] telah menceritakan kepada kami [Malik] dari [Ishaq bin Abdullah bin Abu Thalhah] dari [Anas] ia berkata, \"Abu Thalhah adalah orang anshar yang paling banyak hartanya di kota Madinah, yaitu pohon kurma. Harta yang paling ia senangi adalah Bairuha` (kebun kurma) yang menghadap ke masjid. Ia biasa masuk untuk makan (buha) dan meminum airnya yang jernih.\" Anas berkata, \"Kemudian tatkala ayat: '(Kamu sekali-kali tidak sampai kepada kebajikan (yang sempurna), sebelum kamu menafkahkan sehahagian harta yang kamu cintai) ' (Qs. Ali Imran: 92). Abu Thalhah berkata, \"Sungguh, hartaku yang paling aku senangi adalah Bairuha`, dan sesungguhnya kebun tersebut adalah sedekah untuk Allah, aku mengharapkan kebaikan dan simpanan pahalanya di sisi Allah. Maka pergunakan di mana engkau kehendaki wahai Rasul! \" Rasulullah shallallahu 'alaihi wasallam kemudian bersabda: \"Bakh, itu adalah harta yang menguntungkan, sungguh aku telah mendengar apa yang engkau katakan. Namun menurutku, sebaiknya itu engkau berikan kepada para kerabat.\" Kemudian Abu Thalhah berkata, \"Aku akan melakukannya wahai Rasulullah! \" Abu Thalhah lalu membaginya di antara para kerabat anak pamannya.\""
        },
        {
            "number": 1597,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنَا أَبِي عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ هَيَّاجِ بْنِ عِمْرَانَ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ مَا خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا أَمَرَنَا فِيهَا بِالصَّدَقَةِ وَنَهَانَا عَنْ الْمُثْلَةِ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] Telah menceritakan kepada kami [Mu'adz bin Hisyam] telah menceritakan kepada kami [Ayahku] dari [Qatadah] dari [Al Hasan] dari [Hayyaj bin Imran] dari [Imran bin Hushain] ia berkata, \"Tidaklah Rasulullah shallallahu 'alaihi wasallam berkhutbah kepada kami kecuali beliau memerintahkan kami untuk bersedekah, dan melarang kami dari mencincang.\" "
        },
        {
            "number": 1598,
            "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا شُعْبَةُ أَخْبَرَنِي عَمْرُو بْنُ مُرَّةَ قَالَ سَمِعْتُ خَيْثَمَةَ عَنْ عَدِيِّ بْنِ حَاتِمٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اتَّقُوا النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ فَإِنْ لَمْ تَجِدُوا فَبِكَلِمَةٍ طَيِّبَةٍ",
            "id": "Telah mengabarkan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Syu'bah] telah mengabarkan kepada kami ['Amru bin Murrah] ia berkata, saya mendengar [Khaitsamah] dari [Adi bin Hatim] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Takutlah kepada Neraka walaupun hanya dengan sebelah kurma. Jika tidak kalian dapatkan, maka dengan perkataan yang baik.\""
        },
        {
            "number": 1599,
            "arab": " أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ دُحَيْمٌ حَدَّثَنَا سَعِيدُ بْنُ مَسْلَمَةَ عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ عَنْ الزُّهْرِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لُبَابَةَ أَنَّ أَبَا لُبَابَةَ أَخْبَرَهُ أَنَّهُ لَمَّا رَضِيَ عَنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَا رَسُولَ اللَّهِ إِنَّ مِنْ تَوْبَتِي أَنْ أَهْجُرَ دَارَ قَوْمِي وَأُسَاكِنَكَ وَأَنْخَلِعَ مِنْ مَالِي صَدَقَةً لِلَّهِ وَلِرَسُولِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُجْزِي عَنْكَ الثُّلُثُ",
            "id": "Telah mengabarkan kepada kami [Abdurrahman bin Ibrahim Ad Dimasyqi Duhaim] telah menceritakan kepada kami [Sa'id? bin Maslamah] dari [Isma'il bin Umayyah] dari [Az Zuhri] dari [Abdurrahman bin Abu Lubabah] bahwa [Abu Lubabah] telah mengabarkan kepadanya, bahwa tatkala Rasulullah shallallahu 'alaihi wasallam ridla kepadanya, ia berkata, \"Wahai Rasulullah, sesungguhnya di antara bukti dari taubatku adalah meninggalkan kaumku dan tinggal di dekatmu, serta memberikan sebagian dari hartaku sebagai sedekah kepada Allah dan rasul-Nya.\" Kemudian Rasulullah shallallahu 'alaihi wasallam berkata: \"Cukup bagimu mensedekahkan sepertiga hartamu.\""
        },
        {
            "number": 1600,
            "arab": " أَخْبَرَنَا يَعْلَى وَأَحْمَدُ بْنُ خَالِدٍ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ عَاصِمِ بْنِ عُمَرَ بْنِ قَتَادَةَ عَنْ مَحْمُودِ بْنِ لَبِيدٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ بَيْنَا نَحْنُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ جَاءَ رَجُلٌ بِمِثْلِ الْبَيْضَةِ مِنْ ذَهَبٍ أَصَابَهَا فِي بَعْضِ الْمَغَازِي قَالَ أَحْمَدُ فِي بَعْضِ الْمَعَادِنِ وَهُوَ الصَّوَابُ فَقَالَ يَا رَسُولَ اللَّهِ خُذْهَا مِنِّي صَدَقَةً فَوَاللَّهِ مَا لِي مَالٌ غَيْرَهَا فَأَعْرَضَ عَنْهُ ثُمَّ جَاءَهُ عَنْ رُكْنِهِ الْأَيْسَرِ فَقَالَ مِثْلَ ذَلِكَ ثُمَّ جَاءَهُ مِنْ بَيْنِ يَدَيْهِ فَقَالَ مِثْلَ ذَلِكَ ثُمَّ قَالَ هَاتِهَا مُغْضَبًا فَحَذَفَهُ بِهَا حَذْفَةً لَوْ أَصَابَهُ لَأَوْجَعَهُ أَوْ عَقَرَهُ ثُمَّ قَالَ يَعْمِدُ أَحَدُكُمْ إِلَى مَالِهِ لَا يَمْلِكُ غَيْرَهُ فَيَتَصَدَّقُ بِهِ ثُمَّ يَقْعُدُ يَتَكَفَّفُ النَّاسَ إِنَّمَا الصَّدَقَةُ عَنْ ظَهْرِ غِنًى خُذْ الَّذِي لَكَ لَا حَاجَةَ لَنَا بِهِ فَأَخَذَ الرَّجُلُ مَالَهُ وَذَهَبَ قَالَ أَبُو مُحَمَّد كَانَ مَالِكٌ يَقُولُ إِذَا جَعَلَ الرَّجُلُ مَالَهُ فِي الْمَسَاكِينِ يَتَصَدَّقُ بِثُلُثِ مَالِهِ",
            "id": "Telah mengabarkan kepada kami [Ya'la] dan [Ahmad bin Khalid] dari [Muhammad bin Ishaq] dari ['Ashim bin Umar bin Qatadah] dari [Mahmud bin Labid] dari [Jabir bin Abdullah] ia berkata, \"Ketika kami bersama Rasulullah shallallahu 'alaihi wasallam, tiba-tiba ada seorang laki-laki yang datang membawa emas seperti telur yang ia dapatkan di sebagian peperangan.\" Ahmad menyebutkan, 'Pada sebagian barang tambang.' Dan itu adalah yang benar. Laki-laki itu lalu berkata, \"Wahai Rasulullah, ambillah ini dariku sebagai sedekah. Demi Allah, aku tidak memiliki harta selainnya.\" Lalu beliau berpaling darinya, laki-laki itu lalu datang dari sisi kanan beliau dan berkata seperti itu. Kemudian datang lagi dari depan beliau dan berkata seperti itu. Kemudian dalam keadaan marah beliau berkata: \"Berikan.\" Kemudian beliau melemparkan emas tersebut, sekiranya mengenai laki-laki tersebut niscaya akan membuatnya sakit dan terluka. Setelah itu beliau beliau bersabda: \"Salah seorang di antara kalian mengambil hartanya, lalu mensedekahkannya, padahal ia tidak memiliki selainnya. Kemudian ia duduk dan meminta-minta kepada orang. Sesungguhnya sedekah adalah dalam keadaan lebih. Ambillah milikmu, kami tidak membutuhkannya.\" Kemudian orang tersebut mengambil hartanya dan pergi.\" Abu Muhammad berkata, \"Malik berkata, \"Jika seseorang memberikan hartanya untuk orang-orang miskin, maka hendaknya ia bersedekah dari sepertiga hartanya.\""
        },
        {
            "number": 1601,
            "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا هِشَامُ بْنُ سَعْدٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ أَبِيهِ قَالَ سَمِعْتُ عُمَرَ قَالَ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَتَصَدَّقَ فَوَافَقَ ذَلِكَ مَالًا عِنْدِي فَقُلْتُ الْيَوْمَ أَسْبِقُ أَبَا بَكْرٍ إِنْ سَبَقْتُهُ يَوْمًا فَجِئْتُ بِنِصْفِ مَالِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَبْقَيْتَ لِأَهْلِكَ قُلْتُ مِثْلَهُ قَالَ فَأَتَى أَبُو بَكْرٍ بِكُلِّ مَا عِنْدَهُ فَقَالَ يَا أَبَا بَكْرٍ مَا أَبْقَيْتَ لِأَهْلِكَ فَقَالَ أَبْقَيْتُ لَهُمْ اللَّهَ وَرَسُولَهُ فَقُلْتُ لَا أُسَابِقُكَ إِلَى شَيْءٍ أَبَدًا",
            "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Hisyam bin Sa'd] dari [Zaid bin Aslam] dari [Ayahnya] ia berkata, aku mendengar [Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam memerintahkan kami agar bersedekah, dan saat itu bertepatan saat aku mempunyai uang. Maka aku pun berkata, \"Jika hari ini aku bisa bersegera, maka aku akan dapat mendahului Abu Bakar.\" Kemudian aku datang dengan membawa setengah hartaku, lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah yang engkau tinggalkan untuk keluargamu?\" Aku lantas menjawab, \"Harta yang sama seperti itu.\" Umar berkata, \"Abu Bakar kemudian datang dengan membawa seluruh yang ia miliki.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Wahai Abu Bakar, apa yang engkau tinggalkan untuk keluargamu?\" Ia menjawab, \"Aku tinggalkan untuk mereka Allah dan Rasul-Nya.\" Maka aku katakan, \"Selamanya aku tidak akan bisa mendahuluimu dalam beramal apapun.\" "
        },
        {
            "number": 1602,
            "arab": " أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ فَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَكَاةَ الْفِطْرِ مِنْ رَمَضَانَ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ عَلَى كُلِّ حُرٍّ وَعَبْدٍ ذَكَرٍ أَوْ أُنْثَى مِنْ الْمُسْلِمِينَ قِيلَ لِأَبِي مُحَمَّدٍ تَقُولُ بِهِ قَالَ مَالِكٌ كَانَ يَقُولُ بِهِ",
            "id": "Telah mengabarkan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Nafi'] dari [Abdullah bin Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam telah mewajibkan zakat fitrah pada bulan Ramadan satu sha' kurma atau satu sha' gandum atas setiap orang yang merdeka, hamba sahaya, laki-laki atau perempuan dari kalangan Muslimin.\" Abu Muhammad ditanya, \"Apakah engkau berpendapat seperti itu?\" Ia menjawab, \"Malik berpendapat seperti itu.\" "
        },
        {
            "number": 1603,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِزَكَاةِ الْفِطْرِ عَنْ كُلِّ صَغِيرٍ وَكَبِيرٍ حُرٍّ أَوْ عَبْدٍ صَاعًا مِنْ شَعِيرٍ أَوْ صَاعًا مِنْ تَمْرٍ قَالَ ابْنُ عُمَرَ فَعَدَلَهُ النَّاسُ بِمُدَّيْنِ مِنْ بُرٍّ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Sufyan] dari ['Ubaidullah] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam memerintahkan kami untuk mengeluarkan zakat fitrah dari setiap anak kecil dan orang dewasa, orang merdeka atau hamba sahaya, yakni satu sha' gandum atau satu sha' kurma.\" Ibnu Umar berkata, \"Orang-orang menyamakannya dengan dua mud gandum.\" "
        },
        {
            "number": 1604,
            "arab": " حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ حَدَّثَنَا دَاوُدُ بْنُ قَيْسٍ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ كُنَّا نُخْرِجُ زَكَاةَ الْفِطْرِ إِذْ كَانَ فِينَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ كُلِّ صَغِيرٍ وَكَبِيرٍ حُرٍّ وَمَمْلُوكٍ صَاعًا مِنْ طَعَامٍ أَوْ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ أَوْ صَاعًا مِنْ أَقِطٍ أَوْ صَاعًا مِنْ زَبِيبٍ فَلَمْ يَزَلْ ذَلِكَ كَذَلِكَ حَتَّى قَدِمَ عَلَيْنَا مُعَاوِيَةُ الْمَدِينَةَ حَاجًّا أَوْ مُعْتَمِرًا فَقَالَ إِنِّي أَرَى مُدَّيْنِ مِنْ سَمْرَاءِ الشَّامِ يَعْدِلُ صَاعًا مِنْ التَّمْرِ فَأَخَذَ النَّاسُ بِذَلِكَ قَالَ أَبُو سَعِيدٍ أَمَّا أَنَا فَلَا أَزَالُ أُخْرِجُهُ كَمَا كُنْتُ أُخْرِجُهُ قَالَ أَبُو مُحَمَّد أَرَى صَاعًا مِنْ كُلِّ شَيْءٍ",
            "id": "Telah mengabarkan kepada kami [Utsman bin Umar] telah menceritakan kepada kami [Daud bin Qais] dari ['Iyadl bin Abdullah] dari [Abu Sa'id Al Khudri] ia berkata, \"Saat Rasulullah shallallahu 'alaihi wasallam masih ada mengeluarkan zakat fitrah untuk setiap anak-anak, orang dewasa yang merdeka dan hamba sahaya satu sha' makanan, atau satu sha' kurma, atau satu sha' gandum, atau satu sha' keju, atau satu sha' kismis. Dan tetap seperti itu hingga Mu'awiyah datang kepada kami di Madinah dalam rangka ibadah haji atau umrah. Ia berkata, \"Aku melihat dua mud gandum Syam sama dengan satu sha' kurma.\" Kemudian orang-orang mengambil pendapat itu.\" Abu Sa'id berkata, \"Adapun aku, maka aku masih tetap mengeluarkannya sebagaimana dahulu aku mengeluarkannya.\" Abu Muhammad berkata, \"Menurutku satu sha' itu berlaku untuk semua jenis (makanan).\""
        },
        {
            "number": 1605,
            "arab": " حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ بْنِ سَعْدِ بْنِ أَبِي سَرْحٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ كُنَّا نُخْرِجُ زَكَاةَ الْفِطْرِ مِنْ رَمَضَانَ صَاعًا مِنْ طَعَامٍ أَوْ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ أَوْ صَاعًا مِنْ زَبِيبٍ أَوْ صَاعًا مِنْ أَقِطٍ أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ سُفْيَانَ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي سَعِيدٍ قَالَ كُنَّا نُعْطِي عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ نَحْوَهُ",
            "id": "Telah mengabarkan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Zaid bin Aslam] dari ['Iyadl bin Abdullah bin Sa'd bin Abu Sarh] dari [Abu Sa'id Al Khudri] ia berkata, \"Dahulu kami mengeluarkan zakat fitrah pada bulan Ramadan satu sha' makanan, atau satu sha' kurma, atau satu sha' gandum, atau satu sha' kismis, atau satu sha keju.\" Telah mengabarkan kepada kami ['Ubaidullah bin Musa] dari [Sufyan] dari [Zaid bin Aslam] dari ['Iyadl bin Abdullah] dari [Abu Sa'id] ia berkata, \"Dahulu kami pada masa Nabi shallallahu 'alaihi wasallam memberi.... kemudian ia menyebutkan seperti itu.\""
        },
        {
            "number": 1606,
            "arab": " أَخْبَرَنَا أَحْمَدُ بْنُ خَالِدٍ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ شِمَاسَةَ قَالَ سَمِعْتُ عُقْبَةَ بْنَ عَامِرٍ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَدْخُلُ الْجَنَّةَ صَاحِبُ مَكْسٍ قَالَ قَالَ أَبُو مُحَمَّد يَعْنِي عَشَّارًا",
            "id": "Telah mengabarkan kepada kami [Ahmad bin Khalid] telah menceritakan kepada kami [Muhammad bin Ishaq] dari [Yazid bin Abu Habib] dari ['Abdurrahman bin Syamasah] ia berkata, aku mendengar ['Uqbah bin 'Amir] berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak masuk Surga pemungut pajak.\" Abu Muhammad berkata, \"Yaitu orang yang mengambil berlawanan dengan hukum syari'at.\""
        },
        {
            "number": 1607,
            "arab": " أَخْبَرَنَا عَاصِمُ بْنُ يُوسُفَ حَدَّثَنَا أَبُو بَكْرٍ عَنْ عَاصِمٍ عَنْ أَبِي وَائِلٍ عَنْ مَسْرُوقٍ عَنْ مُعَاذٍ قَالَ بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْيَمَنِ فَأَمَرَنِي أَنْ آخُذَ مِنْ الثِّمَارِ مَا سُقِيَ بَعْلًا الْعُشْرَ وَمَا سُقِيَ بِالسَّانِيَةِ فَنِصْفَ الْعُشْرِ",
            "id": "Telah mengabarkan kepada kami ['Ashim bin Yusuf] telah menceritakan kepada kami [Abu Bakr] dari ['Ashim] dari [Abu Wail] dari [Masruq] dari [Mu'adz] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam mengutusku ke Yaman dan memerintahkan agar aku mengambil buah-buahan yang disirami dengan hujan sepersepuluh, dan yang disirami menggunakan tenaga unta seperdua puluh.\" "
        },
        {
            "number": 1608,
            "arab": " أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ وَأَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ جُرْحُ الْعَجْمَاءِ جُبَارٌ وَالْبِئْرُ جُبَارٌ وَالْمَعْدِنُ جُبَارٌ وَفِي الرِّكَازِ الْخُمُسُ",
            "id": "Telah mengabarkan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Ibnu Syihab] dari [Sa'id bin Al Musayyab] dan [Abu Salamah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Luka yang diakibatkan oleh binatang ternak tidak ada jaminannya, orang yang (mati) masuk sumur tidak ada jaminan, dan pada barang terpendam zakatnya adalah seperlima.\" "
        },
        {
            "number": 1609,
            "arab": " أَخْبَرَنَا أَبُو الْيَمَانِ الْحَكَمُ بْنُ نَافِعٍ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ عَنْ أَبِي حُمَيْدٍ الْأَنْصَارِيِّ ثُمَّ السَّاعِدِيِّ أَنَّهُ أَخْبَرَهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَعْمَلَ عَامِلًا عَلَى الصَّدَقَةِ فَجَاءَهُ الْعَامِلُ حِينَ فَرَغَ مِنْ عَمَلِهِ فَقَالَ يَا رَسُولَ اللَّهِ هَذَا الَّذِي لَكُمْ وَهَذَا أُهْدِيَ لِي فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَهَلَّا قَعَدْتَ فِي بَيْتِ أَبِيكَ وَأُمِّكَ فَنَظَرْتَ أَيُهْدَى لَكَ أَمْ لَا ثُمَّ قَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَشِيَّةً بَعْدَ الصَّلَاةِ عَلَى الْمِنْبَرِ فَتَشَهَّدَ وَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ أَمَّا بَعْدُ مَا بَالُ الْعَامِلِ نَسْتَعْمِلُهُ فَيَأْتِينَا فَيَقُولُ هَذَا مِنْ عَمَلِكُمْ وَهَذَا أُهْدِيَ لِي فَهَلَّا قَعَدَ فِي بَيْتِ أَبِيهِ وَأُمِّهِ فَيَنْظُرَ هَلْ يُهْدَى لَهُ أَمْ لَا وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَا يَغُلُّ أَحَدُكُمْ مِنْهَا شَيْئًا إِلَّا جَاءَ يَوْمَ الْقِيَامَةِ يَحْمِلُهُ عَلَى عُنُقِهِ إِنْ كَانَ بَعِيرًا جَاءَ بِهِ لَهُ رُغَاءٌ وَإِنْ كَانَتْ بَقَرَةً جَاءَ بِهَا لَهَا خُوَارٌ وَإِنْ كَانَتْ شَاةً جَاءَ بِهَا تَيْعَرُ فَقَدْ بَلَّغْتُ قَالَ أَبُو حُمَيْدٍ ثُمَّ رَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَيْهِ حَتَّى إِنَّا لَنَنْظُرُ إِلَى عُفْرَةِ إِبْطَيْهِ قَالَ أَبُو حُمَيْدٍ وَقَدْ سَمِعَ ذَلِكَ مَعِي مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَيْدُ بْنُ ثَابِتٍ فَسَلُوهُ",
            "id": "Telah mengabarkan kepada kami [Abu Al Yaman Al Hakam bin Nafi'] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] telah menceritakan kepadaku ['Urwah bin Az Zubair] dari [Abu Humaid Al Anshari As Sa'idi], bahwa ia mengabarkan kepadanya, bahwa Nabi shallallahu 'alaihi wasallam menggunakan pekerja untuk mengurusi zakat. Kemudian pekerja tersebut datang kepadanya saat pekerjaannya telah selesai. Ia berkata, \"Wahai Rasulullah, ini yang menjadi bagian anda dan yang ini dihadiahkan kepadaku.\" Lalu Nabi shallallahu 'alaihi wasallam bersabda: \"Perhatikanlah, jika kamu duduk di rumah bapak dan ibumu, apakah engkau akan mendapatkan hadiah atau tidak?\" Kemudian setelah shalat, Nabi shallallahu 'alaihi wasallam berdiri di atas mimbar seraya mengucapkan syahadat dan memuji Allah dengan pujian yang menjadi milik-Nya. Kemudian beliau bersabda: \"Bagaimana dengan seorang pekerja yang kami pekerjakan, kemudian datang kepada kami dan berkata, 'Ini hasil dari kerja anda dan ini dihadiahkan kepadaku.' Lihatlah, jika engkau duduk di rumah bapak dan ibumu, apakah engkau akan diberi hadiah atau tidak? Demi Dzat yang jiwa Muhammad ada di tangan-Nya, tidaklah seseorang di antara kalian mengambil sesuatupun darinya yang bukan haknya kecuali pada hari Kiamat ia datang dengan membawanya pada lehernya, apabila sesuatu tersebut adalah unta maka ia datang membawanya dengan bersuara unta, apabila sesuatu tersebut adalah sapi maka ia datang membawanya dengan bersuara sapi, dan apabila sesuatu tersebut adalah kambing maka ia datang membawanya dengan suara kambing, sungguh aku telah menyampaikannya.\" Abu Humaid berkata, \"Kemudian Rasulullah shallallahu 'alaihi wasallam mengangkat kedua tangannya hingga kami melihat putihnya kedua ketiak beliau.\" Abu Humaid berkata, \"Sungguh, Zaid bin Tsabit bersamaku telah mendengar hal itu tersebut dari Nabi shallallahu 'alaihi wasallam, maka tanyakanlah kepada dia.\" "
        },
        {
            "number": 1610,
            "arab": " أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا هُشَيْمٌ عَنْ دَاوُدَ وَمُجَالِدٍ عَنْ الشَّعْبِيِّ عَنْ جَرِيرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا جَاءَكُمْ الْمُصَدِّقُ فَلَا يَصْدُرَنَّ عَنْكُمْ إِلَّا وَهُوَ رَاضٍ حَدَّثَنِي مُحَمَّدُ بْنُ عُيَيْنَةَ عَنْ أَبِي إِسْحَقَ الْفَزَارِيِّ عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ عَنْ عَامِرٍ عَنْ جَرِيرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
            "id": "Telah mengabarkan kepada kami ['Amru bin 'Aun] telah mengabarkan kepada kami [Husyaim] dari [Daud] serta [Mujalid] dari [Asy Sya'bi] dari [Jarir] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila telah datang kepada kalian petugas pengambil zakat, maka janganlah kembali dari kalian kecuali ia dalam keadaan ridla.\" Telah menceritakan kepadaku [Muhammad bin 'Uyainah] dari [Abu Ishaq Al Fazari] dari [Daud bin Abu Hindun] dari ['Amir] dari [Jarir] dari Nabi shallallahu 'alaihi wasallam seperti itu.\" "
        },
        {
            "number": 1611,
            "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ أَخْبَرَنَا مَالِكٌ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَمْرِو بْنِ مُعَاذٍ الْأَشْهَلِيِّ عَنْ جَدَّتِهِ يُقَالُ لَهَا حَوَّاءُ قَالَتْ قَالَ رَسُولُ اللَّهِ يَا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نِسَاءَ الْمُسْلِمَاتِ لَا تَحْقِرَنَّ إِحْدَاكُنَّ لِجَارَتِهَا وَلَوْ كُرَاعُ شَاةٍ مُحَرَّقٌ",
            "id": "Telah mengabarkan kepada kami [Al Hakam bin Al Mubarak] telah mengabarkan kepada kami [Malik] dari [Zaid bin Aslam] dari ['Amru bin Mu'adz Al Asyhali] dari neneknya yang dipanggil [Hawwa`], ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai para wanita Muslimah, jangan sekali-kali kalian meremehkan untuk berbuat baik kepada tetangganya meskipun hanya dengan betis kambing yang terbakar.\""
        },
        {
            "number": 1612,
            "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا أَبَانُ بْنُ عَبْدِ اللَّهِ الْبَجَلِيُّ حَدَّثَنَا عُثْمَانُ بْنُ أَبِي حَازِمٍ عَنْ صَخْرِ بْنِ الْعَيْلَةِ قَالَ أُخِذَتْ عَمَّةُ الْمُغِيرَةِ بْنِ شُعْبَةَ فَقَدِمَتْ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَمَّتَهُ فَقَالَ يَا صَخْرُ إِنَّ الْقَوْمَ إِذَا أَسْلَمُوا أَحْرَزُوا أَمْوَالَهُمْ وَدِمَاءَهُمْ فَادْفَعْهَا إِلَيْهِ وَكَانَ مَاءٌ لِبَنِي سُلَيْمٍ فَأَسْلَمُوا فَسَأَلُوهُ ذَلِكَ فَدَعَانِي فَقَالَ يَا صَخْرُ إِنَّ الْقَوْمَ إِذَا أَسْلَمُوا أَحْرَزُوا أَمْوَالَهُمْ وَدِمَاءَهُمْ فَادْفَعْهَا إِلَيْهِمْ فَدَفَعْتُهُ أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا أَبَانُ بْنُ عَبْدِ اللَّهِ حَدَّثَنِي عُثْمَانُ بْنُ أَبِي حَازِمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ صَخْرٍ أَطْوَلَ مِنْ حَدِيثِ أَبِي نُعَيْمٍ",
            "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Aban bin Abdullah Al Bajali] telah menceritakan kepada kami [Utsman bin Abu Hazim] dari [Shakhr bin Al 'Ailah] ia berkata, \"Bibi Al Mughirah bin Syu'bah tertawan dan menghadap Rasulullah shallallahu 'alaihi wasallam, lalu Al Mughirah meminta bibinya kepada Nabi shallallahu 'alaihi wasallam. Maka beliau pun bersabda: \"Wahai Shakhr, sesungguhnya sebuah kaum apabila telah masuk Islam maka mereka telah menjaga harta dan darah mereka, maka serahkan kepadanya.\" Dahulu Bani Sulaim memiliki air, kemudian mereka masuk Islam dan memintanya kepada beliau. Lalu beliau memanggilku bersabda: \"Wahai Shakhr, sesungguhnya sebuah kaum apabila telah masuk Islam maka mereka telah menjaga harta dan darah mereka, maka serahkan kepada mereka.\" Lalu aku menyerahkan air tersebut kepada mereka.\" Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Aban bin Abdullah] telah menceritakan kepadaku [Utsman bin Abu Hazim] dari [Ayahnya] dari kakeknya [Shakhr] dan haditsnya lebih panjang dari hadits Abu Nu'aim.\" "
        },
        {
            "number": 1613,
            "arab": " أَخْبَرَنَا سَعِيدُ بْنُ الْمُغِيرَةِ عَنْ عِيسَى بْنِ يُونُسَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سَعِيدِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا تَصَدَّقَ امْرُؤٌ بِصَدَقَةٍ مِنْ كَسْبٍ طَيِّبٍ وَلَا يَقْبَلُ اللَّهُ إِلَّا طَيِّبًا إِلَّا وَضَعَهَا حِينَ يَضَعُهَا فِي كَفِّ الرَّحْمَنِ وَإِنَّ اللَّهَ لَيُرَبِّي لِأَحَدِكُمْ التَّمْرَةَ كَمَا يُرَبِّي أَحَدُكُمْ فَلُوَّهُ أَوْ فَصِيلَهُ حَتَّى تَكُونَ مِثْلَ أُحُدٍ",
            "id": "Telah mengabarkan kepada kami [Sa'id bin Al Mughirah] dari [Isa bin Yunus] dari [Yahya bin Sa'id] dari [Sa'id bin Yasar] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seseorang bersedekah dengan sesuatu yang berasal dari usaha yang baik, dan tidak Allah menerima kecuali yang baik, melainkan ia telah meletakkannya ketika ia meletakkannya di telapak tangan Allah yang Maha Pengasih. Dan sesungguhnya Allah akan mengembangkan satu biji kurma salah seorang dari kalian sebagaimana salah seorang dari kalian mengembangkan anak kuda atau anak unta hingga menjadi seperti gunung Uhud.\""
        },
        {
            "number": 1614,
            "arab": " حَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ حَدَّثَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا نَقَصَتْ صَدَقَةٌ مِنْ مَالٍ وَمَا زَادَ اللَّهُ عَبْدًا بِعَفْوٍ إِلَّا عِزًّا وَمَا تَوَاضَعَ أَحَدٌ لِلَّهِ إِلَّا رَفَعَهُ اللَّهُ",
            "id": "Telah mengabarkan kepada kami [Abu Ar Rabi' Az Zahrani] telah menceritakan kepada kami [Isma'il bin Ja'far] dari [Al 'Ala`] dari [Ayahnya] dari [Abu Hurairah], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Harta tidak akan berkurang karena sedekah, dan tidaklah Allah menambahkan bagi seorang hamba karena sikap memberi maaf kecuali kemuliaan, dan tidaklah seseorang merendahkan diri karena Allah melainkan Allah mengangkat derajatnya.\""
        },
        {
            "number": 1615,
            "arab": " أَخْبَرَنَا النَّضْرُ بْنُ شُمَيْلٍ حَدَّثَنَا بَهْزُ بْنُ حَكِيمٍ عَنْ أَبِيهِ عَنْ جَدَّهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي كُلِّ إِبِلٍ سَائِمَةٍ فِي كُلِّ أَرْبَعِينَ بِنْتُ لَبُونٍ لَا تُفَرَّقُ إِبِلٌ عَنْ حِسَابِهَا مَنْ أَعْطَاهَا مُؤْتَجِرًا بِهَا فَلَهُ أَجْرُهَا وَمَنْ مَنَعَهَا فَإِنَّا آخِذُوهَا وَشَطْرَ إِبِلِهِ عَزْمَةٌ مِنْ عَزَمَاتِ اللَّهِ لَا يَحِلُّ لِآلِ مُحَمَّدٍ مِنْهَا شَيْءٌ",
            "id": "Telah mengabarkan kepada kami [An Nadlr bin Syumail] telah menceritakan kepada kami [Bahz bin Hakim] dari [Ayahnya] dari [Kakeknya] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pada setiap empat puluh unta yang digembala, zakatnya adalah satu ekor bintu Labun (anak unta yang berumur dua tahun). Unta tidak boleh dipisahkan dari bilangan jumlahnya, barangsiapa memberinya dengan tujuan untuk mendapatkan pahala maka baginya pahalanya, dan barangsiapa menahannya maka kami akan mengambilnya ditambah setengah untanya. Itulah kewajiban di antara kewajiban-kewajiban dari Allah, dan tidak halal bagi keluarga Muhammad sedikitpun darinya.\""
        },
        {
            "number": 1616,
            "arab": " حَدَّثَنَا مُسَدَّدٌ وَأَبُو نُعَيْمٍ قَالَا حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ هَارُونَ بْنِ رِيَابٍ حَدَّثَنِي كِنَانَةُ بْنُ نُعَيْمٍ عَنْ قَبِيصَةَ بْنِ مُخَارِقٍ الْهِلَالِيِّ قَالَ تَحَمَّلْتُ بِحَمَالَةٍ فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْأَلُهُ فِيهَا فَقَالَ أَقِمْ يَا قَبِيصَةُ حَتَّى تَأْتِيَنَا الصَّدَقَةُ فَنَأْمُرَ لَكَ بِهَا ثُمَّ قَالَ يَا قَبِيصَةُ إِنَّ الْمَسْأَلَةَ لَا تَحِلُّ إِلَّا لِأَحَدِ ثَلَاثَةٍ رَجُلٍ تَحَمَّلَ حَمَالَةً فَحَلَّتْ لَهُ الْمَسْأَلَةُ فَسَأَلَ حَتَّى يُصِيبَهَا ثُمَّ يُمْسِكَ وَرَجُلٍ أَصَابَتْهُ جَائِحَةٌ فَاجْتَاحَتْ مَالَهُ فَحَلَّتْ لَهُ الْمَسْأَلَةُ فَسَأَلَ حَتَّى يُصِيبَ قِوَامًا مِنْ عَيْشٍ أَوْ قَالَ سِدَادًا مِنْ عَيْشٍ وَرَجُلٍ أَصَابَتْهُ فَاقَةٌ حَتَّى يَقُولَ ثَلَاثَةٌ مِنْ ذَوِي الْحِجَى مِنْ قَوْمِهِ قَدْ أَصَابَ فُلَانًا الْفَاقَةُ فَحَلَّتْ لَهُ الْمَسْأَلَةُ فَسَأَلَ حَتَّى يُصِيبَ قِوَامًا مِنْ عَيْشٍ أَوْ سِدَادًا مِنْ عَيْشٍ ثُمَّ يُمْسِكَ وَمَا سِوَاهُنَّ مِنْ الْمَسْأَلَةِ سُحْتٌ يَا قَبِيصَةُ يَأْكُلُهَا صَاحِبُهَا سُحْتًا",
            "id": "Telah menceritakan kepada kami [Musaddad] dan [Abu Nu'aim] mereka berkata, telah menceritakan kepada kami [Hammad bin Zaid] dari [Harun bin Riyab] telah menceritakan kepadaku [Kinanah bin Nu'aim] dari [Qabishah bin Mukhariq Al Hilali] ia berkata, \"Aku menanggung sebuah denda, maka aku pun datang menemui Nabi shallallahu 'alaihi wasallam dan menanyakannya kepada beliau, lalu beliau bersabda: \"Tunggulah wahai Qabishah, hingga datang Zakat kepada kami dan kami bisa memberikannya kepada kamu.\" Kemudian beliau bersabda lagi: \"Wahai Qabishah, sesungguhnya meminta-minta tidaklah halal kecuali bagi salah satu dari tiga orang; seseorang yang menanggung denda, ia boleh meminta. Maka hendaklah ia meminta-minta sampai mendapatkannya, kemudian ia menahan diri. Seorang laki-laki yang tertimpa musibah yang menghancurkan hartanya, ia boleh meminta-minta, maka hendaklah ia meminta hingga mendapatkan penopang hidup atau sesuatu yang dapat menutupi kebutuhan hidup. Dan seseorang yang tertimpa kefakiran hingga tiga orang yang berakal sempurna dari kaumnya mengatakan 'Fulan telah tertimpa kefakiran', ia boleh meminta-minta. Maka hendaklah ia meminta-minta sampai mendapatkan penopang hidup atau penutup kebutuhan hidup, kemudian menahan diri. Wahai Qabishah, meminta-minta dari selain itu adalah sesuatu yang dosa, jika ia makan maka itu dosa.\""
        },
        {
            "number": 1617,
            "arab": " حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ عَنْ عَبَّادِ بْنِ الْعَوَّامِ عَنْ سُفْيَانَ بْنِ حُسَيْنٍ عَنْ الزُّهْرِيِّ عَنْ أَيُّوبَ بْنِ بَشِيرٍ عَنْ حَكِيمِ بْنِ حِزَامٍ أَنَّ رَجُلًا سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّدَقَاتِ أَيُّهَا أَفْضَلُ قَالَ عَلَى ذِي الرَّحِمِ الْكَاشِحِ",
            "id": "Telah menceritakan kepada kami [Sa'id bin Sulaiman] dari ['Abbad bin Al 'Awwam] dari [Sufyan bin Husain] dari [Az Zuhri] dari [Ayyub bin Basyir] dari [Hakim bin Hizam], bahwa seorang laki-laki bertanya kepada Nabi shallallahu 'alaihi wasallam mengenai sedekah apakah yang paling utama?\" Beliau bersabda: \"Sedekah kepada orang yang memiliki hubungan kerabat yang menyembunyikan permusuhannya.\""
        },
        {
            "number": 1618,
            "arab": " أَخْبَرَنَا أَبُو حَاتِمٍ الْبَصْرِيُّ حَدَّثَنَا ابْنُ عَوْنٍ عَنْ حَفْصَةَ بِنْتِ سِيرِينَ عَنْ أُمِّ الرَّائِحِ بِنْتِ صُلَيْعٍ عَنْ سَلْمَانَ بْنِ عَامِرٍ الضَّبِّيِّ ذَكَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الصَّدَقَةَ عَلَى الْمِسْكِينِ صَدَقَةٌ وَإِنَّهَا عَلَى ذِي الرَّحِمِ اثْنَتَانِ صَدَقَةٌ وَصِلَةٌ",
            "id": "Telah mengabarkan kepada kami [Abu Hatim Al Bashri] telah menceritakan kepada kami [Ibnu 'Aun] dari [Hafshah binti Sirin] dari [Ummu Ar Raih binti Shulai'] dari [Salman bin 'Amir Adl Dlabbi] ia menyebutkan, bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya bersedekah kepada orang miskin hanya sebuah sedekah, dan sedekah kepada orang yang memiliki hubungan kerabat adalah dua pahala; pahala sedekah dan pahala menyambung hubungan kekerabatan.\""
        },
        {
            "number": 1619,
            "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ ابْنِ عُيَيْنَةَ قَالَ وَقَدْ سَمِعْتُهُ مِنَ الثَّوْرِيِّ عَنْ عَاصِمٍ عَنْ حَفْصَةَ بِنْتِ سِيرِينَ عَنْ الرَّبَابِ عَنْ سَلْمَانَ بْنِ عَامِرٍ الضَّبِّيِّ يَرْفَعُهُ قَالَ الصَّدَقَةُ عَلَى الْمِسْكِينِ صَدَقَةٌ وَهِيَ عَلَى ذِي الرَّحِمِ اثْنَتَانِ صَدَقَةٌ وَصِلَةٌ",
            "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Ibnu 'Uyainah] ia berkata, aku telah mendengarnya dari [Ats Tsauri] dari ['Ashim] dari [Hafshah binti Sirin] dari [Ar Rabab] dari [Salman bin 'Amir Adl Dabbi] dan ia memarfu'kannya, ia berkata, \"Bersedekah kepada orang miskin bernilai satu sedekah, dan sedekah kepada orang yang memiliki hubungan kerabat mempunyai dua nilai; pahala sedekah dan pahala menyambung hubungan kekerabatan.\""
        }
    ]
}